openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S

========================================================================

** ELF Header Information

    File Name: stm32f103rfc6\stm32f103rfc6.axf

    Machine class: ELFCLASS32 (32-bit)
    Data encoding: ELFDATA2LSB (Little endian)
    Header version: EV_CURRENT (Current version)
    Operating System ABI: none
    ABI Version: 0
    File Type: ET_EXEC (Executable) (2)
    Machine: EM_ARM (ARM)

    Image Entry point: 0x08000131
    Flags: EF_ARM_HASENTRY + EF_ARM_ABI_FLOAT_SOFT (0x05000202)

    ARM ELF revision: 5 (ABI version 2)

    Conforms to Soft float procedure-call standard

    Built with
    Component: ARM Compiler 5.06 update 6 (build 750) Tool: armasm [4d35ec]
    Component: ARM Compiler 5.06 update 6 (build 750) Tool: armlink [4d35ed]

    Header size: 52 bytes (0x34)
    Program header entry size: 32 bytes (0x20)
    Section header entry size: 40 bytes (0x28)

    Program header entries: 2
    Section header entries: 17

    Program header offset: 940028 (0x000e57fc)
    Section header offset: 940092 (0x000e583c)

    Section header string table index: 16

========================================================================

** Program header #0 (PT_LOAD) [PF_X + PF_W + PF_R + PF_ARM_ENTRY]
    Size : 43044 bytes (33396 bytes in file)
    Virtual address: 0x08000000 (Alignment 8)


====================================

** Program header #1 (PT_LOAD) [PF_X + PF_R]
    Size : 2876 bytes
    Virtual address: 0x20017000 (Alignment 4)


========================================================================

** Section #1 'ER_IROM1' (SHT_PROGBITS) [SHF_ALLOC + SHF_EXECINSTR]
    Size   : 33284 bytes (alignment 4)
    Address: 0x08000000

    $d.realdata
    RESET
    __Vectors
        0x08000000:    20002620     &.     DCD    536880672
        0x08000004:    080001d5    ....    DCD    134218197
        0x08000008:    0800102d    -...    DCD    134221869
        0x0800000c:    08001029    )...    DCD    134221865
        0x08000010:    0800102b    +...    DCD    134221867
        0x08000014:    080007e1    ....    DCD    134219745
        0x08000018:    08001039    9...    DCD    134221881
        0x0800001c:    00000000    ....    DCD    0
        0x08000020:    00000000    ....    DCD    0
        0x08000024:    00000000    ....    DCD    0
        0x08000028:    00000000    ....    DCD    0
        0x0800002c:    08001031    1...    DCD    134221873
        0x08000030:    080007e3    ....    DCD    134219747
        0x08000034:    00000000    ....    DCD    0
        0x08000038:    0800102f    /...    DCD    134221871
        0x0800003c:    08001033    3...    DCD    134221875
        0x08000040:    080001ef    ....    DCD    134218223
        0x08000044:    080001ef    ....    DCD    134218223
        0x08000048:    080001ef    ....    DCD    134218223
        0x0800004c:    080001ef    ....    DCD    134218223
        0x08000050:    080001ef    ....    DCD    134218223
        0x08000054:    080001ef    ....    DCD    134218223
        0x08000058:    080001ef    ....    DCD    134218223
        0x0800005c:    080001ef    ....    DCD    134218223
        0x08000060:    080001ef    ....    DCD    134218223
        0x08000064:    080001ef    ....    DCD    134218223
        0x08000068:    080001ef    ....    DCD    134218223
        0x0800006c:    080001ef    ....    DCD    134218223
        0x08000070:    080001ef    ....    DCD    134218223
        0x08000074:    080001ef    ....    DCD    134218223
        0x08000078:    080001ef    ....    DCD    134218223
        0x0800007c:    080001ef    ....    DCD    134218223
        0x08000080:    080001ef    ....    DCD    134218223
        0x08000084:    080001ef    ....    DCD    134218223
        0x08000088:    080001ef    ....    DCD    134218223
        0x0800008c:    080001ef    ....    DCD    134218223
        0x08000090:    080001ef    ....    DCD    134218223
        0x08000094:    080001ef    ....    DCD    134218223
        0x08000098:    080001ef    ....    DCD    134218223
        0x0800009c:    080001ef    ....    DCD    134218223
        0x080000a0:    080001ef    ....    DCD    134218223
        0x080000a4:    080001ef    ....    DCD    134218223
        0x080000a8:    080001ef    ....    DCD    134218223
        0x080000ac:    080001ef    ....    DCD    134218223
        0x080000b0:    080001ef    ....    DCD    134218223
        0x080000b4:    080001ef    ....    DCD    134218223
        0x080000b8:    080001ef    ....    DCD    134218223
        0x080000bc:    080001ef    ....    DCD    134218223
        0x080000c0:    080001ef    ....    DCD    134218223
        0x080000c4:    080001ef    ....    DCD    134218223
        0x080000c8:    080001ef    ....    DCD    134218223
        0x080000cc:    080001ef    ....    DCD    134218223
        0x080000d0:    080001ef    ....    DCD    134218223
        0x080000d4:    080001ef    ....    DCD    134218223
        0x080000d8:    080001ef    ....    DCD    134218223
        0x080000dc:    080001ef    ....    DCD    134218223
        0x080000e0:    080001ef    ....    DCD    134218223
        0x080000e4:    080001ef    ....    DCD    134218223
        0x080000e8:    080001ef    ....    DCD    134218223
        0x080000ec:    080001ef    ....    DCD    134218223
        0x080000f0:    080001ef    ....    DCD    134218223
        0x080000f4:    080001ef    ....    DCD    134218223
        0x080000f8:    080001ef    ....    DCD    134218223
        0x080000fc:    080001ef    ....    DCD    134218223
        0x08000100:    080001ef    ....    DCD    134218223
        0x08000104:    080001ef    ....    DCD    134218223
        0x08000108:    080001ef    ....    DCD    134218223
        0x0800010c:    080001ef    ....    DCD    134218223
        0x08000110:    080001ef    ....    DCD    134218223
        0x08000114:    080001ef    ....    DCD    134218223
        0x08000118:    080001ef    ....    DCD    134218223
        0x0800011c:    080001ef    ....    DCD    134218223
        0x08000120:    080001ef    ....    DCD    134218223
        0x08000124:    080001ef    ....    DCD    134218223
        0x08000128:    080001ef    ....    DCD    134218223
        0x0800012c:    080001ef    ....    DCD    134218223
    $t
    !!!main
    __Vectors_End
    __main
        0x08000130:    f000f802    ....    BL       __scatterload ; 0x8000138
        0x08000134:    f000f83e    ..>.    BL       __rt_entry ; 0x80001b4
    !!!scatter
    __scatterload
    __scatterload_rt2
    __scatterload_rt2_thumb_only
        0x08000138:    a00a        ..      ADR      r0,{pc}+0x2c ; 0x8000164
        0x0800013a:    e8900c00    ....    LDM      r0,{r10,r11}
        0x0800013e:    4482        .D      ADD      r10,r10,r0
        0x08000140:    4483        .D      ADD      r11,r11,r0
        0x08000142:    f1aa0701    ....    SUB      r7,r10,#1
    __scatterload_null
        0x08000146:    45da        .E      CMP      r10,r11
        0x08000148:    d101        ..      BNE      0x800014e ; __scatterload_null + 8
        0x0800014a:    f000f833    ..3.    BL       __rt_entry ; 0x80001b4
        0x0800014e:    f2af0e09    ....    ADR      lr,{pc}-7 ; 0x8000147
        0x08000152:    e8ba000f    ....    LDM      r10!,{r0-r3}
        0x08000156:    f0130f01    ....    TST      r3,#1
        0x0800015a:    bf18        ..      IT       NE
        0x0800015c:    1afb        ..      SUBNE    r3,r7,r3
        0x0800015e:    f0430301    C...    ORR      r3,r3,#1
        0x08000162:    4718        .G      BX       r3
    $d
        0x08000164:    00008080    ....    DCD    32896
        0x08000168:    000080a0    ....    DCD    32928
    $t
    !!handler_copy
    __scatterload_copy
        0x0800016c:    3a10        .:      SUBS     r2,r2,#0x10
        0x0800016e:    bf24        $.      ITT      CS
        0x08000170:    c878        x.      LDMCS    r0!,{r3-r6}
        0x08000172:    c178        x.      STMCS    r1!,{r3-r6}
        0x08000174:    d8fa        ..      BHI      __scatterload_copy ; 0x800016c
        0x08000176:    0752        R.      LSLS     r2,r2,#29
        0x08000178:    bf24        $.      ITT      CS
        0x0800017a:    c830        0.      LDMCS    r0!,{r4,r5}
        0x0800017c:    c130        0.      STMCS    r1!,{r4,r5}
        0x0800017e:    bf44        D.      ITT      MI
        0x08000180:    6804        .h      LDRMI    r4,[r0,#0]
        0x08000182:    600c        .`      STRMI    r4,[r1,#0]
        0x08000184:    4770        pG      BX       lr
        0x08000186:    0000        ..      MOVS     r0,r0
    !!handler_zi
    __scatterload_zeroinit
        0x08000188:    2300        .#      MOVS     r3,#0
        0x0800018a:    2400        .$      MOVS     r4,#0
        0x0800018c:    2500        .%      MOVS     r5,#0
        0x0800018e:    2600        .&      MOVS     r6,#0
        0x08000190:    3a10        .:      SUBS     r2,r2,#0x10
        0x08000192:    bf28        (.      IT       CS
        0x08000194:    c178        x.      STMCS    r1!,{r3-r6}
        0x08000196:    d8fb        ..      BHI      0x8000190 ; __scatterload_zeroinit + 8
        0x08000198:    0752        R.      LSLS     r2,r2,#29
        0x0800019a:    bf28        (.      IT       CS
        0x0800019c:    c130        0.      STMCS    r1!,{r4,r5}
        0x0800019e:    bf48        H.      IT       MI
        0x080001a0:    600b        .`      STRMI    r3,[r1,#0]
        0x080001a2:    4770        pG      BX       lr
    .ARM.Collect$$libinit$$00000000
    __rt_lib_init
        0x080001a4:    b51f        ..      PUSH     {r0-r4,lr}
    .ARM.Collect$$libinit$$00000002
    .ARM.Collect$$libinit$$00000004
    .ARM.Collect$$libinit$$00000005
    __rt_lib_init_fp_1
    __rt_lib_init_heap_2
    __rt_lib_init_preinit_1
        0x080001a6:    e89d0003    ....    LDM      sp,{r0,r1}
        0x080001aa:    f000fa1d    ....    BL       _init_alloc ; 0x80005e8
    .ARM.Collect$$libinit$$0000000A
    .ARM.Collect$$libinit$$0000000C
    .ARM.Collect$$libinit$$0000000E
    .ARM.Collect$$libinit$$00000011
    .ARM.Collect$$libinit$$00000013
    .ARM.Collect$$libinit$$00000015
    .ARM.Collect$$libinit$$00000017
    .ARM.Collect$$libinit$$00000019
    .ARM.Collect$$libinit$$0000001B
    .ARM.Collect$$libinit$$0000001D
    .ARM.Collect$$libinit$$0000001F
    .ARM.Collect$$libinit$$00000021
    .ARM.Collect$$libinit$$00000023
    .ARM.Collect$$libinit$$00000025
    .ARM.Collect$$libinit$$0000002C
    .ARM.Collect$$libinit$$0000002E
    .ARM.Collect$$libinit$$00000030
    .ARM.Collect$$libinit$$00000032
    .ARM.Collect$$libinit$$00000033
    __rt_lib_init_alloca_1
    __rt_lib_init_argv_1
    __rt_lib_init_atexit_1
    __rt_lib_init_clock_1
    __rt_lib_init_cpp_1
    __rt_lib_init_exceptions_1
    __rt_lib_init_fp_trap_1
    __rt_lib_init_getenv_1
    __rt_lib_init_heap_1
    __rt_lib_init_lc_collate_1
    __rt_lib_init_lc_ctype_1
    __rt_lib_init_lc_monetary_1
    __rt_lib_init_lc_numeric_1
    __rt_lib_init_lc_time_1
    __rt_lib_init_rand_1
    __rt_lib_init_return
    __rt_lib_init_signal_1
    __rt_lib_init_stdio_1
    __rt_lib_init_user_alloc_1
        0x080001ae:    bd1f        ..      POP      {r0-r4,pc}
    .ARM.Collect$$libshutdown$$00000000
    __rt_lib_shutdown
        0x080001b0:    b510        ..      PUSH     {r4,lr}
    .ARM.Collect$$libshutdown$$00000002
    .ARM.Collect$$libshutdown$$00000004
    .ARM.Collect$$libshutdown$$00000007
    .ARM.Collect$$libshutdown$$0000000A
    .ARM.Collect$$libshutdown$$0000000C
    .ARM.Collect$$libshutdown$$0000000F
    .ARM.Collect$$libshutdown$$00000010
    __rt_lib_shutdown_cpp_1
    __rt_lib_shutdown_fp_trap_1
    __rt_lib_shutdown_heap_1
    __rt_lib_shutdown_return
    __rt_lib_shutdown_signal_1
    __rt_lib_shutdown_stdio_1
    __rt_lib_shutdown_user_alloc_1
        0x080001b2:    bd10        ..      POP      {r4,pc}
    .ARM.Collect$$rtentry$$00000000
    .ARM.Collect$$rtentry$$00000002
    .ARM.Collect$$rtentry$$00000004
    __rt_entry
    __rt_entry_presh_1
    __rt_entry_sh
        0x080001b4:    f000fa74    ..t.    BL       __semihosting_library_function ; 0x80006a0
        0x080001b8:    4611        .F      MOV      r1,r2
    .ARM.Collect$$rtentry$$00000009
    .ARM.Collect$$rtentry$$0000000A
    __rt_entry_li
    __rt_entry_postsh_1
        0x080001ba:    f7fffff3    ....    BL       __rt_lib_init ; 0x80001a4
    .ARM.Collect$$rtentry$$0000000C
    .ARM.Collect$$rtentry$$0000000D
    __rt_entry_main
    __rt_entry_postli_1
        0x080001be:    f004fbb1    ....    BL       main ; 0x8004924
        0x080001c2:    f000fa92    ....    BL       exit ; 0x80006ea
    .ARM.Collect$$rtexit$$00000000
    __rt_exit
        0x080001c6:    b403        ..      PUSH     {r0,r1}
    .ARM.Collect$$rtexit$$00000002
    .ARM.Collect$$rtexit$$00000003
    __rt_exit_ls
    __rt_exit_prels_1
        0x080001c8:    f7fffff2    ....    BL       __rt_lib_shutdown ; 0x80001b0
    .ARM.Collect$$rtexit$$00000004
    __rt_exit_exit
        0x080001cc:    bc03        ..      POP      {r0,r1}
        0x080001ce:    f000fac3    ....    BL       _sys_exit ; 0x8000758
        0x080001d2:    0000        ..      MOVS     r0,r0
    .text
    .emb_text
    Reset_Handler
    _maybe_terminate_alloc
        0x080001d4:    4809        .H      LDR      r0,[pc,#36] ; [0x80001fc] = 0x8001037
        0x080001d6:    4780        .G      BLX      r0
        0x080001d8:    4809        .H      LDR      r0,[pc,#36] ; [0x8000200] = 0x8000131
        0x080001da:    4700        .G      BX       r0
        0x080001dc:    e7fe        ..      B        0x80001dc ; Reset_Handler + 8
        0x080001de:    e7fe        ..      B        0x80001de ; Reset_Handler + 10
        0x080001e0:    e7fe        ..      B        0x80001e0 ; Reset_Handler + 12
        0x080001e2:    e7fe        ..      B        0x80001e2 ; Reset_Handler + 14
        0x080001e4:    e7fe        ..      B        0x80001e4 ; Reset_Handler + 16
        0x080001e6:    e7fe        ..      B        0x80001e6 ; Reset_Handler + 18
        0x080001e8:    e7fe        ..      B        0x80001e8 ; Reset_Handler + 20
        0x080001ea:    e7fe        ..      B        0x80001ea ; Reset_Handler + 22
        0x080001ec:    e7fe        ..      B        0x80001ec ; Reset_Handler + 24
    ADC1_2_IRQHandler
    ADC3_IRQHandler
    CAN1_RX1_IRQHandler
    CAN1_SCE_IRQHandler
    DMA1_Channel1_IRQHandler
    DMA1_Channel2_IRQHandler
    DMA1_Channel3_IRQHandler
    DMA1_Channel4_IRQHandler
    DMA1_Channel5_IRQHandler
    DMA1_Channel6_IRQHandler
    DMA1_Channel7_IRQHandler
    DMA2_Channel1_IRQHandler
    DMA2_Channel2_IRQHandler
    DMA2_Channel3_IRQHandler
    DMA2_Channel4_5_IRQHandler
    EXTI0_IRQHandler
    EXTI15_10_IRQHandler
    EXTI1_IRQHandler
    EXTI2_IRQHandler
    EXTI3_IRQHandler
    EXTI4_IRQHandler
    EXTI9_5_IRQHandler
    FLASH_IRQHandler
    FSMC_IRQHandler
    I2C1_ER_IRQHandler
    I2C1_EV_IRQHandler
    I2C2_ER_IRQHandler
    I2C2_EV_IRQHandler
    PVD_IRQHandler
    RCC_IRQHandler
    RTC_Alarm_IRQHandler
    RTC_IRQHandler
    SDIO_IRQHandler
    SPI1_IRQHandler
    SPI2_IRQHandler
    SPI3_IRQHandler
    TAMPER_IRQHandler
    TIM1_BRK_TIM9_IRQHandler
    TIM1_CC_IRQHandler
    TIM1_TRG_COM_TIM11_IRQHandler
    TIM1_UP_TIM10_IRQHandler
    TIM2_IRQHandler
    TIM3_IRQHandler
    TIM4_IRQHandler
    TIM5_IRQHandler
    TIM6_IRQHandler
    TIM7_IRQHandler
    TIM8_BRK_TIM12_IRQHandler
    TIM8_CC_IRQHandler
    TIM8_TRG_COM_TIM14_IRQHandler
    TIM8_UP_TIM13_IRQHandler
    UART4_IRQHandler
    UART5_IRQHandler
    USART1_IRQHandler
    USART2_IRQHandler
    USART3_IRQHandler
    USBWakeUp_IRQHandler
    USB_HP_CAN1_TX_IRQHandler
    USB_LP_CAN1_RX0_IRQHandler
    WWDG_IRQHandler
        0x080001ee:    e7fe        ..      B        ADC1_2_IRQHandler ; 0x80001ee
    __user_initial_stackheap
        0x080001f0:    4804        .H      LDR      r0,[pc,#16] ; [0x8000204] = 0x20000220
        0x080001f2:    4905        .I      LDR      r1,[pc,#20] ; [0x8000208] = 0x20002620
        0x080001f4:    4a05        .J      LDR      r2,[pc,#20] ; [0x800020c] = 0x20002220
        0x080001f6:    4b06        .K      LDR      r3,[pc,#24] ; [0x8000210] = 0x20002220
        0x080001f8:    4770        pG      BX       lr
    $d
        0x080001fa:    0000        ..      DCW    0
        0x080001fc:    08001037    7...    DCD    134221879
        0x08000200:    08000131    1...    DCD    134218033
        0x08000204:    20000220     ..     DCD    536871456
        0x08000208:    20002620     &.     DCD    536880672
        0x0800020c:    20002220     ".     DCD    536879648
        0x08000210:    20002220     ".     DCD    536879648
    $t
    .text
    calloc
        0x08000214:    b570        p.      PUSH     {r4-r6,lr}
        0x08000216:    fba04001    ...@    UMULL    r4,r0,r0,r1
        0x0800021a:    f1b45180    ...Q    SUBS     r1,r4,#0x10000000
        0x0800021e:    f1700000    p...    SBCS     r0,r0,#0
        0x08000222:    bf24        $.      ITT      CS
        0x08000224:    2000        .       MOVCS    r0,#0
        0x08000226:    bd70        p.      POPCS    {r4-r6,pc}
        0x08000228:    4620         F      MOV      r0,r4
        0x0800022a:    f000f807    ....    BL       malloc ; 0x800023c
        0x0800022e:    0005        ..      MOVS     r5,r0
        0x08000230:    bf1c        ..      ITT      NE
        0x08000232:    4621        !F      MOVNE    r1,r4
        0x08000234:    f000f970    ..p.    BLNE     __aeabi_memclr ; 0x8000518
        0x08000238:    4628        (F      MOV      r0,r5
        0x0800023a:    bd70        p.      POP      {r4-r6,pc}
    .text
    malloc
        0x0800023c:    b570        p.      PUSH     {r4-r6,lr}
        0x0800023e:    4606        .F      MOV      r6,r0
        0x08000240:    f000f9b6    ....    BL       __rt_heap_descriptor ; 0x80005b0
        0x08000244:    6805        .h      LDR      r5,[r0,#0]
        0x08000246:    f106000b    ....    ADD      r0,r6,#0xb
        0x0800024a:    f0200407     ...    BIC      r4,r0,#7
        0x0800024e:    42b4        .B      CMP      r4,r6
        0x08000250:    bf9c        ..      ITT      LS
        0x08000252:    2000        .       MOVLS    r0,#0
        0x08000254:    bd70        p.      POPLS    {r4-r6,pc}
        0x08000256:    462b        +F      MOV      r3,r5
        0x08000258:    686a        jh      LDR      r2,[r5,#4]
        0x0800025a:    b1ba        ..      CBZ      r2,0x800028c ; malloc + 80
        0x0800025c:    6810        .h      LDR      r0,[r2,#0]
        0x0800025e:    42a0        .B      CMP      r0,r4
        0x08000260:    d310        ..      BCC      0x8000284 ; malloc + 72
        0x08000262:    f1040108    ....    ADD      r1,r4,#8
        0x08000266:    4288        .B      CMP      r0,r1
        0x08000268:    bf3c        <.      ITT      CC
        0x0800026a:    6850        Ph      LDRCC    r0,[r2,#4]
        0x0800026c:    6058        X`      STRCC    r0,[r3,#4]
        0x0800026e:    d307        ..      BCC      0x8000280 ; malloc + 68
        0x08000270:    6851        Qh      LDR      r1,[r2,#4]
        0x08000272:    1910        ..      ADDS     r0,r2,r4
        0x08000274:    6041        A`      STR      r1,[r0,#4]
        0x08000276:    6811        .h      LDR      r1,[r2,#0]
        0x08000278:    1b09        ..      SUBS     r1,r1,r4
        0x0800027a:    6001        .`      STR      r1,[r0,#0]
        0x0800027c:    6058        X`      STR      r0,[r3,#4]
        0x0800027e:    6014        .`      STR      r4,[r2,#0]
        0x08000280:    1d10        ..      ADDS     r0,r2,#4
        0x08000282:    bd70        p.      POP      {r4-r6,pc}
        0x08000284:    4613        .F      MOV      r3,r2
        0x08000286:    6852        Rh      LDR      r2,[r2,#4]
        0x08000288:    2a00        .*      CMP      r2,#0
        0x0800028a:    d1e7        ..      BNE      0x800025c ; malloc + 32
        0x0800028c:    4621        !F      MOV      r1,r4
        0x0800028e:    4628        (F      MOV      r0,r5
        0x08000290:    f000f996    ....    BL       __Heap_Full ; 0x80005c0
        0x08000294:    2800        .(      CMP      r0,#0
        0x08000296:    d1de        ..      BNE      0x8000256 ; malloc + 26
        0x08000298:    bd70        p.      POP      {r4-r6,pc}
    .text
    free
        0x0800029a:    b570        p.      PUSH     {r4-r6,lr}
        0x0800029c:    4604        .F      MOV      r4,r0
        0x0800029e:    1f05        ..      SUBS     r5,r0,#4
        0x080002a0:    f000f986    ....    BL       __rt_heap_descriptor ; 0x80005b0
        0x080002a4:    6800        .h      LDR      r0,[r0,#0]
        0x080002a6:    2c00        .,      CMP      r4,#0
        0x080002a8:    bf14        ..      ITE      NE
        0x080002aa:    6844        Dh      LDRNE    r4,[r0,#4]
        0x080002ac:    bd70        p.      POPEQ    {r4-r6,pc}
        0x080002ae:    2c00        .,      CMP      r4,#0
        0x080002b0:    bf18        ..      IT       NE
        0x080002b2:    42ac        .B      CMPNE    r4,r5
        0x080002b4:    bf3c        <.      ITT      CC
        0x080002b6:    4620         F      MOVCC    r0,r4
        0x080002b8:    6864        dh      LDRCC    r4,[r4,#4]
        0x080002ba:    d3f8        ..      BCC      0x80002ae ; free + 20
        0x080002bc:    6801        .h      LDR      r1,[r0,#0]
        0x080002be:    180a        ..      ADDS     r2,r1,r0
        0x080002c0:    42aa        .B      CMP      r2,r5
        0x080002c2:    bf18        ..      IT       NE
        0x080002c4:    6045        E`      STRNE    r5,[r0,#4]
        0x080002c6:    d103        ..      BNE      0x80002d0 ; free + 54
        0x080002c8:    682a        *h      LDR      r2,[r5,#0]
        0x080002ca:    4605        .F      MOV      r5,r0
        0x080002cc:    4411        .D      ADD      r1,r1,r2
        0x080002ce:    6001        .`      STR      r1,[r0,#0]
        0x080002d0:    6828        (h      LDR      r0,[r5,#0]
        0x080002d2:    1941        A.      ADDS     r1,r0,r5
        0x080002d4:    42a1        .B      CMP      r1,r4
        0x080002d6:    bf1c        ..      ITT      NE
        0x080002d8:    606c        l`      STRNE    r4,[r5,#4]
        0x080002da:    bd70        p.      POPNE    {r4-r6,pc}
        0x080002dc:    6861        ah      LDR      r1,[r4,#4]
        0x080002de:    6069        i`      STR      r1,[r5,#4]
        0x080002e0:    6821        !h      LDR      r1,[r4,#0]
        0x080002e2:    4408        .D      ADD      r0,r0,r1
        0x080002e4:    6028        (`      STR      r0,[r5,#0]
        0x080002e6:    bd70        p.      POP      {r4-r6,pc}
    .text
    __aeabi_uldivmod
    _ll_udiv
        0x080002e8:    ea530c02    S...    ORRS     r12,r3,r2
        0x080002ec:    f0008069    ..i.    BEQ.W    0x80003c2 ; __aeabi_uldivmod + 218
        0x080002f0:    e92d4bf0    -..K    PUSH     {r4-r9,r11,lr}
        0x080002f4:    f04f0600    O...    MOV      r6,#0
        0x080002f8:    2b00        .+      CMP      r3,#0
        0x080002fa:    bf1f        ..      ITTTT    NE
        0x080002fc:    fab3f583    ....    CLZNE    r5,r3
        0x08000300:    fa03f405    ....    LSLNE    r4,r3,r5
        0x08000304:    fa24f605    $...    LSRNE    r6,r4,r5
        0x08000308:    405e        ^@      EORNE    r6,r6,r3
        0x0800030a:    bf12        ..      ITEE     NE
        0x0800030c:    4316        .C      ORRNE    r6,r6,r2
