openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x0800030e:    fab2f582    ....    CLZEQ    r5,r2
        0x08000312:    fa02f405    ....    LSLEQ    r4,r2,r5
        0x08000316:    f1c50520    .. .    RSB      r5,r5,#0x20
        0x0800031a:    bf1e        ..      ITTT     NE
        0x0800031c:    fa22fc05    "...    LSRNE    r12,r2,r5
        0x08000320:    ea44040c    D...    ORRNE    r4,r4,r12
        0x08000324:    3520         5      ADDNE    r5,r5,#0x20
        0x08000326:    ea564c04    V..L    ORRS     r12,r6,r4,LSL #16
        0x0800032a:    ea4f4414    O..D    LSR      r4,r4,#16
        0x0800032e:    bf18        ..      IT       NE
        0x08000330:    1c64        d.      ADDNE    r4,r4,#1
        0x08000332:    f04f0800    O...    MOV      r8,#0
        0x08000336:    f04f0900    O...    MOV      r9,#0
        0x0800033a:    4290        .B      CMP      r0,r2
        0x0800033c:    eb710c03    q...    SBCS     r12,r1,r3
        0x08000340:    d339        9.      BCC      0x80003b6 ; __aeabi_uldivmod + 206
        0x08000342:    2900        .)      CMP      r1,#0
        0x08000344:    bf19        ..      ITTEE    NE
        0x08000346:    fab1f781    ....    CLZNE    r7,r1
        0x0800034a:    fa01f607    ....    LSLNE    r6,r1,r7
        0x0800034e:    fab0f780    ....    CLZEQ    r7,r0
        0x08000352:    fa00f607    ....    LSLEQ    r6,r0,r7
        0x08000356:    f1c70720    .. .    RSB      r7,r7,#0x20
        0x0800035a:    bf1e        ..      ITTT     NE
        0x0800035c:    fa20fc07     ...    LSRNE    r12,r0,r7
        0x08000360:    ea46060c    F...    ORRNE    r6,r6,r12
        0x08000364:    3720         7      ADDNE    r7,r7,#0x20
        0x08000366:    fbb6fcf4    ....    UDIV     r12,r6,r4
        0x0800036a:    eba70705    ....    SUB      r7,r7,r5
        0x0800036e:    3f10        .?      SUBS     r7,r7,#0x10
        0x08000370:    f0070b1f    ....    AND      r11,r7,#0x1f
        0x08000374:    f1cb0620    .. .    RSB      r6,r11,#0x20
        0x08000378:    fa0cfb0b    ....    LSL      r11,r12,r11
        0x0800037c:    fa2cf606    ,...    LSR      r6,r12,r6
        0x08000380:    bf44        D.      ITT      MI
        0x08000382:    46b3        .F      MOVMI    r11,r6
        0x08000384:    2600        .&      MOVMI    r6,#0
        0x08000386:    2f20         /      CMP      r7,#0x20
        0x08000388:    bfa4        ..      ITT      GE
        0x0800038a:    465e        ^F      MOVGE    r6,r11
        0x0800038c:    f04f0b00    O...    MOVGE    r11,#0
        0x08000390:    ea5b0c06    [...    ORRS     r12,r11,r6
        0x08000394:    bf08        ..      IT       EQ
        0x08000396:    f04f0b01    O...    MOVEQ    r11,#1
        0x0800039a:    eb19090b    ....    ADDS     r9,r9,r11
        0x0800039e:    fbab7c02    ...|    UMULL    r7,r12,r11,r2
        0x080003a2:    eb480806    H...    ADC      r8,r8,r6
        0x080003a6:    1bc0        ..      SUBS     r0,r0,r7
        0x080003a8:    fb06cc02    ....    MLA      r12,r6,r2,r12
        0x080003ac:    fb0bcc03    ....    MLA      r12,r11,r3,r12
        0x080003b0:    eb71010c    q...    SBCS     r1,r1,r12
        0x080003b4:    e7c1        ..      B        0x800033a ; __aeabi_uldivmod + 82
        0x080003b6:    460b        .F      MOV      r3,r1
        0x080003b8:    4602        .F      MOV      r2,r0
        0x080003ba:    4641        AF      MOV      r1,r8
        0x080003bc:    4648        HF      MOV      r0,r9
        0x080003be:    e8bd8bf0    ....    POP      {r4-r9,r11,pc}
        0x080003c2:    b513        ..      PUSH     {r0,r1,r4,lr}
        0x080003c4:    f04f0000    O...    MOV      r0,#0
        0x080003c8:    f04f0100    O...    MOV      r1,#0
        0x080003cc:    f3af8000    ....    NOP.W    
        0x080003d0:    e8bd401c    ...@    POP      {r2-r4,lr}
        0x080003d4:    4770        pG      BX       lr
    .text
    strlen
        0x080003d6:    b510        ..      PUSH     {r4,lr}
        0x080003d8:    1c43        C.      ADDS     r3,r0,#1
        0x080003da:    e002        ..      B        0x80003e2 ; strlen + 12
        0x080003dc:    f8101b01    ....    LDRB     r1,[r0],#1
        0x080003e0:    b171        q.      CBZ      r1,0x8000400 ; strlen + 42
        0x080003e2:    0781        ..      LSLS     r1,r0,#30
        0x080003e4:    d1fa        ..      BNE      0x80003dc ; strlen + 6
        0x080003e6:    f04f3201    O..2    MOV      r2,#0x1010101
        0x080003ea:    c802        ..      LDM      r0!,{r1}
        0x080003ec:    1a8c        ..      SUBS     r4,r1,r2
        0x080003ee:    438c        .C      BICS     r4,r4,r1
        0x080003f0:    ea1411c2    ....    ANDS     r1,r4,r2,LSL #7
        0x080003f4:    d0f9        ..      BEQ      0x80003ea ; strlen + 20
        0x080003f6:    1ac0        ..      SUBS     r0,r0,r3
        0x080003f8:    060a        ..      LSLS     r2,r1,#24
        0x080003fa:    d003        ..      BEQ      0x8000404 ; strlen + 46
        0x080003fc:    1ec0        ..      SUBS     r0,r0,#3
        0x080003fe:    bd10        ..      POP      {r4,pc}
        0x08000400:    1ac0        ..      SUBS     r0,r0,r3
        0x08000402:    bd10        ..      POP      {r4,pc}
        0x08000404:    040a        ..      LSLS     r2,r1,#16
        0x08000406:    d001        ..      BEQ      0x800040c ; strlen + 54
        0x08000408:    1e80        ..      SUBS     r0,r0,#2
        0x0800040a:    bd10        ..      POP      {r4,pc}
        0x0800040c:    0209        ..      LSLS     r1,r1,#8
        0x0800040e:    d0fc        ..      BEQ      0x800040a ; strlen + 52
        0x08000410:    1e40        @.      SUBS     r0,r0,#1
        0x08000412:    bd10        ..      POP      {r4,pc}
    .text
    __aeabi_memcpy
    __rt_memcpy
        0x08000414:    2a03        .*      CMP      r2,#3
        0x08000416:    f2408030    @.0.    BLS.W    _memcpy_lastbytes ; 0x800047a
        0x0800041a:    f0100c03    ....    ANDS     r12,r0,#3
        0x0800041e:    f0008015    ....    BEQ.W    0x800044c ; __aeabi_memcpy + 56
        0x08000422:    f8113b01    ...;    LDRB     r3,[r1],#1
        0x08000426:    f1bc0f02    ....    CMP      r12,#2
        0x0800042a:    4462        bD      ADD      r2,r2,r12
        0x0800042c:    bf98        ..      IT       LS
        0x0800042e:    f811cb01    ....    LDRBLS   r12,[r1],#1
        0x08000432:    f8003b01    ...;    STRB     r3,[r0],#1
        0x08000436:    bf38        8.      IT       CC
        0x08000438:    f8113b01    ...;    LDRBCC   r3,[r1],#1
        0x0800043c:    f1a20204    ....    SUB      r2,r2,#4
        0x08000440:    bf98        ..      IT       LS
        0x08000442:    f800cb01    ....    STRBLS   r12,[r0],#1
        0x08000446:    bf38        8.      IT       CC
        0x08000448:    f8003b01    ...;    STRBCC   r3,[r0],#1
        0x0800044c:    f0110303    ....    ANDS     r3,r1,#3
        0x08000450:    f0008025    ..%.    BEQ.W    __aeabi_memcpy4 ; 0x800049e
        0x08000454:    3a08        .:      SUBS     r2,r2,#8
        0x08000456:    f0c08008    ....    BCC.W    0x800046a ; __aeabi_memcpy + 86
        0x0800045a:    f8513b04    Q..;    LDR      r3,[r1],#4
        0x0800045e:    3a08        .:      SUBS     r2,r2,#8
        0x08000460:    f851cb04    Q...    LDR      r12,[r1],#4
        0x08000464:    e8a01008    ....    STM      r0!,{r3,r12}
        0x08000468:    e7f5        ..      B        0x8000456 ; __aeabi_memcpy + 66
        0x0800046a:    1d12        ..      ADDS     r2,r2,#4
        0x0800046c:    bf5c        \.      ITT      PL
        0x0800046e:    f8513b04    Q..;    LDRPL    r3,[r1],#4
        0x08000472:    f8403b04    @..;    STRPL    r3,[r0],#4
        0x08000476:    f3af8000    ....    NOP.W    
    _memcpy_lastbytes
        0x0800047a:    07d2        ..      LSLS     r2,r2,#31
        0x0800047c:    bf24        $.      ITT      CS
        0x0800047e:    f8113b01    ...;    LDRBCS   r3,[r1],#1
        0x08000482:    f811cb01    ....    LDRBCS   r12,[r1],#1
        0x08000486:    bf48        H.      IT       MI
        0x08000488:    f8112b01    ...+    LDRBMI   r2,[r1],#1
        0x0800048c:    bf24        $.      ITT      CS
        0x0800048e:    f8003b01    ...;    STRBCS   r3,[r0],#1
        0x08000492:    f800cb01    ....    STRBCS   r12,[r0],#1
        0x08000496:    bf48        H.      IT       MI
        0x08000498:    f8002b01    ...+    STRBMI   r2,[r0],#1
        0x0800049c:    4770        pG      BX       lr
    .text
    __aeabi_memcpy4
    __aeabi_memcpy8
    __rt_memcpy_w
        0x0800049e:    b510        ..      PUSH     {r4,lr}
        0x080004a0:    3a20         :      SUBS     r2,r2,#0x20
        0x080004a2:    f0c0800b    ....    BCC.W    0x80004bc ; __aeabi_memcpy4 + 30
        0x080004a6:    e8b15018    ...P    LDM      r1!,{r3,r4,r12,lr}
        0x080004aa:    3a20         :      SUBS     r2,r2,#0x20
        0x080004ac:    e8a05018    ...P    STM      r0!,{r3,r4,r12,lr}
        0x080004b0:    e8b15018    ...P    LDM      r1!,{r3,r4,r12,lr}
        0x080004b4:    e8a05018    ...P    STM      r0!,{r3,r4,r12,lr}
        0x080004b8:    f4bfaff5    ....    BCS.W    0x80004a6 ; __aeabi_memcpy4 + 8
        0x080004bc:    ea5f7c02    _..|    LSLS     r12,r2,#28
        0x080004c0:    bf24        $.      ITT      CS
        0x080004c2:    e8b15018    ...P    LDMCS    r1!,{r3,r4,r12,lr}
        0x080004c6:    e8a05018    ...P    STMCS    r0!,{r3,r4,r12,lr}
        0x080004ca:    bf44        D.      ITT      MI
        0x080004cc:    c918        ..      LDMMI    r1!,{r3,r4}
        0x080004ce:    c018        ..      STMMI    r0!,{r3,r4}
        0x080004d0:    e8bd4010    ...@    POP      {r4,lr}
        0x080004d4:    ea5f7c82    _..|    LSLS     r12,r2,#30
        0x080004d8:    bf24        $.      ITT      CS
        0x080004da:    f8513b04    Q..;    LDRCS    r3,[r1],#4
        0x080004de:    f8403b04    @..;    STRCS    r3,[r0],#4
        0x080004e2:    bf08        ..      IT       EQ
        0x080004e4:    4770        pG      BXEQ     lr
    _memcpy_lastbytes_aligned
        0x080004e6:    07d2        ..      LSLS     r2,r2,#31
        0x080004e8:    bf28        (.      IT       CS
        0x080004ea:    f8313b02    1..;    LDRHCS   r3,[r1],#2
        0x080004ee:    bf48        H.      IT       MI
        0x080004f0:    f8112b01    ...+    LDRBMI   r2,[r1],#1
        0x080004f4:    bf28        (.      IT       CS
        0x080004f6:    f8203b02     ..;    STRHCS   r3,[r0],#2
        0x080004fa:    bf48        H.      IT       MI
        0x080004fc:    f8002b01    ...+    STRBMI   r2,[r0],#1
        0x08000500:    4770        pG      BX       lr
    .text
    memset
        0x08000502:    f00103ff    ....    AND      r3,r1,#0xff
        0x08000506:    4611        .F      MOV      r1,r2
        0x08000508:    b501        ..      PUSH     {r0,lr}
        0x0800050a:    ea432203    C.."    ORR      r2,r3,r3,LSL #8
        0x0800050e:    ea424202    B..B    ORR      r2,r2,r2,LSL #16
        0x08000512:    f000f803    ....    BL       _memset ; 0x800051c
        0x08000516:    bd01        ..      POP      {r0,pc}
    .text
    __aeabi_memclr
    __rt_memclr
        0x08000518:    f04f0200    O...    MOV      r2,#0
    _memset
        0x0800051c:    2904        .)      CMP      r1,#4
        0x0800051e:    f0c08012    ....    BCC.W    0x8000546 ; _memset + 42
        0x08000522:    f0100c03    ....    ANDS     r12,r0,#3
        0x08000526:    f000801b    ....    BEQ.W    _memset_w ; 0x8000560
        0x0800052a:    f1cc0c04    ....    RSB      r12,r12,#4
        0x0800052e:    f1bc0f02    ....    CMP      r12,#2
        0x08000532:    bf18        ..      IT       NE
        0x08000534:    f8002b01    ...+    STRBNE   r2,[r0],#1
        0x08000538:    bfa8        ..      IT       GE
        0x0800053a:    f8202b02     ..+    STRHGE   r2,[r0],#2
        0x0800053e:    eba1010c    ....    SUB      r1,r1,r12
        0x08000542:    f000b80d    ....    B.W      _memset_w ; 0x8000560
        0x08000546:    ea5f7cc1    _..|    LSLS     r12,r1,#31
        0x0800054a:    bf24        $.      ITT      CS
        0x0800054c:    f8002b01    ...+    STRBCS   r2,[r0],#1
        0x08000550:    f8002b01    ...+    STRBCS   r2,[r0],#1
        0x08000554:    bf48        H.      IT       MI
        0x08000556:    f8002b01    ...+    STRBMI   r2,[r0],#1
        0x0800055a:    4770        pG      BX       lr
    .text
    __aeabi_memclr4
    __aeabi_memclr8
    __rt_memclr_w
        0x0800055c:    f04f0200    O...    MOV      r2,#0
    _memset_w
        0x08000560:    b500        ..      PUSH     {lr}
        0x08000562:    4613        .F      MOV      r3,r2
        0x08000564:    4694        .F      MOV      r12,r2
        0x08000566:    4696        .F      MOV      lr,r2
        0x08000568:    3920         9      SUBS     r1,r1,#0x20
        0x0800056a:    bf22        ".      ITTT     CS
        0x0800056c:    e8a0500c    ...P    STMCS    r0!,{r2,r3,r12,lr}
        0x08000570:    e8a0500c    ...P    STMCS    r0!,{r2,r3,r12,lr}
        0x08000574:    f1b10120    .. .    SUBSCS   r1,r1,#0x20
        0x08000578:    f4bfaff7    ....    BCS.W    0x800056a ; _memset_w + 10
        0x0800057c:    0709        ..      LSLS     r1,r1,#28
        0x0800057e:    bf28        (.      IT       CS
        0x08000580:    e8a0500c    ...P    STMCS    r0!,{r2,r3,r12,lr}
        0x08000584:    bf48        H.      IT       MI
        0x08000586:    c00c        ..      STMMI    r0!,{r2,r3}
        0x08000588:    f85deb04    ]...    POP      {lr}
        0x0800058c:    0089        ..      LSLS     r1,r1,#2
        0x0800058e:    bf28        (.      IT       CS
        0x08000590:    f8402b04    @..+    STRCS    r2,[r0],#4
        0x08000594:    bf08        ..      IT       EQ
        0x08000596:    4770        pG      BXEQ     lr
        0x08000598:    bf48        H.      IT       MI
        0x0800059a:    f8202b02     ..+    STRHMI   r2,[r0],#2
        0x0800059e:    f0114f80    ...O    TST      r1,#0x40000000
        0x080005a2:    bf18        ..      IT       NE
        0x080005a4:    f8002b01    ...+    STRBNE   r2,[r0],#1
        0x080005a8:    4770        pG      BX       lr
    .text
    __use_two_region_memory
        0x080005aa:    4770        pG      BX       lr
    __rt_heap_escrow
        0x080005ac:    4770        pG      BX       lr
    __rt_heap_expand
        0x080005ae:    4770        pG      BX       lr
    .text
    __rt_heap_descriptor
        0x080005b0:    4800        .H      LDR      r0,[pc,#0] ; [0x80005b4] = 0x200001c4
        0x080005b2:    4770        pG      BX       lr
    $d
        0x080005b4:    200001c4    ...     DCD    536871364
    $t
    .text
    __use_no_heap
        0x080005b8:    4770        pG      BX       lr
    __heap$guard
        0x080005ba:    4770        pG      BX       lr
    .text
    _terminate_user_alloc
        0x080005bc:    4770        pG      BX       lr
    _init_user_alloc
        0x080005be:    4770        pG      BX       lr
    __Heap_Full
        0x080005c0:    b538        8.      PUSH     {r3-r5,lr}
        0x080005c2:    4604        .F      MOV      r4,r0
        0x080005c4:    460a        .F      MOV      r2,r1
        0x080005c6:    2000        .       MOVS     r0,#0
        0x080005c8:    4669        iF      MOV      r1,sp
        0x080005ca:    f3af8000    ....    NOP.W    
        0x080005ce:    2800        .(      CMP      r0,#0
        0x080005d0:    bf08        ..      IT       EQ
        0x080005d2:    bd38        8.      POPEQ    {r3-r5,pc}
        0x080005d4:    4602        .F      MOV      r2,r0
        0x080005d6:    9900        ..      LDR      r1,[sp,#0]
        0x080005d8:    4620         F      MOV      r0,r4
        0x080005da:    f000f83f    ..?.    BL       __Heap_ProvideMemory ; 0x800065c
        0x080005de:    2001        .       MOVS     r0,#1
        0x080005e0:    bd38        8.      POP      {r3-r5,pc}
    __Heap_Broken
        0x080005e2:    2001        .       MOVS     r0,#1
        0x080005e4:    f000b854    ..T.    B.W      __rt_SIGRTMEM ; 0x8000690
    _init_alloc
        0x080005e8:    b5f8        ..      PUSH     {r3-r7,lr}
        0x080005ea:    f3af8000    ....    NOP.W    
        0x080005ee:    4605        .F      MOV      r5,r0
        0x080005f0:    2000        .       MOVS     r0,#0
        0x080005f2:    460c        .F      MOV      r4,r1
        0x080005f4:    2010        .       MOVS     r0,#0x10
        0x080005f6:    bf00        ..      NOP      
        0x080005f8:    4606        .F      MOV      r6,r0
        0x080005fa:    19a8        ..      ADDS     r0,r5,r6
        0x080005fc:    42a0        .B      CMP      r0,r4
        0x080005fe:    d90d        ..      BLS      0x800061c ; _init_alloc + 52
        0x08000600:    4632        2F      MOV      r2,r6
        0x08000602:    4669        iF      MOV      r1,sp
        0x08000604:    2000        .       MOVS     r0,#0
        0x08000606:    f3af8000    ....    NOP.W    
        0x0800060a:    0007        ..      MOVS     r7,r0
        0x0800060c:    bf08        ..      IT       EQ
        0x0800060e:    f000f83f    ..?.    BLEQ     __rt_SIGRTMEM ; 0x8000690
        0x08000612:    9800        ..      LDR      r0,[sp,#0]
        0x08000614:    42a0        .B      CMP      r0,r4
        0x08000616:    bf18        ..      IT       NE
        0x08000618:    4605        .F      MOVNE    r5,r0
        0x0800061a:    19c4        ..      ADDS     r4,r0,r7
        0x0800061c:    f7ffffc8    ....    BL       __rt_heap_descriptor ; 0x80005b0
        0x08000620:    6005        .`      STR      r5,[r0,#0]
        0x08000622:    4607        .F      MOV      r7,r0
        0x08000624:    1df0        ..      ADDS     r0,r6,#7
        0x08000626:    f0200007     ...    BIC      r0,r0,#7
        0x0800062a:    1946        F.      ADDS     r6,r0,r5
        0x0800062c:    4628        (F      MOV      r0,r5
        0x0800062e:    f000f80a    ....    BL       __Heap_Initialize ; 0x8000646
        0x08000632:    42b4        .B      CMP      r4,r6
        0x08000634:    bf08        ..      IT       EQ
        0x08000636:    bdf8        ..      POPEQ    {r3-r7,pc}
        0x08000638:    1ba2        ..      SUBS     r2,r4,r6
        0x0800063a:    4631        1F      MOV      r1,r6
        0x0800063c:    6838        8h      LDR      r0,[r7,#0]
        0x0800063e:    e8bd40f8    ...@    POP      {r3-r7,lr}
        0x08000642:    f000b80b    ....    B.W      __Heap_ProvideMemory ; 0x800065c
    .text
    __Heap_Initialize
        0x08000646:    2100        .!      MOVS     r1,#0
        0x08000648:    6001        .`      STR      r1,[r0,#0]
        0x0800064a:    e9c01001    ....    STRD     r1,r0,[r0,#4]
        0x0800064e:    4770        pG      BX       lr
    __Heap_DescSize
        0x08000650:    2010        .       MOVS     r0,#0x10
        0x08000652:    4770        pG      BX       lr
    .text
    __user_libspace
    __user_perproc_libspace
    __user_perthread_libspace
        0x08000654:    4800        .H      LDR      r0,[pc,#0] ; [0x8000658] = 0x200001bc
        0x08000656:    4770        pG      BX       lr
    $d
        0x08000658:    200001bc    ...     DCD    536871356
    $t
    .text
    __Heap_ProvideMemory
        0x0800065c:    4603        .F      MOV      r3,r0
        0x0800065e:    6840        @h      LDR      r0,[r0,#4]
        0x08000660:    468c        .F      MOV      r12,r1
        0x08000662:    2800        .(      CMP      r0,#0
        0x08000664:    bf18        ..      IT       NE
        0x08000666:    4288        .B      CMPNE    r0,r1
        0x08000668:    bf3c        <.      ITT      CC
        0x0800066a:    4603        .F      MOVCC    r3,r0
        0x0800066c:    6840        @h      LDRCC    r0,[r0,#4]
        0x0800066e:    d3f8        ..      BCC      0x8000662 ; __Heap_ProvideMemory + 6
        0x08000670:    6818        .h      LDR      r0,[r3,#0]
        0x08000672:    4418        .D      ADD      r0,r0,r3
        0x08000674:    4288        .B      CMP      r0,r1
        0x08000676:    d007        ..      BEQ      0x8000688 ; __Heap_ProvideMemory + 44
        0x08000678:    f10c0003    ....    ADD      r0,r12,#3
        0x0800067c:    f0200007     ...    BIC      r0,r0,#7
        0x08000680:    1d00        ..      ADDS     r0,r0,#4
        0x08000682:    1a41        A.      SUBS     r1,r0,r1
        0x08000684:    1a52        R.      SUBS     r2,r2,r1
        0x08000686:    4601        .F      MOV      r1,r0
        0x08000688:    1d08        ..      ADDS     r0,r1,#4
        0x0800068a:    600a        .`      STR      r2,[r1,#0]
        0x0800068c:    f7ffbe05    ....    B.W      free ; 0x800029a
    .text
    __rt_SIGRTMEM
        0x08000690:    b510        ..      PUSH     {r4,lr}
        0x08000692:    f000f839    ..9.    BL       __rt_SIGRTMEM_inner ; 0x8000708
        0x08000696:    e8bd4010    ...@    POP      {r4,lr}
        0x0800069a:    f000b82f    ../.    B.W      __sig_exit ; 0x80006fc
    .text
    __I$use$semihosting
    __use_no_semihosting_swi
        0x0800069e:    4770        pG      BX       lr
    .text
    .text
    __semihosting_library_function
    __user_setup_stackheap
        0x080006a0:    4675        uF      MOV      r5,lr
        0x080006a2:    f7ffffd7    ....    BL       __user_libspace ; 0x8000654
        0x080006a6:    46ae        .F      MOV      lr,r5
        0x080006a8:    0005        ..      MOVS     r5,r0
        0x080006aa:    4669        iF      MOV      r1,sp
        0x080006ac:    4653        SF      MOV      r3,r10
        0x080006ae:    f0200007     ...    BIC      r0,r0,#7
        0x080006b2:    4685        .F      MOV      sp,r0
        0x080006b4:    b018        ..      ADD      sp,sp,#0x60
        0x080006b6:    b520         .      PUSH     {r5,lr}
        0x080006b8:    f7fffd9a    ....    BL       __user_initial_stackheap ; 0x80001f0
        0x080006bc:    e8bd4020    .. @    POP      {r5,lr}
        0x080006c0:    f04f0600    O...    MOV      r6,#0
        0x080006c4:    f04f0700    O...    MOV      r7,#0
        0x080006c8:    f04f0800    O...    MOV      r8,#0
        0x080006cc:    f04f0b00    O...    MOV      r11,#0
        0x080006d0:    f0210107    !...    BIC      r1,r1,#7
        0x080006d4:    46ac        .F      MOV      r12,r5
        0x080006d6:    e8ac09c0    ....    STM      r12!,{r6-r8,r11}
        0x080006da:    e8ac09c0    ....    STM      r12!,{r6-r8,r11}
        0x080006de:    e8ac09c0    ....    STM      r12!,{r6-r8,r11}
        0x080006e2:    e8ac09c0    ....    STM      r12!,{r6-r8,r11}
        0x080006e6:    468d        .F      MOV      sp,r1
        0x080006e8:    4770        pG      BX       lr
    .text
    exit
        0x080006ea:    b510        ..      PUSH     {r4,lr}
        0x080006ec:    4604        .F      MOV      r4,r0
        0x080006ee:    f3af8000    ....    NOP.W    
        0x080006f2:    4620         F      MOV      r0,r4
        0x080006f4:    e8bd4010    ...@    POP      {r4,lr}
        0x080006f8:    f7ffbd65    ..e.    B.W      __rt_exit ; 0x80001c6
    .text
    __sig_exit
        0x080006fc:    2800        .(      CMP      r0,#0
        0x080006fe:    d001        ..      BEQ      0x8000704 ; __sig_exit + 8
        0x08000700:    f000b82a    ..*.    B.W      _sys_exit ; 0x8000758
        0x08000704:    4770        pG      BX       lr
        0x08000706:    0000        ..      MOVS     r0,r0
    .text
    __rt_SIGRTMEM_inner
