openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08000708:    b510        ..      PUSH     {r4,lr}
        0x0800070a:    2801        .(      CMP      r0,#1
        0x0800070c:    d005        ..      BEQ      0x800071a ; __rt_SIGRTMEM_inner + 18
        0x0800070e:    2100        .!      MOVS     r1,#0
        0x08000710:    a003        ..      ADR      r0,{pc}+0x10 ; 0x8000720
        0x08000712:    f000f827    ..'.    BL       __default_signal_display ; 0x8000764
        0x08000716:    2001        .       MOVS     r0,#1
        0x08000718:    bd10        ..      POP      {r4,pc}
        0x0800071a:    a109        ..      ADR      r1,{pc}+0x26 ; 0x8000740
        0x0800071c:    e7f8        ..      B        0x8000710 ; __rt_SIGRTMEM_inner + 8
    $d
        0x0800071e:    0000        ..      DCW    0
        0x08000720:    52474953    SIGR    DCD    1380403539
        0x08000724:    4d454d54    TMEM    DCD    1296387412
        0x08000728:    754f203a    : Ou    DCD    1968119866
        0x0800072c:    666f2074    t of    DCD    1718558836
        0x08000730:    61656820     hea    DCD    1634035744
        0x08000734:    656d2070    p me    DCD    1701650544
        0x08000738:    79726f6d    mory    DCD    2037542765
        0x0800073c:    00000000    ....    DCD    0
        0x08000740:    6548203a    : He    DCD    1699225658
        0x08000744:    6d207061    ap m    DCD    1830842465
        0x08000748:    726f6d65    emor    DCD    1919905125
        0x0800074c:    6f632079    y co    DCD    1868767353
        0x08000750:    70757272    rrup    DCD    1886745202
        0x08000754:    00646574    ted.    DCD    6579572
    $t
    .text
    _sys_exit
        0x08000758:    4901        .I      LDR      r1,[pc,#4] ; [0x8000760] = 0x20026
        0x0800075a:    2018        .       MOVS     r0,#0x18
        0x0800075c:    beab        ..      BKPT     #0xab
        0x0800075e:    e7fe        ..      B        0x800075e ; _sys_exit + 6
    $d
        0x08000760:    00020026    &...    DCD    131110
    $t
    .text
    __default_signal_display
        0x08000764:    b570        p.      PUSH     {r4-r6,lr}
        0x08000766:    4605        .F      MOV      r5,r0
        0x08000768:    460c        .F      MOV      r4,r1
        0x0800076a:    200a        .       MOVS     r0,#0xa
        0x0800076c:    e000        ..      B        0x8000770 ; __default_signal_display + 12
        0x0800076e:    1c6d        m.      ADDS     r5,r5,#1
        0x08000770:    f000f811    ....    BL       _ttywrch ; 0x8000796
        0x08000774:    b135        5.      CBZ      r5,0x8000784 ; __default_signal_display + 32
        0x08000776:    7828        (x      LDRB     r0,[r5,#0]
        0x08000778:    2800        .(      CMP      r0,#0
        0x0800077a:    d1f8        ..      BNE      0x800076e ; __default_signal_display + 10
        0x0800077c:    e002        ..      B        0x8000784 ; __default_signal_display + 32
        0x0800077e:    1c64        d.      ADDS     r4,r4,#1
        0x08000780:    f000f809    ....    BL       _ttywrch ; 0x8000796
        0x08000784:    b114        ..      CBZ      r4,0x800078c ; __default_signal_display + 40
        0x08000786:    7820         x      LDRB     r0,[r4,#0]
        0x08000788:    2800        .(      CMP      r0,#0
        0x0800078a:    d1f8        ..      BNE      0x800077e ; __default_signal_display + 26
        0x0800078c:    e8bd4070    ..p@    POP      {r4-r6,lr}
        0x08000790:    200a        .       MOVS     r0,#0xa
        0x08000792:    f3af8000    ....    NOP.W    
    .text
    _ttywrch
        0x08000796:    b508        ..      PUSH     {r3,lr}
        0x08000798:    4669        iF      MOV      r1,sp
        0x0800079a:    f88d0000    ....    STRB     r0,[sp,#0]
        0x0800079e:    2003        .       MOVS     r0,#3
        0x080007a0:    beab        ..      BKPT     #0xab
        0x080007a2:    bd08        ..      POP      {r3,pc}
    $Ven$TT$L$$advance_software_protect_crc32
        0x080007a4:    f2475c01    G..\    MOV      r12,#0x7501
        0x080007a8:    f2c20c01    ....    MOVT     r12,#0x2001
        0x080007ac:    4760        `G      BX       r12
    $Ven$TT$L$$advance_software_protect_encrypt_process
        0x080007ae:    f2473c01    G..<    MOV      r12,#0x7301
        0x080007b2:    f2c20c01    ....    MOVT     r12,#0x2001
        0x080007b6:    4760        `G      BX       r12
    $Ven$TT$L$$advance_software_protect_system_reset
        0x080007b8:    f2477c01    G..|    MOV      r12,#0x7701
        0x080007bc:    f2c20c01    ....    MOVT     r12,#0x2001
        0x080007c0:    4760        `G      BX       r12
    $Ven$TT$L$$advance_software_protect_verify_authorization
        0x080007c2:    f6473c01    G..<    MOV      r12,#0x7b01
        0x080007c6:    f2c20c01    ....    MOVT     r12,#0x2001
        0x080007ca:    4760        `G      BX       r12
    $Ven$TT$L$$advance_software_protect_flash_verify
        0x080007cc:    f2470c01    G...    MOV      r12,#0x7001
        0x080007d0:    f2c20c01    ....    MOVT     r12,#0x2001
        0x080007d4:    4760        `G      BX       r12
    $Ven$TT$L$$advance_software_protect_anti_debugger
        0x080007d6:    f2472c01    G..,    MOV      r12,#0x7201
        0x080007da:    f2c20c01    ....    MOVT     r12,#0x2001
        0x080007de:    4760        `G      BX       r12
    i.BusFault_Handler
    BusFault_Handler
        0x080007e0:    e7fe        ..      B        BusFault_Handler ; 0x80007e0
    i.DebugMon_Handler
    DebugMon_Handler
        0x080007e2:    4770        pG      BX       lr
    i.FLASH_OB_DisableWRP
    FLASH_OB_DisableWRP
        0x080007e4:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x080007e8:    f8df809c    ....    LDR      r8,[pc,#156] ; [0x8000888] = 0x40022000
        0x080007ec:    f8d81020    .. .    LDR      r1,[r8,#0x20]
        0x080007f0:    f24c3950    L.P9    MOV      r9,#0xc350
        0x080007f4:    4301        .C      ORRS     r1,r1,r0
        0x080007f6:    b2cf        ..      UXTB     r7,r1
        0x080007f8:    f3c12607    ...&    UBFX     r6,r1,#8,#8
        0x080007fc:    f3c14507    ...E    UBFX     r5,r1,#16,#8
        0x08000800:    0e0c        ..      LSRS     r4,r1,#24
        0x08000802:    4648        HF      MOV      r0,r9
        0x08000804:    f000f91a    ....    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x08000808:    2800        .(      CMP      r0,#0
        0x0800080a:    d13b        ;.      BNE      0x8000884 ; FLASH_OB_DisableWRP + 160
        0x0800080c:    491f        .I      LDR      r1,[pc,#124] ; [0x800088c] = 0x200000b8
        0x0800080e:    61c8        .a      STR      r0,[r1,#0x1c]
        0x08000810:    f000f98e    ....    BL       HAL_FLASHEx_OBErase ; 0x8000b30
        0x08000814:    2800        .(      CMP      r0,#0
        0x08000816:    d135        5.      BNE      0x8000884 ; FLASH_OB_DisableWRP + 160
        0x08000818:    f8d82010    ...     LDR      r2,[r8,#0x10]
        0x0800081c:    f0420210    B...    ORR      r2,r2,#0x10
        0x08000820:    f8c82010    ...     STR      r2,[r8,#0x10]
        0x08000824:    2fff        ./      CMP      r7,#0xff
        0x08000826:    d007        ..      BEQ      0x8000838 ; FLASH_OB_DisableWRP + 84
        0x08000828:    4819        .H      LDR      r0,[pc,#100] ; [0x8000890] = 0x1ffff808
        0x0800082a:    8801        ..      LDRH     r1,[r0,#0]
        0x0800082c:    4339        9C      ORRS     r1,r1,r7
        0x0800082e:    8001        ..      STRH     r1,[r0,#0]
        0x08000830:    4648        HF      MOV      r0,r9
        0x08000832:    f000f903    ....    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x08000836:    b9f8        ..      CBNZ     r0,0x8000878 ; FLASH_OB_DisableWRP + 148
        0x08000838:    2eff        ..      CMP      r6,#0xff
        0x0800083a:    d008        ..      BEQ      0x800084e ; FLASH_OB_DisableWRP + 106
        0x0800083c:    4814        .H      LDR      r0,[pc,#80] ; [0x8000890] = 0x1ffff808
        0x0800083e:    1c80        ..      ADDS     r0,r0,#2
        0x08000840:    8801        ..      LDRH     r1,[r0,#0]
        0x08000842:    4331        1C      ORRS     r1,r1,r6
        0x08000844:    8001        ..      STRH     r1,[r0,#0]
        0x08000846:    4648        HF      MOV      r0,r9
        0x08000848:    f000f8f8    ....    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x0800084c:    b9a0        ..      CBNZ     r0,0x8000878 ; FLASH_OB_DisableWRP + 148
        0x0800084e:    2dff        .-      CMP      r5,#0xff
        0x08000850:    d008        ..      BEQ      0x8000864 ; FLASH_OB_DisableWRP + 128
        0x08000852:    480f        .H      LDR      r0,[pc,#60] ; [0x8000890] = 0x1ffff808
        0x08000854:    1d00        ..      ADDS     r0,r0,#4
        0x08000856:    8801        ..      LDRH     r1,[r0,#0]
        0x08000858:    4329        )C      ORRS     r1,r1,r5
        0x0800085a:    8001        ..      STRH     r1,[r0,#0]
        0x0800085c:    4648        HF      MOV      r0,r9
        0x0800085e:    f000f8ed    ....    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x08000862:    b948        H.      CBNZ     r0,0x8000878 ; FLASH_OB_DisableWRP + 148
        0x08000864:    2cff        .,      CMP      r4,#0xff
        0x08000866:    d007        ..      BEQ      0x8000878 ; FLASH_OB_DisableWRP + 148
        0x08000868:    4809        .H      LDR      r0,[pc,#36] ; [0x8000890] = 0x1ffff808
        0x0800086a:    1d80        ..      ADDS     r0,r0,#6
        0x0800086c:    8801        ..      LDRH     r1,[r0,#0]
        0x0800086e:    4321        !C      ORRS     r1,r1,r4
        0x08000870:    8001        ..      STRH     r1,[r0,#0]
        0x08000872:    4648        HF      MOV      r0,r9
        0x08000874:    f000f8e2    ....    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x08000878:    f8d82010    ...     LDR      r2,[r8,#0x10]
        0x0800087c:    f0220210    "...    BIC      r2,r2,#0x10
        0x08000880:    f8c82010    ...     STR      r2,[r8,#0x10]
        0x08000884:    e8bd87f0    ....    POP      {r4-r10,pc}
    $d
        0x08000888:    40022000    . .@    DCD    1073881088
        0x0800088c:    200000b8    ...     DCD    536871096
        0x08000890:    1ffff808    ....    DCD    536868872
    $t
    i.FLASH_OB_EnableWRP
    FLASH_OB_EnableWRP
        0x08000894:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x08000898:    f8df809c    ....    LDR      r8,[pc,#156] ; [0x8000938] = 0x40022000
        0x0800089c:    f8d81020    .. .    LDR      r1,[r8,#0x20]
        0x080008a0:    f24c3950    L.P9    MOV      r9,#0xc350
        0x080008a4:    4381        .C      BICS     r1,r1,r0
        0x080008a6:    b2cf        ..      UXTB     r7,r1
        0x080008a8:    f3c12607    ...&    UBFX     r6,r1,#8,#8
        0x080008ac:    f3c14507    ...E    UBFX     r5,r1,#16,#8
        0x080008b0:    0e0c        ..      LSRS     r4,r1,#24
        0x080008b2:    4648        HF      MOV      r0,r9
        0x080008b4:    f000f8c2    ....    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x080008b8:    2800        .(      CMP      r0,#0
        0x080008ba:    d13b        ;.      BNE      0x8000934 ; FLASH_OB_EnableWRP + 160
        0x080008bc:    491f        .I      LDR      r1,[pc,#124] ; [0x800093c] = 0x200000b8
        0x080008be:    61c8        .a      STR      r0,[r1,#0x1c]
        0x080008c0:    f000f936    ..6.    BL       HAL_FLASHEx_OBErase ; 0x8000b30
        0x080008c4:    2800        .(      CMP      r0,#0
        0x080008c6:    d135        5.      BNE      0x8000934 ; FLASH_OB_EnableWRP + 160
        0x080008c8:    f8d82010    ...     LDR      r2,[r8,#0x10]
        0x080008cc:    f0420210    B...    ORR      r2,r2,#0x10
        0x080008d0:    f8c82010    ...     STR      r2,[r8,#0x10]
        0x080008d4:    2fff        ./      CMP      r7,#0xff
        0x080008d6:    d007        ..      BEQ      0x80008e8 ; FLASH_OB_EnableWRP + 84
        0x080008d8:    4819        .H      LDR      r0,[pc,#100] ; [0x8000940] = 0x1ffff808
        0x080008da:    8801        ..      LDRH     r1,[r0,#0]
        0x080008dc:    4039        9@      ANDS     r1,r1,r7
        0x080008de:    8001        ..      STRH     r1,[r0,#0]
        0x080008e0:    4648        HF      MOV      r0,r9
        0x080008e2:    f000f8ab    ....    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x080008e6:    b9f8        ..      CBNZ     r0,0x8000928 ; FLASH_OB_EnableWRP + 148
        0x080008e8:    2eff        ..      CMP      r6,#0xff
        0x080008ea:    d008        ..      BEQ      0x80008fe ; FLASH_OB_EnableWRP + 106
        0x080008ec:    4814        .H      LDR      r0,[pc,#80] ; [0x8000940] = 0x1ffff808
        0x080008ee:    1c80        ..      ADDS     r0,r0,#2
        0x080008f0:    8801        ..      LDRH     r1,[r0,#0]
        0x080008f2:    4031        1@      ANDS     r1,r1,r6
        0x080008f4:    8001        ..      STRH     r1,[r0,#0]
        0x080008f6:    4648        HF      MOV      r0,r9
        0x080008f8:    f000f8a0    ....    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x080008fc:    b9a0        ..      CBNZ     r0,0x8000928 ; FLASH_OB_EnableWRP + 148
        0x080008fe:    2dff        .-      CMP      r5,#0xff
        0x08000900:    d008        ..      BEQ      0x8000914 ; FLASH_OB_EnableWRP + 128
        0x08000902:    480f        .H      LDR      r0,[pc,#60] ; [0x8000940] = 0x1ffff808
        0x08000904:    1d00        ..      ADDS     r0,r0,#4
        0x08000906:    8801        ..      LDRH     r1,[r0,#0]
        0x08000908:    4029        )@      ANDS     r1,r1,r5
        0x0800090a:    8001        ..      STRH     r1,[r0,#0]
        0x0800090c:    4648        HF      MOV      r0,r9
        0x0800090e:    f000f895    ....    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x08000912:    b948        H.      CBNZ     r0,0x8000928 ; FLASH_OB_EnableWRP + 148
        0x08000914:    2cff        .,      CMP      r4,#0xff
        0x08000916:    d007        ..      BEQ      0x8000928 ; FLASH_OB_EnableWRP + 148
        0x08000918:    4809        .H      LDR      r0,[pc,#36] ; [0x8000940] = 0x1ffff808
        0x0800091a:    1d80        ..      ADDS     r0,r0,#6
        0x0800091c:    8801        ..      LDRH     r1,[r0,#0]
        0x0800091e:    4021        !@      ANDS     r1,r1,r4
        0x08000920:    8001        ..      STRH     r1,[r0,#0]
        0x08000922:    4648        HF      MOV      r0,r9
        0x08000924:    f000f88a    ....    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x08000928:    f8d82010    ...     LDR      r2,[r8,#0x10]
        0x0800092c:    f0220210    "...    BIC      r2,r2,#0x10
        0x08000930:    f8c82010    ...     STR      r2,[r8,#0x10]
        0x08000934:    e8bd87f0    ....    POP      {r4-r10,pc}
    $d
        0x08000938:    40022000    . .@    DCD    1073881088
        0x0800093c:    200000b8    ...     DCD    536871096
        0x08000940:    1ffff808    ....    DCD    536868872
    $t
    i.FLASH_OB_GetRDP
    FLASH_OB_GetRDP
        0x08000944:    4904        .I      LDR      r1,[pc,#16] ; [0x8000958] = 0x40022000
        0x08000946:    20a5        .       MOVS     r0,#0xa5
        0x08000948:    69c9        .i      LDR      r1,[r1,#0x1c]
        0x0800094a:    f0010102    ....    AND      r1,r1,#2
        0x0800094e:    2902        .)      CMP      r1,#2
        0x08000950:    d100        ..      BNE      0x8000954 ; FLASH_OB_GetRDP + 16
        0x08000952:    2000        .       MOVS     r0,#0
        0x08000954:    4770        pG      BX       lr
    $d
        0x08000956:    0000        ..      DCW    0
        0x08000958:    40022000    . .@    DCD    1073881088
    $t
    i.FLASH_OB_RDP_LevelConfig
    FLASH_OB_RDP_LevelConfig
        0x0800095c:    b570        p.      PUSH     {r4-r6,lr}
        0x0800095e:    4606        .F      MOV      r6,r0
        0x08000960:    f24c3550    L.P5    MOV      r5,#0xc350
        0x08000964:    4628        (F      MOV      r0,r5
        0x08000966:    f000f869    ..i.    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x0800096a:    2800        .(      CMP      r0,#0
        0x0800096c:    d120         .      BNE      0x80009b0 ; FLASH_OB_RDP_LevelConfig + 84
        0x0800096e:    4911        .I      LDR      r1,[pc,#68] ; [0x80009b4] = 0x200000b8
        0x08000970:    61c8        .a      STR      r0,[r1,#0x1c]
        0x08000972:    4c11        .L      LDR      r4,[pc,#68] ; [0x80009b8] = 0x40022000
        0x08000974:    6920         i      LDR      r0,[r4,#0x10]
        0x08000976:    f0400020    @. .    ORR      r0,r0,#0x20
        0x0800097a:    6120         a      STR      r0,[r4,#0x10]
        0x0800097c:    6920         i      LDR      r0,[r4,#0x10]
        0x0800097e:    f0400040    @.@.    ORR      r0,r0,#0x40
        0x08000982:    6120         a      STR      r0,[r4,#0x10]
        0x08000984:    4628        (F      MOV      r0,r5
        0x08000986:    f000f859    ..Y.    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x0800098a:    6921        !i      LDR      r1,[r4,#0x10]
        0x0800098c:    f0210120    !. .    BIC      r1,r1,#0x20
        0x08000990:    6121        !a      STR      r1,[r4,#0x10]
        0x08000992:    2800        .(      CMP      r0,#0
        0x08000994:    d10c        ..      BNE      0x80009b0 ; FLASH_OB_RDP_LevelConfig + 84
        0x08000996:    6920         i      LDR      r0,[r4,#0x10]
        0x08000998:    f0400010    @...    ORR      r0,r0,#0x10
        0x0800099c:    6120         a      STR      r0,[r4,#0x10]
        0x0800099e:    4807        .H      LDR      r0,[pc,#28] ; [0x80009bc] = 0x1ffff800
        0x080009a0:    8006        ..      STRH     r6,[r0,#0]
        0x080009a2:    4628        (F      MOV      r0,r5
        0x080009a4:    f000f84a    ..J.    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x080009a8:    6921        !i      LDR      r1,[r4,#0x10]
        0x080009aa:    f0210110    !...    BIC      r1,r1,#0x10
        0x080009ae:    6121        !a      STR      r1,[r4,#0x10]
        0x080009b0:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x080009b2:    0000        ..      DCW    0
        0x080009b4:    200000b8    ...     DCD    536871096
        0x080009b8:    40022000    . .@    DCD    1073881088
        0x080009bc:    1ffff800    ....    DCD    536868864
    $t
    i.FLASH_SetErrorCode
    FLASH_SetErrorCode
        0x080009c0:    481c        .H      LDR      r0,[pc,#112] ; [0x8000a34] = 0x40022000
        0x080009c2:    2100        .!      MOVS     r1,#0
        0x080009c4:    68c2        .h      LDR      r2,[r0,#0xc]
        0x080009c6:    06d3        ..      LSLS     r3,r2,#27
        0x080009c8:    4a1b        .J      LDR      r2,[pc,#108] ; [0x8000a38] = 0x200000b8
        0x080009ca:    d402        ..      BMI      0x80009d2 ; FLASH_SetErrorCode + 18
        0x080009cc:    6cc3        .l      LDR      r3,[r0,#0x4c]
        0x080009ce:    06db        ..      LSLS     r3,r3,#27
        0x080009d0:    d505        ..      BPL      0x80009de ; FLASH_SetErrorCode + 30
        0x080009d2:    69d1        .i      LDR      r1,[r2,#0x1c]
        0x080009d4:    f0410102    A...    ORR      r1,r1,#2
        0x080009d8:    61d1        .a      STR      r1,[r2,#0x1c]
        0x080009da:    f04f1110    O...    MOV      r1,#0x100010
        0x080009de:    68c3        .h      LDR      r3,[r0,#0xc]
        0x080009e0:    075b        [.      LSLS     r3,r3,#29
        0x080009e2:    d402        ..      BMI      0x80009ea ; FLASH_SetErrorCode + 42
        0x080009e4:    6cc3        .l      LDR      r3,[r0,#0x4c]
        0x080009e6:    075b        [.      LSLS     r3,r3,#29
        0x080009e8:    d505        ..      BPL      0x80009f6 ; FLASH_SetErrorCode + 54
        0x080009ea:    69d3        .i      LDR      r3,[r2,#0x1c]
        0x080009ec:    f0430301    C...    ORR      r3,r3,#1
        0x080009f0:    61d3        .a      STR      r3,[r2,#0x1c]
        0x080009f2:    f0411104    A...    ORR      r1,r1,#0x40004
        0x080009f6:    69c3        .i      LDR      r3,[r0,#0x1c]
        0x080009f8:    07db        ..      LSLS     r3,r3,#31
        0x080009fa:    d007        ..      BEQ      0x8000a0c ; FLASH_SetErrorCode + 76
        0x080009fc:    69d3        .i      LDR      r3,[r2,#0x1c]
        0x080009fe:    f0430304    C...    ORR      r3,r3,#4
        0x08000a02:    61d3        .a      STR      r3,[r2,#0x1c]
        0x08000a04:    69c2        .i      LDR      r2,[r0,#0x1c]
        0x08000a06:    f0220201    "...    BIC      r2,r2,#1
        0x08000a0a:    61c2        .a      STR      r2,[r0,#0x1c]
        0x08000a0c:    f5a17280    ...r    SUB      r2,r1,#0x100
        0x08000a10:    3a01        .:      SUBS     r2,#1
        0x08000a12:    d00a        ..      BEQ      0x8000a2a ; FLASH_SetErrorCode + 106
        0x08000a14:    f0110f35    ..5.    TST      r1,#0x35
        0x08000a18:    d002        ..      BEQ      0x8000a20 ; FLASH_SetErrorCode + 96
        0x08000a1a:    f0010235    ..5.    AND      r2,r1,#0x35
        0x08000a1e:    60c2        .`      STR      r2,[r0,#0xc]
        0x08000a20:    0c0a        ..      LSRS     r2,r1,#16
        0x08000a22:    d001        ..      BEQ      0x8000a28 ; FLASH_SetErrorCode + 104
        0x08000a24:    0c09        ..      LSRS     r1,r1,#16
        0x08000a26:    64c1        .d      STR      r1,[r0,#0x4c]
        0x08000a28:    4770        pG      BX       lr
        0x08000a2a:    69c1        .i      LDR      r1,[r0,#0x1c]
        0x08000a2c:    f0210101    !...    BIC      r1,r1,#1
        0x08000a30:    61c1        .a      STR      r1,[r0,#0x1c]
        0x08000a32:    4770        pG      BX       lr
    $d
        0x08000a34:    40022000    . .@    DCD    1073881088
        0x08000a38:    200000b8    ...     DCD    536871096
    $t
    i.FLASH_WaitForLastOperation
    FLASH_WaitForLastOperation
        0x08000a3c:    b570        p.      PUSH     {r4-r6,lr}
        0x08000a3e:    4605        .F      MOV      r5,r0
        0x08000a40:    f000fa60    ..`.    BL       HAL_GetTick ; 0x8000f04
        0x08000a44:    4606        .F      MOV      r6,r0
        0x08000a46:    4c11        .L      LDR      r4,[pc,#68] ; [0x8000a8c] = 0x40022000
        0x08000a48:    e009        ..      B        0x8000a5e ; FLASH_WaitForLastOperation + 34
        0x08000a4a:    1c68        h.      ADDS     r0,r5,#1
        0x08000a4c:    d007        ..      BEQ      0x8000a5e ; FLASH_WaitForLastOperation + 34
        0x08000a4e:    b125        %.      CBZ      r5,0x8000a5a ; FLASH_WaitForLastOperation + 30
        0x08000a50:    f000fa58    ..X.    BL       HAL_GetTick ; 0x8000f04
        0x08000a54:    1b80        ..      SUBS     r0,r0,r6
        0x08000a56:    42a8        .B      CMP      r0,r5
        0x08000a58:    d901        ..      BLS      0x8000a5e ; FLASH_WaitForLastOperation + 34
        0x08000a5a:    2003        .       MOVS     r0,#3
        0x08000a5c:    bd70        p.      POP      {r4-r6,pc}
        0x08000a5e:    68e0        .h      LDR      r0,[r4,#0xc]
        0x08000a60:    07c0        ..      LSLS     r0,r0,#31
        0x08000a62:    d1f2        ..      BNE      0x8000a4a ; FLASH_WaitForLastOperation + 14
        0x08000a64:    68e0        .h      LDR      r0,[r4,#0xc]
        0x08000a66:    0680        ..      LSLS     r0,r0,#26
        0x08000a68:    d501        ..      BPL      0x8000a6e ; FLASH_WaitForLastOperation + 50
        0x08000a6a:    2020                MOVS     r0,#0x20
