openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08000a6c:    60e0        .`      STR      r0,[r4,#0xc]
        0x08000a6e:    68e0        .h      LDR      r0,[r4,#0xc]
        0x08000a70:    06c0        ..      LSLS     r0,r0,#27
        0x08000a72:    d405        ..      BMI      0x8000a80 ; FLASH_WaitForLastOperation + 68
        0x08000a74:    69e0        .i      LDR      r0,[r4,#0x1c]
        0x08000a76:    07c0        ..      LSLS     r0,r0,#31
        0x08000a78:    d102        ..      BNE      0x8000a80 ; FLASH_WaitForLastOperation + 68
        0x08000a7a:    68e0        .h      LDR      r0,[r4,#0xc]
        0x08000a7c:    0740        @.      LSLS     r0,r0,#29
        0x08000a7e:    d503        ..      BPL      0x8000a88 ; FLASH_WaitForLastOperation + 76
        0x08000a80:    f7ffff9e    ....    BL       FLASH_SetErrorCode ; 0x80009c0
        0x08000a84:    2001        .       MOVS     r0,#1
        0x08000a86:    bd70        p.      POP      {r4-r6,pc}
        0x08000a88:    2000        .       MOVS     r0,#0
        0x08000a8a:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x08000a8c:    40022000    . .@    DCD    1073881088
    $t
    i.HAL_CRC_Accumulate
    HAL_CRC_Accumulate
        0x08000a90:    b530        0.      PUSH     {r4,r5,lr}
        0x08000a92:    2302        .#      MOVS     r3,#2
        0x08000a94:    7143        Cq      STRB     r3,[r0,#5]
        0x08000a96:    2300        .#      MOVS     r3,#0
        0x08000a98:    e005        ..      B        0x8000aa6 ; HAL_CRC_Accumulate + 22
        0x08000a9a:    bf00        ..      NOP      
        0x08000a9c:    6805        .h      LDR      r5,[r0,#0]
        0x08000a9e:    f8514023    Q.#@    LDR      r4,[r1,r3,LSL #2]
        0x08000aa2:    602c        ,`      STR      r4,[r5,#0]
        0x08000aa4:    1c5b        [.      ADDS     r3,r3,#1
        0x08000aa6:    4293        .B      CMP      r3,r2
        0x08000aa8:    d3f8        ..      BCC      0x8000a9c ; HAL_CRC_Accumulate + 12
        0x08000aaa:    6801        .h      LDR      r1,[r0,#0]
        0x08000aac:    6809        .h      LDR      r1,[r1,#0]
        0x08000aae:    2201        ."      MOVS     r2,#1
        0x08000ab0:    7142        Bq      STRB     r2,[r0,#5]
        0x08000ab2:    4608        .F      MOV      r0,r1
        0x08000ab4:    bd30        0.      POP      {r4,r5,pc}
    i.HAL_CRC_Calculate
    HAL_CRC_Calculate
        0x08000ab6:    b530        0.      PUSH     {r4,r5,lr}
        0x08000ab8:    2302        .#      MOVS     r3,#2
        0x08000aba:    7143        Cq      STRB     r3,[r0,#5]
        0x08000abc:    6803        .h      LDR      r3,[r0,#0]
        0x08000abe:    689c        .h      LDR      r4,[r3,#8]
        0x08000ac0:    f0440401    D...    ORR      r4,r4,#1
        0x08000ac4:    609c        .`      STR      r4,[r3,#8]
        0x08000ac6:    2300        .#      MOVS     r3,#0
        0x08000ac8:    e004        ..      B        0x8000ad4 ; HAL_CRC_Calculate + 30
        0x08000aca:    6805        .h      LDR      r5,[r0,#0]
        0x08000acc:    f8514023    Q.#@    LDR      r4,[r1,r3,LSL #2]
        0x08000ad0:    602c        ,`      STR      r4,[r5,#0]
        0x08000ad2:    1c5b        [.      ADDS     r3,r3,#1
        0x08000ad4:    4293        .B      CMP      r3,r2
        0x08000ad6:    d3f8        ..      BCC      0x8000aca ; HAL_CRC_Calculate + 20
        0x08000ad8:    6801        .h      LDR      r1,[r0,#0]
        0x08000ada:    6809        .h      LDR      r1,[r1,#0]
        0x08000adc:    2201        ."      MOVS     r2,#1
        0x08000ade:    7142        Bq      STRB     r2,[r0,#5]
        0x08000ae0:    4608        .F      MOV      r0,r1
        0x08000ae2:    bd30        0.      POP      {r4,r5,pc}
    i.HAL_CRC_Init
    HAL_CRC_Init
        0x08000ae4:    b510        ..      PUSH     {r4,lr}
        0x08000ae6:    0004        ..      MOVS     r4,r0
        0x08000ae8:    d002        ..      BEQ      0x8000af0 ; HAL_CRC_Init + 12
        0x08000aea:    7960        `y      LDRB     r0,[r4,#5]
        0x08000aec:    b110        ..      CBZ      r0,0x8000af4 ; HAL_CRC_Init + 16
        0x08000aee:    e006        ..      B        0x8000afe ; HAL_CRC_Init + 26
        0x08000af0:    2001        .       MOVS     r0,#1
        0x08000af2:    bd10        ..      POP      {r4,pc}
        0x08000af4:    2000        .       MOVS     r0,#0
        0x08000af6:    7120         q      STRB     r0,[r4,#4]
        0x08000af8:    4620         F      MOV      r0,r4
        0x08000afa:    f000f805    ....    BL       HAL_CRC_MspInit ; 0x8000b08
        0x08000afe:    2001        .       MOVS     r0,#1
        0x08000b00:    7160        `q      STRB     r0,[r4,#5]
        0x08000b02:    2000        .       MOVS     r0,#0
        0x08000b04:    bd10        ..      POP      {r4,pc}
        0x08000b06:    0000        ..      MOVS     r0,r0
    i.HAL_CRC_MspInit
    HAL_CRC_MspInit
        0x08000b08:    b508        ..      PUSH     {r3,lr}
        0x08000b0a:    6800        .h      LDR      r0,[r0,#0]
        0x08000b0c:    4906        .I      LDR      r1,[pc,#24] ; [0x8000b28] = 0x40023000
        0x08000b0e:    4288        .B      CMP      r0,r1
        0x08000b10:    d108        ..      BNE      0x8000b24 ; HAL_CRC_MspInit + 28
        0x08000b12:    4806        .H      LDR      r0,[pc,#24] ; [0x8000b2c] = 0x40021000
        0x08000b14:    6941        Ai      LDR      r1,[r0,#0x14]
        0x08000b16:    f0410140    A.@.    ORR      r1,r1,#0x40
        0x08000b1a:    6141        Aa      STR      r1,[r0,#0x14]
        0x08000b1c:    6940        @i      LDR      r0,[r0,#0x14]
        0x08000b1e:    f0000040    ..@.    AND      r0,r0,#0x40
        0x08000b22:    9000        ..      STR      r0,[sp,#0]
        0x08000b24:    bd08        ..      POP      {r3,pc}
    $d
        0x08000b26:    0000        ..      DCW    0
        0x08000b28:    40023000    .0.@    DCD    1073885184
        0x08000b2c:    40021000    ...@    DCD    1073876992
    $t
    i.HAL_FLASHEx_OBErase
    HAL_FLASHEx_OBErase
        0x08000b30:    b570        p.      PUSH     {r4-r6,lr}
        0x08000b32:    f7ffff07    ....    BL       FLASH_OB_GetRDP ; 0x8000944
        0x08000b36:    b2c5        ..      UXTB     r5,r0
        0x08000b38:    f24c3650    L.P6    MOV      r6,#0xc350
        0x08000b3c:    4630        0F      MOV      r0,r6
        0x08000b3e:    f7ffff7d    ..}.    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x08000b42:    2800        .(      CMP      r0,#0
        0x08000b44:    d118        ..      BNE      0x8000b78 ; HAL_FLASHEx_OBErase + 72
        0x08000b46:    490d        .I      LDR      r1,[pc,#52] ; [0x8000b7c] = 0x200000b8
        0x08000b48:    61c8        .a      STR      r0,[r1,#0x1c]
        0x08000b4a:    4c0d        .L      LDR      r4,[pc,#52] ; [0x8000b80] = 0x40022000
        0x08000b4c:    6920         i      LDR      r0,[r4,#0x10]
        0x08000b4e:    f0400020    @. .    ORR      r0,r0,#0x20
        0x08000b52:    6120         a      STR      r0,[r4,#0x10]
        0x08000b54:    6920         i      LDR      r0,[r4,#0x10]
        0x08000b56:    f0400040    @.@.    ORR      r0,r0,#0x40
        0x08000b5a:    6120         a      STR      r0,[r4,#0x10]
        0x08000b5c:    4630        0F      MOV      r0,r6
        0x08000b5e:    f7ffff6d    ..m.    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x08000b62:    6921        !i      LDR      r1,[r4,#0x10]
        0x08000b64:    f0210120    !. .    BIC      r1,r1,#0x20
        0x08000b68:    6121        !a      STR      r1,[r4,#0x10]
        0x08000b6a:    2800        .(      CMP      r0,#0
        0x08000b6c:    d104        ..      BNE      0x8000b78 ; HAL_FLASHEx_OBErase + 72
        0x08000b6e:    4628        (F      MOV      r0,r5
        0x08000b70:    e8bd4070    ..p@    POP      {r4-r6,lr}
        0x08000b74:    f7ffbef2    ....    B.W      FLASH_OB_RDP_LevelConfig ; 0x800095c
        0x08000b78:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x08000b7a:    0000        ..      DCW    0
        0x08000b7c:    200000b8    ...     DCD    536871096
        0x08000b80:    40022000    . .@    DCD    1073881088
    $t
    i.HAL_FLASHEx_OBGetConfig
    HAL_FLASHEx_OBGetConfig
        0x08000b84:    b570        p.      PUSH     {r4-r6,lr}
        0x08000b86:    4604        .F      MOV      r4,r0
        0x08000b88:    4d06        .M      LDR      r5,[pc,#24] ; [0x8000ba4] = 0x40022000
        0x08000b8a:    2007        .       MOVS     r0,#7
        0x08000b8c:    6020         `      STR      r0,[r4,#0]
        0x08000b8e:    6a28        (j      LDR      r0,[r5,#0x20]
        0x08000b90:    60a0        .`      STR      r0,[r4,#8]
        0x08000b92:    f7fffed7    ....    BL       FLASH_OB_GetRDP ; 0x8000944
        0x08000b96:    7420         t      STRB     r0,[r4,#0x10]
        0x08000b98:    69e8        .i      LDR      r0,[r5,#0x1c]
        0x08000b9a:    f3c00083    ....    UBFX     r0,r0,#2,#4
        0x08000b9e:    7460        `t      STRB     r0,[r4,#0x11]
        0x08000ba0:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x08000ba2:    0000        ..      DCW    0
        0x08000ba4:    40022000    . .@    DCD    1073881088
    $t
    i.HAL_FLASHEx_OBProgram
    HAL_FLASHEx_OBProgram
        0x08000ba8:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x08000bac:    4d2d        -M      LDR      r5,[pc,#180] ; [0x8000c64] = 0x200000b8
        0x08000bae:    4604        .F      MOV      r4,r0
        0x08000bb0:    2001        .       MOVS     r0,#1
        0x08000bb2:    7e29        )~      LDRB     r1,[r5,#0x18]
        0x08000bb4:    2901        .)      CMP      r1,#1
        0x08000bb6:    d00e        ..      BEQ      0x8000bd6 ; HAL_FLASHEx_OBProgram + 46
        0x08000bb8:    2101        .!      MOVS     r1,#1
        0x08000bba:    7629        )v      STRB     r1,[r5,#0x18]
        0x08000bbc:    7821        !x      LDRB     r1,[r4,#0]
        0x08000bbe:    f04f0700    O...    MOV      r7,#0
        0x08000bc2:    07c9        ..      LSLS     r1,r1,#31
        0x08000bc4:    d00d        ..      BEQ      0x8000be2 ; HAL_FLASHEx_OBProgram + 58
        0x08000bc6:    6860        `h      LDR      r0,[r4,#4]
        0x08000bc8:    2801        .(      CMP      r0,#1
        0x08000bca:    68a0        .h      LDR      r0,[r4,#8]
        0x08000bcc:    d006        ..      BEQ      0x8000bdc ; HAL_FLASHEx_OBProgram + 52
        0x08000bce:    f7fffe09    ....    BL       FLASH_OB_DisableWRP ; 0x80007e4
        0x08000bd2:    bbe8        ..      CBNZ     r0,0x8000c50 ; HAL_FLASHEx_OBProgram + 168
        0x08000bd4:    e005        ..      B        0x8000be2 ; HAL_FLASHEx_OBProgram + 58
        0x08000bd6:    2002        .       MOVS     r0,#2
        0x08000bd8:    e8bd87f0    ....    POP      {r4-r10,pc}
        0x08000bdc:    f7fffe5a    ..Z.    BL       FLASH_OB_EnableWRP ; 0x8000894
        0x08000be0:    e7f7        ..      B        0x8000bd2 ; HAL_FLASHEx_OBProgram + 42
        0x08000be2:    7821        !x      LDRB     r1,[r4,#0]
        0x08000be4:    0789        ..      LSLS     r1,r1,#30
        0x08000be6:    d503        ..      BPL      0x8000bf0 ; HAL_FLASHEx_OBProgram + 72
        0x08000be8:    7c20         |      LDRB     r0,[r4,#0x10]
        0x08000bea:    f7fffeb7    ....    BL       FLASH_OB_RDP_LevelConfig ; 0x800095c
        0x08000bee:    bb78        x.      CBNZ     r0,0x8000c50 ; HAL_FLASHEx_OBProgram + 168
        0x08000bf0:    7821        !x      LDRB     r1,[r4,#0]
        0x08000bf2:    4e1d        .N      LDR      r6,[pc,#116] ; [0x8000c68] = 0x40022000
        0x08000bf4:    0749        I.      LSLS     r1,r1,#29
        0x08000bf6:    f24c3950    L.P9    MOV      r9,#0xc350
        0x08000bfa:    d516        ..      BPL      0x8000c2a ; HAL_FLASHEx_OBProgram + 130
        0x08000bfc:    f8948011    ....    LDRB     r8,[r4,#0x11]
        0x08000c00:    4648        HF      MOV      r0,r9
        0x08000c02:    f7ffff1b    ....    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x08000c06:    b978        x.      CBNZ     r0,0x8000c28 ; HAL_FLASHEx_OBProgram + 128
        0x08000c08:    61ef        .a      STR      r7,[r5,#0x1c]
        0x08000c0a:    6930        0i      LDR      r0,[r6,#0x10]
        0x08000c0c:    f0400010    @...    ORR      r0,r0,#0x10
        0x08000c10:    6130        0a      STR      r0,[r6,#0x10]
        0x08000c12:    4916        .I      LDR      r1,[pc,#88] ; [0x8000c6c] = 0x1ffff802
        0x08000c14:    f04800f0    H...    ORR      r0,r8,#0xf0
        0x08000c18:    8008        ..      STRH     r0,[r1,#0]
        0x08000c1a:    4648        HF      MOV      r0,r9
        0x08000c1c:    f7ffff0e    ....    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x08000c20:    6931        1i      LDR      r1,[r6,#0x10]
        0x08000c22:    f0210110    !...    BIC      r1,r1,#0x10
        0x08000c26:    6131        1a      STR      r1,[r6,#0x10]
        0x08000c28:    b990        ..      CBNZ     r0,0x8000c50 ; HAL_FLASHEx_OBProgram + 168
        0x08000c2a:    7821        !x      LDRB     r1,[r4,#0]
        0x08000c2c:    0709        ..      LSLS     r1,r1,#28
        0x08000c2e:    d516        ..      BPL      0x8000c5e ; HAL_FLASHEx_OBProgram + 182
        0x08000c30:    f8d48014    ....    LDR      r8,[r4,#0x14]
        0x08000c34:    7e24        $~      LDRB     r4,[r4,#0x18]
        0x08000c36:    4648        HF      MOV      r0,r9
        0x08000c38:    f7ffff00    ....    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x08000c3c:    b940        @.      CBNZ     r0,0x8000c50 ; HAL_FLASHEx_OBProgram + 168
        0x08000c3e:    61ef        .a      STR      r7,[r5,#0x1c]
        0x08000c40:    6930        0i      LDR      r0,[r6,#0x10]
        0x08000c42:    f0400010    @...    ORR      r0,r0,#0x10
        0x08000c46:    6130        0a      STR      r0,[r6,#0x10]
        0x08000c48:    f8a84000    ...@    STRH     r4,[r8,#0]
        0x08000c4c:    4648        HF      MOV      r0,r9
        0x08000c4e:    e000        ..      B        0x8000c52 ; HAL_FLASHEx_OBProgram + 170
        0x08000c50:    e005        ..      B        0x8000c5e ; HAL_FLASHEx_OBProgram + 182
        0x08000c52:    f7fffef3    ....    BL       FLASH_WaitForLastOperation ; 0x8000a3c
        0x08000c56:    6931        1i      LDR      r1,[r6,#0x10]
        0x08000c58:    f0210110    !...    BIC      r1,r1,#0x10
        0x08000c5c:    6131        1a      STR      r1,[r6,#0x10]
        0x08000c5e:    762f        /v      STRB     r7,[r5,#0x18]
        0x08000c60:    e7ba        ..      B        0x8000bd8 ; HAL_FLASHEx_OBProgram + 48
    $d
        0x08000c62:    0000        ..      DCW    0
        0x08000c64:    200000b8    ...     DCD    536871096
        0x08000c68:    40022000    . .@    DCD    1073881088
        0x08000c6c:    1ffff802    ....    DCD    536868866
    $t
    i.HAL_FLASH_Lock
    HAL_FLASH_Lock
        0x08000c70:    4805        .H      LDR      r0,[pc,#20] ; [0x8000c88] = 0x40022000
        0x08000c72:    6901        .i      LDR      r1,[r0,#0x10]
        0x08000c74:    f0410180    A...    ORR      r1,r1,#0x80
        0x08000c78:    6101        .a      STR      r1,[r0,#0x10]
        0x08000c7a:    6d01        .m      LDR      r1,[r0,#0x50]
        0x08000c7c:    f0410180    A...    ORR      r1,r1,#0x80
        0x08000c80:    6501        .e      STR      r1,[r0,#0x50]
        0x08000c82:    2000        .       MOVS     r0,#0
        0x08000c84:    4770        pG      BX       lr
    $d
        0x08000c86:    0000        ..      DCW    0
        0x08000c88:    40022000    . .@    DCD    1073881088
    $t
    i.HAL_FLASH_OB_Lock
    HAL_FLASH_OB_Lock
        0x08000c8c:    4803        .H      LDR      r0,[pc,#12] ; [0x8000c9c] = 0x40022000
        0x08000c8e:    6901        .i      LDR      r1,[r0,#0x10]
        0x08000c90:    f4217100    !..q    BIC      r1,r1,#0x200
        0x08000c94:    6101        .a      STR      r1,[r0,#0x10]
        0x08000c96:    2000        .       MOVS     r0,#0
        0x08000c98:    4770        pG      BX       lr
    $d
        0x08000c9a:    0000        ..      DCW    0
        0x08000c9c:    40022000    . .@    DCD    1073881088
    $t
    i.HAL_FLASH_OB_Unlock
    HAL_FLASH_OB_Unlock
        0x08000ca0:    4805        .H      LDR      r0,[pc,#20] ; [0x8000cb8] = 0x40022000
        0x08000ca2:    6901        .i      LDR      r1,[r0,#0x10]
        0x08000ca4:    0589        ..      LSLS     r1,r1,#22
        0x08000ca6:    d405        ..      BMI      0x8000cb4 ; HAL_FLASH_OB_Unlock + 20
        0x08000ca8:    4904        .I      LDR      r1,[pc,#16] ; [0x8000cbc] = 0x45670123
        0x08000caa:    6081        .`      STR      r1,[r0,#8]
        0x08000cac:    4904        .I      LDR      r1,[pc,#16] ; [0x8000cc0] = 0xcdef89ab
        0x08000cae:    6081        .`      STR      r1,[r0,#8]
        0x08000cb0:    2000        .       MOVS     r0,#0
        0x08000cb2:    4770        pG      BX       lr
        0x08000cb4:    2001        .       MOVS     r0,#1
        0x08000cb6:    4770        pG      BX       lr
    $d
        0x08000cb8:    40022000    . .@    DCD    1073881088
        0x08000cbc:    45670123    #.gE    DCD    1164378403
        0x08000cc0:    cdef89ab    ....    DCD    3455027627
    $t
    i.HAL_FLASH_Unlock
    HAL_FLASH_Unlock
        0x08000cc4:    490b        .I      LDR      r1,[pc,#44] ; [0x8000cf4] = 0x40022000
        0x08000cc6:    b510        ..      PUSH     {r4,lr}
        0x08000cc8:    690a        .i      LDR      r2,[r1,#0x10]
        0x08000cca:    2000        .       MOVS     r0,#0
        0x08000ccc:    0614        ..      LSLS     r4,r2,#24
        0x08000cce:    4b0a        .K      LDR      r3,[pc,#40] ; [0x8000cf8] = 0x45670123
        0x08000cd0:    4a0a        .J      LDR      r2,[pc,#40] ; [0x8000cfc] = 0xcdef89ab
        0x08000cd2:    d505        ..      BPL      0x8000ce0 ; HAL_FLASH_Unlock + 28
        0x08000cd4:    604b        K`      STR      r3,[r1,#4]
        0x08000cd6:    604a        J`      STR      r2,[r1,#4]
        0x08000cd8:    690c        .i      LDR      r4,[r1,#0x10]
        0x08000cda:    0624        $.      LSLS     r4,r4,#24
        0x08000cdc:    d500        ..      BPL      0x8000ce0 ; HAL_FLASH_Unlock + 28
        0x08000cde:    2001        .       MOVS     r0,#1
        0x08000ce0:    6d0c        .m      LDR      r4,[r1,#0x50]
        0x08000ce2:    0624        $.      LSLS     r4,r4,#24
        0x08000ce4:    d505        ..      BPL      0x8000cf2 ; HAL_FLASH_Unlock + 46
        0x08000ce6:    644b        Kd      STR      r3,[r1,#0x44]
        0x08000ce8:    644a        Jd      STR      r2,[r1,#0x44]
        0x08000cea:    6d09        .m      LDR      r1,[r1,#0x50]
        0x08000cec:    0609        ..      LSLS     r1,r1,#24
        0x08000cee:    d500        ..      BPL      0x8000cf2 ; HAL_FLASH_Unlock + 46
        0x08000cf0:    2001        .       MOVS     r0,#1
        0x08000cf2:    bd10        ..      POP      {r4,pc}
    $d
        0x08000cf4:    40022000    . .@    DCD    1073881088
        0x08000cf8:    45670123    #.gE    DCD    1164378403
        0x08000cfc:    cdef89ab    ....    DCD    3455027627
    $t
    i.HAL_GPIO_Init
    HAL_GPIO_Init
        0x08000d00:    e92d4ff8    -..O    PUSH     {r3-r11,lr}
        0x08000d04:    f8df91c8    ....    LDR      r9,[pc,#456] ; [0x8000ed0] = 0x40010400
        0x08000d08:    2400        .$      MOVS     r4,#0
        0x08000d0a:    f1090a04    ....    ADD      r10,r9,#4
        0x08000d0e:    f10a0b04    ....    ADD      r11,r10,#4
        0x08000d12:    4623        #F      MOV      r3,r4
        0x08000d14:    270f        .'      MOVS     r7,#0xf
        0x08000d16:    f10b0e04    ....    ADD      lr,r11,#4
        0x08000d1a:    e0d1        ..      B        0x8000ec0 ; HAL_GPIO_Init + 448
        0x08000d1c:    2501        .%      MOVS     r5,#1
        0x08000d1e:    40a5        .@      LSLS     r5,r5,r4
        0x08000d20:    ea060205    ....    AND      r2,r6,r5
        0x08000d24:    42aa        .B      CMP      r2,r5
        0x08000d26:    d176        v.      BNE      0x8000e16 ; HAL_GPIO_Init + 278
        0x08000d28:    f8dfc1a8    ....    LDR      r12,[pc,#424] ; [0x8000ed4] = 0x10110000
        0x08000d2c:    684e        Nh      LDR      r6,[r1,#4]
        0x08000d2e:    eba6080c    ....    SUB      r8,r6,r12
        0x08000d32:    4566        fE      CMP      r6,r12
        0x08000d34:    d02b        +.      BEQ      0x8000d8e ; HAL_GPIO_Init + 142
        0x08000d36:    dc0d        ..      BGT      0x8000d54 ; HAL_GPIO_Init + 84
        0x08000d38:    2e03        ..      CMP      r6,#3
        0x08000d3a:    d034        4.      BEQ      0x8000da6 ; HAL_GPIO_Init + 166
        0x08000d3c:    dc05        ..      BGT      0x8000d4a ; HAL_GPIO_Init + 74
        0x08000d3e:    b336        6.      CBZ      r6,0x8000d8e ; HAL_GPIO_Init + 142
        0x08000d40:    2e01        ..      CMP      r6,#1
        0x08000d42:    d019        ..      BEQ      0x8000d78 ; HAL_GPIO_Init + 120
        0x08000d44:    2e02        ..      CMP      r6,#2
        0x08000d46:    d12f        /.      BNE      0x8000da8 ; HAL_GPIO_Init + 168
        0x08000d48:    e01b        ..      B        0x8000d82 ; HAL_GPIO_Init + 130
        0x08000d4a:    2e11        ..      CMP      r6,#0x11
        0x08000d4c:    d016        ..      BEQ      0x8000d7c ; HAL_GPIO_Init + 124
        0x08000d4e:    2e12        ..      CMP      r6,#0x12
        0x08000d50:    d12a        *.      BNE      0x8000da8 ; HAL_GPIO_Init + 168
        0x08000d52:    e019        ..      B        0x8000d88 ; HAL_GPIO_Init + 136
        0x08000d54:    f5b81f88    ....    CMP      r8,#0x110000
        0x08000d58:    d019        ..      BEQ      0x8000d8e ; HAL_GPIO_Init + 142
        0x08000d5a:    dc06        ..      BGT      0x8000d6a ; HAL_GPIO_Init + 106
        0x08000d5c:    f5b83f80    ...?    CMP      r8,#0x10000
        0x08000d60:    d015        ..      BEQ      0x8000d8e ; HAL_GPIO_Init + 142
        0x08000d62:    f5b81f80    ....    CMP      r8,#0x100000
        0x08000d66:    d11f        ..      BNE      0x8000da8 ; HAL_GPIO_Init + 168
        0x08000d68:    e011        ..      B        0x8000d8e ; HAL_GPIO_Init + 142
        0x08000d6a:    f5b81f00    ....    CMP      r8,#0x200000
        0x08000d6e:    d00e        ..      BEQ      0x8000d8e ; HAL_GPIO_Init + 142
        0x08000d70:    f5b81f04    ....    CMP      r8,#0x210000
        0x08000d74:    d118        ..      BNE      0x8000da8 ; HAL_GPIO_Init + 168
        0x08000d76:    e00a        ..      B        0x8000d8e ; HAL_GPIO_Init + 142
        0x08000d78:    68cb        .h      LDR      r3,[r1,#0xc]
        0x08000d7a:    e015        ..      B        0x8000da8 ; HAL_GPIO_Init + 168
        0x08000d7c:    68cb        .h      LDR      r3,[r1,#0xc]
        0x08000d7e:    1d1b        ..      ADDS     r3,r3,#4
        0x08000d80:    e012        ..      B        0x8000da8 ; HAL_GPIO_Init + 168
        0x08000d82:    68cb        .h      LDR      r3,[r1,#0xc]
        0x08000d84:    3308        .3      ADDS     r3,r3,#8
        0x08000d86:    e00f        ..      B        0x8000da8 ; HAL_GPIO_Init + 168
        0x08000d88:    68cb        .h      LDR      r3,[r1,#0xc]
        0x08000d8a:    330c        .3      ADDS     r3,r3,#0xc
        0x08000d8c:    e00c        ..      B        0x8000da8 ; HAL_GPIO_Init + 168
        0x08000d8e:    688b        .h      LDR      r3,[r1,#8]
