openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08000d90:    b12b        +.      CBZ      r3,0x8000d9e ; HAL_GPIO_Init + 158
        0x08000d92:    2b01        .+      CMP      r3,#1
        0x08000d94:    f04f0308    O...    MOV      r3,#8
        0x08000d98:    d003        ..      BEQ      0x8000da2 ; HAL_GPIO_Init + 162
        0x08000d9a:    6145        Ea      STR      r5,[r0,#0x14]
        0x08000d9c:    e004        ..      B        0x8000da8 ; HAL_GPIO_Init + 168
        0x08000d9e:    2304        .#      MOVS     r3,#4
        0x08000da0:    e002        ..      B        0x8000da8 ; HAL_GPIO_Init + 168
        0x08000da2:    6105        .a      STR      r5,[r0,#0x10]
        0x08000da4:    e000        ..      B        0x8000da8 ; HAL_GPIO_Init + 168
        0x08000da6:    2300        .#      MOVS     r3,#0
        0x08000da8:    2aff        .*      CMP      r2,#0xff
        0x08000daa:    d801        ..      BHI      0x8000db0 ; HAL_GPIO_Init + 176
        0x08000dac:    4606        .F      MOV      r6,r0
        0x08000dae:    e001        ..      B        0x8000db4 ; HAL_GPIO_Init + 180
        0x08000db0:    f1000604    ....    ADD      r6,r0,#4
        0x08000db4:    ea4f0584    O...    LSL      r5,r4,#2
        0x08000db8:    d901        ..      BLS      0x8000dbe ; HAL_GPIO_Init + 190
        0x08000dba:    f1a50520    .. .    SUB      r5,r5,#0x20
        0x08000dbe:    f8d68000    ....    LDR      r8,[r6,#0]
        0x08000dc2:    fa07fc05    ....    LSL      r12,r7,r5
        0x08000dc6:    ea28080c    (...    BIC      r8,r8,r12
        0x08000dca:    fa03f505    ....    LSL      r5,r3,r5
        0x08000dce:    ea480805    H...    ORR      r8,r8,r5
        0x08000dd2:    f8c68000    ....    STR      r8,[r6,#0]
        0x08000dd6:    684d        Mh      LDR      r5,[r1,#4]
        0x08000dd8:    00ed        ..      LSLS     r5,r5,#3
        0x08000dda:    d570        p.      BPL      0x8000ebe ; HAL_GPIO_Init + 446
        0x08000ddc:    4d3e        >M      LDR      r5,[pc,#248] ; [0x8000ed8] = 0x40021000
        0x08000dde:    69ae        .i      LDR      r6,[r5,#0x18]
        0x08000de0:    f0460601    F...    ORR      r6,r6,#1
        0x08000de4:    61ae        .a      STR      r6,[r5,#0x18]
        0x08000de6:    69ad        .i      LDR      r5,[r5,#0x18]
        0x08000de8:    f0240603    $...    BIC      r6,r4,#3
        0x08000dec:    f0050501    ....    AND      r5,r5,#1
        0x08000df0:    9500        ..      STR      r5,[sp,#0]
        0x08000df2:    4d3a        :M      LDR      r5,[pc,#232] ; [0x8000edc] = 0x40010000
        0x08000df4:    eb060c05    ....    ADD      r12,r6,r5
        0x08000df8:    f8dc5008    ...P    LDR      r5,[r12,#8]
        0x08000dfc:    07a6        ..      LSLS     r6,r4,#30
        0x08000dfe:    0f36        6.      LSRS     r6,r6,#28
        0x08000e00:    fa07f806    ....    LSL      r8,r7,r6
        0x08000e04:    ea250508    %...    BIC      r5,r5,r8
        0x08000e08:    f8df80d4    ....    LDR      r8,[pc,#212] ; [0x8000ee0] = 0x40010800
        0x08000e0c:    4540        @E      CMP      r0,r8
        0x08000e0e:    d103        ..      BNE      0x8000e18 ; HAL_GPIO_Init + 280
        0x08000e10:    f04f0800    O...    MOV      r8,#0
        0x08000e14:    e025        %.      B        0x8000e62 ; HAL_GPIO_Init + 354
        0x08000e16:    e052        R.      B        0x8000ebe ; HAL_GPIO_Init + 446
        0x08000e18:    f8df80c8    ....    LDR      r8,[pc,#200] ; [0x8000ee4] = 0x40010c00
        0x08000e1c:    4540        @E      CMP      r0,r8
        0x08000e1e:    d102        ..      BNE      0x8000e26 ; HAL_GPIO_Init + 294
        0x08000e20:    f04f0801    O...    MOV      r8,#1
        0x08000e24:    e01d        ..      B        0x8000e62 ; HAL_GPIO_Init + 354
        0x08000e26:    f8df80c0    ....    LDR      r8,[pc,#192] ; [0x8000ee8] = 0x40011000
        0x08000e2a:    4540        @E      CMP      r0,r8
        0x08000e2c:    d102        ..      BNE      0x8000e34 ; HAL_GPIO_Init + 308
        0x08000e2e:    f04f0802    O...    MOV      r8,#2
        0x08000e32:    e016        ..      B        0x8000e62 ; HAL_GPIO_Init + 354
        0x08000e34:    f8df80b4    ....    LDR      r8,[pc,#180] ; [0x8000eec] = 0x40011400
        0x08000e38:    4540        @E      CMP      r0,r8
        0x08000e3a:    d102        ..      BNE      0x8000e42 ; HAL_GPIO_Init + 322
        0x08000e3c:    f04f0803    O...    MOV      r8,#3
        0x08000e40:    e00f        ..      B        0x8000e62 ; HAL_GPIO_Init + 354
        0x08000e42:    f8df80ac    ....    LDR      r8,[pc,#172] ; [0x8000ef0] = 0x40011800
        0x08000e46:    4540        @E      CMP      r0,r8
        0x08000e48:    d102        ..      BNE      0x8000e50 ; HAL_GPIO_Init + 336
        0x08000e4a:    f04f0804    O...    MOV      r8,#4
        0x08000e4e:    e008        ..      B        0x8000e62 ; HAL_GPIO_Init + 354
        0x08000e50:    f8df80a0    ....    LDR      r8,[pc,#160] ; [0x8000ef4] = 0x40011c00
        0x08000e54:    4540        @E      CMP      r0,r8
        0x08000e56:    d102        ..      BNE      0x8000e5e ; HAL_GPIO_Init + 350
        0x08000e58:    f04f0805    O...    MOV      r8,#5
        0x08000e5c:    e001        ..      B        0x8000e62 ; HAL_GPIO_Init + 354
        0x08000e5e:    f04f0806    O...    MOV      r8,#6
        0x08000e62:    fa08f806    ....    LSL      r8,r8,r6
        0x08000e66:    ea480805    H...    ORR      r8,r8,r5
        0x08000e6a:    f8cc8008    ....    STR      r8,[r12,#8]
        0x08000e6e:    684d        Mh      LDR      r5,[r1,#4]
        0x08000e70:    f8d96000    ...`    LDR      r6,[r9,#0]
        0x08000e74:    03ed        ..      LSLS     r5,r5,#15
        0x08000e76:    464d        MF      MOV      r5,r9
        0x08000e78:    d501        ..      BPL      0x8000e7e ; HAL_GPIO_Init + 382
        0x08000e7a:    4316        .C      ORRS     r6,r6,r2
        0x08000e7c:    e000        ..      B        0x8000e80 ; HAL_GPIO_Init + 384
        0x08000e7e:    4396        .C      BICS     r6,r6,r2
        0x08000e80:    602e        .`      STR      r6,[r5,#0]
        0x08000e82:    684d        Mh      LDR      r5,[r1,#4]
        0x08000e84:    f8da6000    ...`    LDR      r6,[r10,#0]
        0x08000e88:    03ad        ..      LSLS     r5,r5,#14
        0x08000e8a:    4655        UF      MOV      r5,r10
        0x08000e8c:    d501        ..      BPL      0x8000e92 ; HAL_GPIO_Init + 402
        0x08000e8e:    4316        .C      ORRS     r6,r6,r2
        0x08000e90:    e000        ..      B        0x8000e94 ; HAL_GPIO_Init + 404
        0x08000e92:    4396        .C      BICS     r6,r6,r2
        0x08000e94:    602e        .`      STR      r6,[r5,#0]
        0x08000e96:    684d        Mh      LDR      r5,[r1,#4]
        0x08000e98:    f8db6000    ...`    LDR      r6,[r11,#0]
        0x08000e9c:    02ed        ..      LSLS     r5,r5,#11
        0x08000e9e:    465d        ]F      MOV      r5,r11
        0x08000ea0:    d501        ..      BPL      0x8000ea6 ; HAL_GPIO_Init + 422
        0x08000ea2:    4316        .C      ORRS     r6,r6,r2
        0x08000ea4:    e000        ..      B        0x8000ea8 ; HAL_GPIO_Init + 424
        0x08000ea6:    4396        .C      BICS     r6,r6,r2
        0x08000ea8:    602e        .`      STR      r6,[r5,#0]
        0x08000eaa:    684d        Mh      LDR      r5,[r1,#4]
        0x08000eac:    f8de6000    ...`    LDR      r6,[lr,#0]
        0x08000eb0:    02ad        ..      LSLS     r5,r5,#10
        0x08000eb2:    4675        uF      MOV      r5,lr
        0x08000eb4:    d501        ..      BPL      0x8000eba ; HAL_GPIO_Init + 442
        0x08000eb6:    4316        .C      ORRS     r6,r6,r2
        0x08000eb8:    e000        ..      B        0x8000ebc ; HAL_GPIO_Init + 444
        0x08000eba:    4396        .C      BICS     r6,r6,r2
        0x08000ebc:    602e        .`      STR      r6,[r5,#0]
        0x08000ebe:    1c64        d.      ADDS     r4,r4,#1
        0x08000ec0:    680a        .h      LDR      r2,[r1,#0]
        0x08000ec2:    4616        .F      MOV      r6,r2
        0x08000ec4:    40e2        .@      LSRS     r2,r2,r4
        0x08000ec6:    f47faf29    ..).    BNE      0x8000d1c ; HAL_GPIO_Init + 28
        0x08000eca:    e8bd8ff8    ....    POP      {r3-r11,pc}
    $d
        0x08000ece:    0000        ..      DCW    0
        0x08000ed0:    40010400    ...@    DCD    1073808384
        0x08000ed4:    10110000    ....    DCD    269549568
        0x08000ed8:    40021000    ...@    DCD    1073876992
        0x08000edc:    40010000    ...@    DCD    1073807360
        0x08000ee0:    40010800    ...@    DCD    1073809408
        0x08000ee4:    40010c00    ...@    DCD    1073810432
        0x08000ee8:    40011000    ...@    DCD    1073811456
        0x08000eec:    40011400    ...@    DCD    1073812480
        0x08000ef0:    40011800    ...@    DCD    1073813504
        0x08000ef4:    40011c00    ...@    DCD    1073814528
    $t
    i.HAL_GPIO_WritePin
    HAL_GPIO_WritePin
        0x08000ef8:    b10a        ..      CBZ      r2,0x8000efe ; HAL_GPIO_WritePin + 6
        0x08000efa:    6101        .a      STR      r1,[r0,#0x10]
        0x08000efc:    4770        pG      BX       lr
        0x08000efe:    0409        ..      LSLS     r1,r1,#16
        0x08000f00:    e7fb        ..      B        0x8000efa ; HAL_GPIO_WritePin + 2
        0x08000f02:    0000        ..      MOVS     r0,r0
    i.HAL_GetTick
    HAL_GetTick
        0x08000f04:    4801        .H      LDR      r0,[pc,#4] ; [0x8000f0c] = 0x2000000c
        0x08000f06:    6880        .h      LDR      r0,[r0,#8]
        0x08000f08:    4770        pG      BX       lr
    $d
        0x08000f0a:    0000        ..      DCW    0
        0x08000f0c:    2000000c    ...     DCD    536870924
    $t
    i.HAL_IncTick
    HAL_IncTick
        0x08000f10:    4802        .H      LDR      r0,[pc,#8] ; [0x8000f1c] = 0x2000000c
        0x08000f12:    6881        .h      LDR      r1,[r0,#8]
        0x08000f14:    7802        .x      LDRB     r2,[r0,#0]
        0x08000f16:    4411        .D      ADD      r1,r1,r2
        0x08000f18:    6081        .`      STR      r1,[r0,#8]
        0x08000f1a:    4770        pG      BX       lr
    $d
        0x08000f1c:    2000000c    ...     DCD    536870924
    $t
    i.HAL_Init
    HAL_Init
        0x08000f20:    4807        .H      LDR      r0,[pc,#28] ; [0x8000f40] = 0x40022000
        0x08000f22:    b510        ..      PUSH     {r4,lr}
        0x08000f24:    6801        .h      LDR      r1,[r0,#0]
        0x08000f26:    f0410110    A...    ORR      r1,r1,#0x10
        0x08000f2a:    6001        .`      STR      r1,[r0,#0]
        0x08000f2c:    2003        .       MOVS     r0,#3
        0x08000f2e:    f000f869    ..i.    BL       HAL_NVIC_SetPriorityGrouping ; 0x8001004
        0x08000f32:    200f        .       MOVS     r0,#0xf
        0x08000f34:    f000f806    ....    BL       HAL_InitTick ; 0x8000f44
        0x08000f38:    f000f824    ..$.    BL       HAL_MspInit ; 0x8000f84
        0x08000f3c:    2000        .       MOVS     r0,#0
        0x08000f3e:    bd10        ..      POP      {r4,pc}
    $d
        0x08000f40:    40022000    . .@    DCD    1073881088
    $t
    i.HAL_InitTick
    HAL_InitTick
        0x08000f44:    b570        p.      PUSH     {r4-r6,lr}
        0x08000f46:    4d0d        .M      LDR      r5,[pc,#52] ; [0x8000f7c] = 0x2000000c
        0x08000f48:    4604        .F      MOV      r4,r0
        0x08000f4a:    f44f717a    O.zq    MOV      r1,#0x3e8
        0x08000f4e:    7828        (x      LDRB     r0,[r5,#0]
        0x08000f50:    fbb1f0f0    ....    UDIV     r0,r1,r0
        0x08000f54:    490a        .I      LDR      r1,[pc,#40] ; [0x8000f80] = 0x20000018
        0x08000f56:    6809        .h      LDR      r1,[r1,#0]
        0x08000f58:    fbb1f0f0    ....    UDIV     r0,r1,r0
        0x08000f5c:    f000faec    ....    BL       HAL_SYSTICK_Config ; 0x8001538
        0x08000f60:    b948        H.      CBNZ     r0,0x8000f76 ; HAL_InitTick + 50
        0x08000f62:    2c10        .,      CMP      r4,#0x10
        0x08000f64:    d207        ..      BCS      0x8000f76 ; HAL_InitTick + 50
        0x08000f66:    2200        ."      MOVS     r2,#0
        0x08000f68:    4621        !F      MOV      r1,r4
        0x08000f6a:    1e50        P.      SUBS     r0,r2,#1
        0x08000f6c:    f000f828    ..(.    BL       HAL_NVIC_SetPriority ; 0x8000fc0
        0x08000f70:    2000        .       MOVS     r0,#0
        0x08000f72:    606c        l`      STR      r4,[r5,#4]
        0x08000f74:    bd70        p.      POP      {r4-r6,pc}
        0x08000f76:    2001        .       MOVS     r0,#1
        0x08000f78:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x08000f7a:    0000        ..      DCW    0
        0x08000f7c:    2000000c    ...     DCD    536870924
        0x08000f80:    20000018    ...     DCD    536870936
    $t
    i.HAL_MspInit
    HAL_MspInit
        0x08000f84:    480c        .H      LDR      r0,[pc,#48] ; [0x8000fb8] = 0x40021000
        0x08000f86:    b508        ..      PUSH     {r3,lr}
        0x08000f88:    6981        .i      LDR      r1,[r0,#0x18]
        0x08000f8a:    f0410101    A...    ORR      r1,r1,#1
        0x08000f8e:    6181        .a      STR      r1,[r0,#0x18]
        0x08000f90:    6981        .i      LDR      r1,[r0,#0x18]
        0x08000f92:    f0010101    ....    AND      r1,r1,#1
        0x08000f96:    9100        ..      STR      r1,[sp,#0]
        0x08000f98:    69c1        .i      LDR      r1,[r0,#0x1c]
        0x08000f9a:    f0415180    A..Q    ORR      r1,r1,#0x10000000
        0x08000f9e:    61c1        .a      STR      r1,[r0,#0x1c]
        0x08000fa0:    69c0        .i      LDR      r0,[r0,#0x1c]
        0x08000fa2:    f0005080    ...P    AND      r0,r0,#0x10000000
        0x08000fa6:    9000        ..      STR      r0,[sp,#0]
        0x08000fa8:    4804        .H      LDR      r0,[pc,#16] ; [0x8000fbc] = 0x40010000
        0x08000faa:    6841        Ah      LDR      r1,[r0,#4]
        0x08000fac:    f02161e0    !..a    BIC      r1,r1,#0x7000000
        0x08000fb0:    f0417100    A..q    ORR      r1,r1,#0x2000000
        0x08000fb4:    6041        A`      STR      r1,[r0,#4]
        0x08000fb6:    bd08        ..      POP      {r3,pc}
    $d
        0x08000fb8:    40021000    ...@    DCD    1073876992
        0x08000fbc:    40010000    ...@    DCD    1073807360
    $t
    i.HAL_NVIC_SetPriority
    HAL_NVIC_SetPriority
        0x08000fc0:    b4f0        ..      PUSH     {r4-r7}
        0x08000fc2:    4b0e        .K      LDR      r3,[pc,#56] ; [0x8000ffc] = 0xe000ed0c
        0x08000fc4:    681b        .h      LDR      r3,[r3,#0]
        0x08000fc6:    460c        .F      MOV      r4,r1
        0x08000fc8:    f3c32302    ...#    UBFX     r3,r3,#8,#3
        0x08000fcc:    f1c30507    ....    RSB      r5,r3,#7
        0x08000fd0:    2d04        .-      CMP      r5,#4
        0x08000fd2:    d900        ..      BLS      0x8000fd6 ; HAL_NVIC_SetPriority + 22
        0x08000fd4:    2504        .%      MOVS     r5,#4
        0x08000fd6:    1d19        ..      ADDS     r1,r3,#4
        0x08000fd8:    2907        .)      CMP      r1,#7
        0x08000fda:    d201        ..      BCS      0x8000fe0 ; HAL_NVIC_SetPriority + 32
        0x08000fdc:    2300        .#      MOVS     r3,#0
        0x08000fde:    e000        ..      B        0x8000fe2 ; HAL_NVIC_SetPriority + 34
        0x08000fe0:    1edb        ..      SUBS     r3,r3,#3
        0x08000fe2:    2601        .&      MOVS     r6,#1
        0x08000fe4:    fa06f105    ....    LSL      r1,r6,r5
        0x08000fe8:    1e49        I.      SUBS     r1,r1,#1
        0x08000fea:    4021        !@      ANDS     r1,r1,r4
        0x08000fec:    4099        .@      LSLS     r1,r1,r3
        0x08000fee:    409e        .@      LSLS     r6,r6,r3
        0x08000ff0:    1e76        v.      SUBS     r6,r6,#1
        0x08000ff2:    4016        .@      ANDS     r6,r6,r2
        0x08000ff4:    4331        1C      ORRS     r1,r1,r6
        0x08000ff6:    bcf0        ..      POP      {r4-r7}
        0x08000ff8:    f000bba6    ....    B.W      __NVIC_SetPriority ; 0x8001748
    $d
        0x08000ffc:    e000ed0c    ....    DCD    3758157068
    $d.realdata
    .ARM.__at_0x08001000
    m_serialnumber
        0x08001000:    00000000    ....    DCD    0
    $t
    i.HAL_NVIC_SetPriorityGrouping
    HAL_NVIC_SetPriorityGrouping
        0x08001004:    4906        .I      LDR      r1,[pc,#24] ; [0x8001020] = 0xe000ed0c
        0x08001006:    f0000207    ....    AND      r2,r0,#7
        0x0800100a:    6808        .h      LDR      r0,[r1,#0]
        0x0800100c:    f64f03ff    O...    MOV      r3,#0xf8ff
        0x08001010:    4018        .@      ANDS     r0,r0,r3
        0x08001012:    ea402002    @..     ORR      r0,r0,r2,LSL #8
        0x08001016:    4a03        .J      LDR      r2,[pc,#12] ; [0x8001024] = 0x5fa0000
        0x08001018:    4310        .C      ORRS     r0,r0,r2
        0x0800101a:    6008        .`      STR      r0,[r1,#0]
        0x0800101c:    4770        pG      BX       lr
    $d
        0x0800101e:    0000        ..      DCW    0
        0x08001020:    e000ed0c    ....    DCD    3758157068
        0x08001024:    05fa0000    ....    DCD    100270080
    $t
    i.HardFault_Handler
    HardFault_Handler
        0x08001028:    e7fe        ..      B        HardFault_Handler ; 0x8001028
    i.MemManage_Handler
    MemManage_Handler
        0x0800102a:    e7fe        ..      B        MemManage_Handler ; 0x800102a
    i.NMI_Handler
    NMI_Handler
        0x0800102c:    e7fe        ..      B        NMI_Handler ; 0x800102c
    i.PendSV_Handler
    PendSV_Handler
        0x0800102e:    4770        pG      BX       lr
    i.SVC_Handler
    SVC_Handler
        0x08001030:    4770        pG      BX       lr
    i.SysTick_Handler
    SysTick_Handler
        0x08001032:    f7ffbf6d    ..m.    B.W      HAL_IncTick ; 0x8000f10
    i.SystemInit
    SystemInit
        0x08001036:    4770        pG      BX       lr
    i.UsageFault_Handler
    UsageFault_Handler
        0x08001038:    e7fe        ..      B        UsageFault_Handler ; 0x8001038
    i.advance_software_protect_anti_debugger_sample
    advance_software_protect_anti_debugger_sample
        0x0800103a:    4770        pG      BX       lr
    i.advance_software_protect_dynamic_muti_object_watcher_callback
    advance_software_protect_dynamic_muti_object_watcher_callback
        0x0800103c:    4770        pG      BX       lr
        0x0800103e:    0000        ..      MOVS     r0,r0
    i.HAL_RCC_ClockConfig
    HAL_RCC_ClockConfig
        0x08001040:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x08001044:    460f        .F      MOV      r7,r1
        0x08001046:    0005        ..      MOVS     r5,r0
        0x08001048:    d061        a.      BEQ      0x800110e ; HAL_RCC_ClockConfig + 206
        0x0800104a:    4e43        CN      LDR      r6,[pc,#268] ; [0x8001158] = 0x40022000
        0x0800104c:    6830        0h      LDR      r0,[r6,#0]
        0x0800104e:    f0000007    ....    AND      r0,r0,#7
        0x08001052:    42b8        .B      CMP      r0,r7
        0x08001054:    d209        ..      BCS      0x800106a ; HAL_RCC_ClockConfig + 42
        0x08001056:    6830        0h      LDR      r0,[r6,#0]
        0x08001058:    f0200007     ...    BIC      r0,r0,#7
        0x0800105c:    4338        8C      ORRS     r0,r0,r7
        0x0800105e:    6030        0`      STR      r0,[r6,#0]
        0x08001060:    6830        0h      LDR      r0,[r6,#0]
        0x08001062:    f0000007    ....    AND      r0,r0,#7
        0x08001066:    42b8        .B      CMP      r0,r7
        0x08001068:    d151        Q.      BNE      0x800110e ; HAL_RCC_ClockConfig + 206
        0x0800106a:    6828        (h      LDR      r0,[r5,#0]
        0x0800106c:    4c3b        ;L      LDR      r4,[pc,#236] ; [0x800115c] = 0x40021000
        0x0800106e:    0781        ..      LSLS     r1,r0,#30
        0x08001070:    d512        ..      BPL      0x8001098 ; HAL_RCC_ClockConfig + 88
        0x08001072:    0740        @.      LSLS     r0,r0,#29
        0x08001074:    d503        ..      BPL      0x800107e ; HAL_RCC_ClockConfig + 62
        0x08001076:    6860        `h      LDR      r0,[r4,#4]
        0x08001078:    f44060e0    @..`    ORR      r0,r0,#0x700
        0x0800107c:    6060        ``      STR      r0,[r4,#4]
        0x0800107e:    7828        (x      LDRB     r0,[r5,#0]
        0x08001080:    0700        ..      LSLS     r0,r0,#28
        0x08001082:    d503        ..      BPL      0x800108c ; HAL_RCC_ClockConfig + 76
        0x08001084:    6860        `h      LDR      r0,[r4,#4]
        0x08001086:    f4405060    @.`P    ORR      r0,r0,#0x3800
        0x0800108a:    6060        ``      STR      r0,[r4,#4]
        0x0800108c:    6860        `h      LDR      r0,[r4,#4]
        0x0800108e:    68a9        .h      LDR      r1,[r5,#8]
        0x08001090:    f02000f0     ...    BIC      r0,r0,#0xf0
        0x08001094:    4308        .C      ORRS     r0,r0,r1
        0x08001096:    6060        ``      STR      r0,[r4,#4]
        0x08001098:    7828        (x      LDRB     r0,[r5,#0]
        0x0800109a:    07c0        ..      LSLS     r0,r0,#31
        0x0800109c:    d028        (.      BEQ      0x80010f0 ; HAL_RCC_ClockConfig + 176
        0x0800109e:    6868        hh      LDR      r0,[r5,#4]
        0x080010a0:    2801        .(      CMP      r0,#1
        0x080010a2:    d010        ..      BEQ      0x80010c6 ; HAL_RCC_ClockConfig + 134
        0x080010a4:    6821        !h      LDR      r1,[r4,#0]
        0x080010a6:    2802        .(      CMP      r0,#2
        0x080010a8:    d010        ..      BEQ      0x80010cc ; HAL_RCC_ClockConfig + 140
        0x080010aa:    0789        ..      LSLS     r1,r1,#30
        0x080010ac:    2900        .)      CMP      r1,#0
        0x080010ae:    da2e        ..      BGE      0x800110e ; HAL_RCC_ClockConfig + 206
        0x080010b0:    6861        ah      LDR      r1,[r4,#4]
        0x080010b2:    f0210103    !...    BIC      r1,r1,#3
        0x080010b6:    4301        .C      ORRS     r1,r1,r0
        0x080010b8:    6061        a`      STR      r1,[r4,#4]
        0x080010ba:    f7ffff23    ..#.    BL       HAL_GetTick ; 0x8000f04
        0x080010be:    4680        .F      MOV      r8,r0
        0x080010c0:    f2413988    A..9    MOV      r9,#0x1388
        0x080010c4:    e00d        ..      B        0x80010e2 ; HAL_RCC_ClockConfig + 162
        0x080010c6:    6821        !h      LDR      r1,[r4,#0]
        0x080010c8:    0389        ..      LSLS     r1,r1,#14
        0x080010ca:    e7ef        ..      B        0x80010ac ; HAL_RCC_ClockConfig + 108
        0x080010cc:    0189        ..      LSLS     r1,r1,#6
        0x080010ce:    e7ed        ..      B        0x80010ac ; HAL_RCC_ClockConfig + 108
        0x080010d0:    f7ffff18    ....    BL       HAL_GetTick ; 0x8000f04
        0x080010d4:    eba00108    ....    SUB      r1,r0,r8
        0x080010d8:    4549        IE      CMP      r1,r9
        0x080010da:    d902        ..      BLS      0x80010e2 ; HAL_RCC_ClockConfig + 162
        0x080010dc:    2003        .       MOVS     r0,#3
        0x080010de:    e8bd87f0    ....    POP      {r4-r10,pc}
        0x080010e2:    6860        `h      LDR      r0,[r4,#4]
        0x080010e4:    6869        ih      LDR      r1,[r5,#4]
        0x080010e6:    f000000c    ....    AND      r0,r0,#0xc
