openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x080010ea:    ebb00f81    ....    CMP      r0,r1,LSL #2
        0x080010ee:    d1ef        ..      BNE      0x80010d0 ; HAL_RCC_ClockConfig + 144
        0x080010f0:    6830        0h      LDR      r0,[r6,#0]
        0x080010f2:    f0000007    ....    AND      r0,r0,#7
        0x080010f6:    42b8        .B      CMP      r0,r7
        0x080010f8:    d90b        ..      BLS      0x8001112 ; HAL_RCC_ClockConfig + 210
        0x080010fa:    6830        0h      LDR      r0,[r6,#0]
        0x080010fc:    f0200007     ...    BIC      r0,r0,#7
        0x08001100:    4338        8C      ORRS     r0,r0,r7
        0x08001102:    6030        0`      STR      r0,[r6,#0]
        0x08001104:    6830        0h      LDR      r0,[r6,#0]
        0x08001106:    f0000007    ....    AND      r0,r0,#7
        0x0800110a:    42b8        .B      CMP      r0,r7
        0x0800110c:    d001        ..      BEQ      0x8001112 ; HAL_RCC_ClockConfig + 210
        0x0800110e:    2001        .       MOVS     r0,#1
        0x08001110:    e7e5        ..      B        0x80010de ; HAL_RCC_ClockConfig + 158
        0x08001112:    7828        (x      LDRB     r0,[r5,#0]
        0x08001114:    0740        @.      LSLS     r0,r0,#29
        0x08001116:    d505        ..      BPL      0x8001124 ; HAL_RCC_ClockConfig + 228
        0x08001118:    6860        `h      LDR      r0,[r4,#4]
        0x0800111a:    68e9        .h      LDR      r1,[r5,#0xc]
        0x0800111c:    f42060e0     ..`    BIC      r0,r0,#0x700
        0x08001120:    4308        .C      ORRS     r0,r0,r1
        0x08001122:    6060        ``      STR      r0,[r4,#4]
        0x08001124:    7828        (x      LDRB     r0,[r5,#0]
        0x08001126:    0700        ..      LSLS     r0,r0,#28
        0x08001128:    d506        ..      BPL      0x8001138 ; HAL_RCC_ClockConfig + 248
        0x0800112a:    6860        `h      LDR      r0,[r4,#4]
        0x0800112c:    6929        )i      LDR      r1,[r5,#0x10]
        0x0800112e:    f4205060     .`P    BIC      r0,r0,#0x3800
        0x08001132:    ea4000c1    @...    ORR      r0,r0,r1,LSL #3
        0x08001136:    6060        ``      STR      r0,[r4,#4]
        0x08001138:    f000f838    ..8.    BL       HAL_RCC_GetSysClockFreq ; 0x80011ac
        0x0800113c:    6861        ah      LDR      r1,[r4,#4]
        0x0800113e:    4a08        .J      LDR      r2,[pc,#32] ; [0x8001160] = 0x8007564
        0x08001140:    f3c11103    ....    UBFX     r1,r1,#4,#4
        0x08001144:    5c51        Q\      LDRB     r1,[r2,r1]
        0x08001146:    40c8        .@      LSRS     r0,r0,r1
        0x08001148:    4906        .I      LDR      r1,[pc,#24] ; [0x8001164] = 0x20000018
        0x0800114a:    6008        .`      STR      r0,[r1,#0]
        0x0800114c:    4806        .H      LDR      r0,[pc,#24] ; [0x8001168] = 0x20000010
        0x0800114e:    6800        .h      LDR      r0,[r0,#0]
        0x08001150:    f7fffef8    ....    BL       HAL_InitTick ; 0x8000f44
        0x08001154:    2000        .       MOVS     r0,#0
        0x08001156:    e7c2        ..      B        0x80010de ; HAL_RCC_ClockConfig + 158
    $d
        0x08001158:    40022000    . .@    DCD    1073881088
        0x0800115c:    40021000    ...@    DCD    1073876992
        0x08001160:    08007564    du..    DCD    134247780
        0x08001164:    20000018    ...     DCD    536870936
        0x08001168:    20000010    ...     DCD    536870928
    $t
    i.HAL_RCC_GetPCLK1Freq
    HAL_RCC_GetPCLK1Freq
        0x0800116c:    4804        .H      LDR      r0,[pc,#16] ; [0x8001180] = 0x20000018
        0x0800116e:    4905        .I      LDR      r1,[pc,#20] ; [0x8001184] = 0x40021000
        0x08001170:    6800        .h      LDR      r0,[r0,#0]
        0x08001172:    6849        Ih      LDR      r1,[r1,#4]
        0x08001174:    4a04        .J      LDR      r2,[pc,#16] ; [0x8001188] = 0x8007574
        0x08001176:    f3c12102    ...!    UBFX     r1,r1,#8,#3
        0x0800117a:    5c51        Q\      LDRB     r1,[r2,r1]
        0x0800117c:    40c8        .@      LSRS     r0,r0,r1
        0x0800117e:    4770        pG      BX       lr
    $d
        0x08001180:    20000018    ...     DCD    536870936
        0x08001184:    40021000    ...@    DCD    1073876992
        0x08001188:    08007574    tu..    DCD    134247796
    $t
    i.HAL_RCC_GetPCLK2Freq
    HAL_RCC_GetPCLK2Freq
        0x0800118c:    4804        .H      LDR      r0,[pc,#16] ; [0x80011a0] = 0x20000018
        0x0800118e:    4905        .I      LDR      r1,[pc,#20] ; [0x80011a4] = 0x40021000
        0x08001190:    6800        .h      LDR      r0,[r0,#0]
        0x08001192:    6849        Ih      LDR      r1,[r1,#4]
        0x08001194:    4a04        .J      LDR      r2,[pc,#16] ; [0x80011a8] = 0x8007574
        0x08001196:    f3c121c2    ...!    UBFX     r1,r1,#11,#3
        0x0800119a:    5c51        Q\      LDRB     r1,[r2,r1]
        0x0800119c:    40c8        .@      LSRS     r0,r0,r1
        0x0800119e:    4770        pG      BX       lr
    $d
        0x080011a0:    20000018    ...     DCD    536870936
        0x080011a4:    40021000    ...@    DCD    1073876992
        0x080011a8:    08007574    tu..    DCD    134247796
    $t
    i.HAL_RCC_GetSysClockFreq
    HAL_RCC_GetSysClockFreq
        0x080011ac:    a112        ..      ADR      r1,{pc}+0x4c ; 0x80011f8
        0x080011ae:    b085        ..      SUB      sp,sp,#0x14
        0x080011b0:    c90f        ..      LDM      r1,{r0-r3}
        0x080011b2:    e88d000f    ....    STM      sp,{r0-r3}
        0x080011b6:    a014        ..      ADR      r0,{pc}+0x52 ; 0x8001208
        0x080011b8:    4a14        .J      LDR      r2,[pc,#80] ; [0x800120c] = 0x40021000
        0x080011ba:    6800        .h      LDR      r0,[r0,#0]
        0x080011bc:    9004        ..      STR      r0,[sp,#0x10]
        0x080011be:    6851        Qh      LDR      r1,[r2,#4]
        0x080011c0:    4813        .H      LDR      r0,[pc,#76] ; [0x8001210] = 0x7a1200
        0x080011c2:    f001030c    ....    AND      r3,r1,#0xc
        0x080011c6:    2b04        .+      CMP      r3,#4
        0x080011c8:    d010        ..      BEQ      0x80011ec ; HAL_RCC_GetSysClockFreq + 64
        0x080011ca:    2b08        .+      CMP      r3,#8
        0x080011cc:    d10e        ..      BNE      0x80011ec ; HAL_RCC_GetSysClockFreq + 64
        0x080011ce:    f3c14383    ...C    UBFX     r3,r1,#18,#4
        0x080011d2:    03c9        ..      LSLS     r1,r1,#15
        0x080011d4:    f81d0003    ....    LDRB     r0,[sp,r3]
        0x080011d8:    d50a        ..      BPL      0x80011f0 ; HAL_RCC_GetSysClockFreq + 68
        0x080011da:    6851        Qh      LDR      r1,[r2,#4]
        0x080011dc:    aa04        ..      ADD      r2,sp,#0x10
        0x080011de:    f3c14140    ..@A    UBFX     r1,r1,#17,#1
        0x080011e2:    5c51        Q\      LDRB     r1,[r2,r1]
        0x080011e4:    4a0a        .J      LDR      r2,[pc,#40] ; [0x8001210] = 0x7a1200
        0x080011e6:    4350        PC      MULS     r0,r2,r0
        0x080011e8:    fbb0f0f1    ....    UDIV     r0,r0,r1
        0x080011ec:    b005        ..      ADD      sp,sp,#0x14
        0x080011ee:    4770        pG      BX       lr
        0x080011f0:    4908        .I      LDR      r1,[pc,#32] ; [0x8001214] = 0x3d0900
        0x080011f2:    4348        HC      MULS     r0,r1,r0
        0x080011f4:    e7fa        ..      B        0x80011ec ; HAL_RCC_GetSysClockFreq + 64
    $d
        0x080011f6:    0000        ..      DCW    0
        0x080011f8:    05040302    ....    DCD    84148994
        0x080011fc:    09080706    ....    DCD    151521030
        0x08001200:    0d0c0b0a    ....    DCD    218893066
        0x08001204:    10100f0e    ....    DCD    269487886
        0x08001208:    00000201    ....    DCD    513
        0x0800120c:    40021000    ...@    DCD    1073876992
        0x08001210:    007a1200    ..z.    DCD    8000000
        0x08001214:    003d0900    ..=.    DCD    4000000
    $t
    i.HAL_RCC_OscConfig
    HAL_RCC_OscConfig
        0x08001218:    e92d4ff8    -..O    PUSH     {r3-r11,lr}
        0x0800121c:    0004        ..      MOVS     r4,r0
        0x0800121e:    d070        p.      BEQ      0x8001302 ; HAL_RCC_OscConfig + 234
        0x08001220:    7820         x      LDRB     r0,[r4,#0]
        0x08001222:    4dc0        .M      LDR      r5,[pc,#768] ; [0x8001524] = 0x40021000
        0x08001224:    07c0        ..      LSLS     r0,r0,#31
        0x08001226:    d049        I.      BEQ      0x80012bc ; HAL_RCC_OscConfig + 164
        0x08001228:    6868        hh      LDR      r0,[r5,#4]
        0x0800122a:    f3c00081    ....    UBFX     r0,r0,#2,#2
        0x0800122e:    2801        .(      CMP      r0,#1
        0x08001230:    d007        ..      BEQ      0x8001242 ; HAL_RCC_OscConfig + 42
        0x08001232:    6868        hh      LDR      r0,[r5,#4]
        0x08001234:    f3c00081    ....    UBFX     r0,r0,#2,#2
        0x08001238:    2802        .(      CMP      r0,#2
        0x0800123a:    d109        ..      BNE      0x8001250 ; HAL_RCC_OscConfig + 56
        0x0800123c:    6868        hh      LDR      r0,[r5,#4]
        0x0800123e:    03c0        ..      LSLS     r0,r0,#15
        0x08001240:    d506        ..      BPL      0x8001250 ; HAL_RCC_OscConfig + 56
        0x08001242:    6828        (h      LDR      r0,[r5,#0]
        0x08001244:    0380        ..      LSLS     r0,r0,#14
        0x08001246:    d539        9.      BPL      0x80012bc ; HAL_RCC_OscConfig + 164
        0x08001248:    6860        `h      LDR      r0,[r4,#4]
        0x0800124a:    2800        .(      CMP      r0,#0
        0x0800124c:    d0e7        ..      BEQ      0x800121e ; HAL_RCC_OscConfig + 6
        0x0800124e:    e035        5.      B        0x80012bc ; HAL_RCC_OscConfig + 164
        0x08001250:    6860        `h      LDR      r0,[r4,#4]
        0x08001252:    f5b03f80    ...?    CMP      r0,#0x10000
        0x08001256:    d00b        ..      BEQ      0x8001270 ; HAL_RCC_OscConfig + 88
        0x08001258:    b110        ..      CBZ      r0,0x8001260 ; HAL_RCC_OscConfig + 72
        0x0800125a:    f5b02fa0    .../    CMP      r0,#0x50000
        0x0800125e:    d011        ..      BEQ      0x8001284 ; HAL_RCC_OscConfig + 108
        0x08001260:    6828        (h      LDR      r0,[r5,#0]
        0x08001262:    f4203080     ..0    BIC      r0,r0,#0x10000
        0x08001266:    6028        (`      STR      r0,[r5,#0]
        0x08001268:    6828        (h      LDR      r0,[r5,#0]
        0x0800126a:    f4202080     ..     BIC      r0,r0,#0x40000
        0x0800126e:    e002        ..      B        0x8001276 ; HAL_RCC_OscConfig + 94
        0x08001270:    6828        (h      LDR      r0,[r5,#0]
        0x08001272:    f4403080    @..0    ORR      r0,r0,#0x10000
        0x08001276:    6028        (`      STR      r0,[r5,#0]
        0x08001278:    6860        `h      LDR      r0,[r4,#4]
        0x0800127a:    b190        ..      CBZ      r0,0x80012a2 ; HAL_RCC_OscConfig + 138
        0x0800127c:    f7fffe42    ..B.    BL       HAL_GetTick ; 0x8000f04
        0x08001280:    4606        .F      MOV      r6,r0
        0x08001282:    e00a        ..      B        0x800129a ; HAL_RCC_OscConfig + 130
        0x08001284:    6828        (h      LDR      r0,[r5,#0]
        0x08001286:    f4402080    @..     ORR      r0,r0,#0x40000
        0x0800128a:    6028        (`      STR      r0,[r5,#0]
        0x0800128c:    e7f0        ..      B        0x8001270 ; HAL_RCC_OscConfig + 88
        0x0800128e:    bf00        ..      NOP      
        0x08001290:    f7fffe38    ..8.    BL       HAL_GetTick ; 0x8000f04
        0x08001294:    1b80        ..      SUBS     r0,r0,r6
        0x08001296:    2864        d(      CMP      r0,#0x64
        0x08001298:    d873        s.      BHI      0x8001382 ; HAL_RCC_OscConfig + 362
        0x0800129a:    6828        (h      LDR      r0,[r5,#0]
        0x0800129c:    0380        ..      LSLS     r0,r0,#14
        0x0800129e:    d5f7        ..      BPL      0x8001290 ; HAL_RCC_OscConfig + 120
        0x080012a0:    e00c        ..      B        0x80012bc ; HAL_RCC_OscConfig + 164
        0x080012a2:    f7fffe2f    ../.    BL       HAL_GetTick ; 0x8000f04
        0x080012a6:    4606        .F      MOV      r6,r0
        0x080012a8:    e005        ..      B        0x80012b6 ; HAL_RCC_OscConfig + 158
        0x080012aa:    bf00        ..      NOP      
        0x080012ac:    f7fffe2a    ..*.    BL       HAL_GetTick ; 0x8000f04
        0x080012b0:    1b80        ..      SUBS     r0,r0,r6
        0x080012b2:    2864        d(      CMP      r0,#0x64
        0x080012b4:    d8f0        ..      BHI      0x8001298 ; HAL_RCC_OscConfig + 128
        0x080012b6:    6828        (h      LDR      r0,[r5,#0]
        0x080012b8:    0380        ..      LSLS     r0,r0,#14
        0x080012ba:    d4f7        ..      BMI      0x80012ac ; HAL_RCC_OscConfig + 148
        0x080012bc:    7820         x      LDRB     r0,[r4,#0]
        0x080012be:    4e9a        .N      LDR      r6,[pc,#616] ; [0x8001528] = 0x42420000
        0x080012c0:    0780        ..      LSLS     r0,r0,#30
        0x080012c2:    f04f0901    O...    MOV      r9,#1
        0x080012c6:    f04f0800    O...    MOV      r8,#0
        0x080012ca:    d539        9.      BPL      0x8001340 ; HAL_RCC_OscConfig + 296
        0x080012cc:    6868        hh      LDR      r0,[r5,#4]
        0x080012ce:    f0100f0c    ....    TST      r0,#0xc
        0x080012d2:    d007        ..      BEQ      0x80012e4 ; HAL_RCC_OscConfig + 204
        0x080012d4:    6868        hh      LDR      r0,[r5,#4]
        0x080012d6:    f3c00081    ....    UBFX     r0,r0,#2,#2
        0x080012da:    2802        .(      CMP      r0,#2
        0x080012dc:    d109        ..      BNE      0x80012f2 ; HAL_RCC_OscConfig + 218
        0x080012de:    6868        hh      LDR      r0,[r5,#4]
        0x080012e0:    03c0        ..      LSLS     r0,r0,#15
        0x080012e2:    d406        ..      BMI      0x80012f2 ; HAL_RCC_OscConfig + 218
        0x080012e4:    6828        (h      LDR      r0,[r5,#0]
        0x080012e6:    0780        ..      LSLS     r0,r0,#30
        0x080012e8:    d514        ..      BPL      0x8001314 ; HAL_RCC_OscConfig + 252
        0x080012ea:    6920         i      LDR      r0,[r4,#0x10]
        0x080012ec:    2801        .(      CMP      r0,#1
        0x080012ee:    d108        ..      BNE      0x8001302 ; HAL_RCC_OscConfig + 234
        0x080012f0:    e010        ..      B        0x8001314 ; HAL_RCC_OscConfig + 252
        0x080012f2:    6920         i      LDR      r0,[r4,#0x10]
        0x080012f4:    b1b0        ..      CBZ      r0,0x8001324 ; HAL_RCC_OscConfig + 268
        0x080012f6:    f8c69000    ....    STR      r9,[r6,#0]
        0x080012fa:    f7fffe03    ....    BL       HAL_GetTick ; 0x8000f04
        0x080012fe:    4607        .F      MOV      r7,r0
        0x08001300:    e005        ..      B        0x800130e ; HAL_RCC_OscConfig + 246
        0x08001302:    e10a        ..      B        0x800151a ; HAL_RCC_OscConfig + 770
        0x08001304:    f7fffdfe    ....    BL       HAL_GetTick ; 0x8000f04
        0x08001308:    1bc0        ..      SUBS     r0,r0,r7
        0x0800130a:    2802        .(      CMP      r0,#2
        0x0800130c:    d8c4        ..      BHI      0x8001298 ; HAL_RCC_OscConfig + 128
        0x0800130e:    6828        (h      LDR      r0,[r5,#0]
        0x08001310:    0780        ..      LSLS     r0,r0,#30
        0x08001312:    d5f7        ..      BPL      0x8001304 ; HAL_RCC_OscConfig + 236
        0x08001314:    6828        (h      LDR      r0,[r5,#0]
        0x08001316:    6961        ai      LDR      r1,[r4,#0x14]
        0x08001318:    f02000f8     ...    BIC      r0,r0,#0xf8
        0x0800131c:    ea4000c1    @...    ORR      r0,r0,r1,LSL #3
        0x08001320:    6028        (`      STR      r0,[r5,#0]
        0x08001322:    e00d        ..      B        0x8001340 ; HAL_RCC_OscConfig + 296
        0x08001324:    f8c68000    ....    STR      r8,[r6,#0]
        0x08001328:    f7fffdec    ....    BL       HAL_GetTick ; 0x8000f04
        0x0800132c:    4607        .F      MOV      r7,r0
        0x0800132e:    e004        ..      B        0x800133a ; HAL_RCC_OscConfig + 290
        0x08001330:    f7fffde8    ....    BL       HAL_GetTick ; 0x8000f04
        0x08001334:    1bc0        ..      SUBS     r0,r0,r7
        0x08001336:    2802        .(      CMP      r0,#2
        0x08001338:    d823        #.      BHI      0x8001382 ; HAL_RCC_OscConfig + 362
        0x0800133a:    6828        (h      LDR      r0,[r5,#0]
        0x0800133c:    0780        ..      LSLS     r0,r0,#30
        0x0800133e:    d4f7        ..      BMI      0x8001330 ; HAL_RCC_OscConfig + 280
        0x08001340:    7820         x      LDRB     r0,[r4,#0]
        0x08001342:    0700        ..      LSLS     r0,r0,#28
        0x08001344:    d52c        ,.      BPL      0x80013a0 ; HAL_RCC_OscConfig + 392
        0x08001346:    4879        yH      LDR      r0,[pc,#484] ; [0x800152c] = 0x42420480
        0x08001348:    69a1        .i      LDR      r1,[r4,#0x18]
        0x0800134a:    b1d9        ..      CBZ      r1,0x8001384 ; HAL_RCC_OscConfig + 364
        0x0800134c:    f8c09000    ....    STR      r9,[r0,#0]
        0x08001350:    f7fffdd8    ....    BL       HAL_GetTick ; 0x8000f04
        0x08001354:    4607        .F      MOV      r7,r0
        0x08001356:    e004        ..      B        0x8001362 ; HAL_RCC_OscConfig + 330
        0x08001358:    f7fffdd4    ....    BL       HAL_GetTick ; 0x8000f04
        0x0800135c:    1bc0        ..      SUBS     r0,r0,r7
        0x0800135e:    2802        .(      CMP      r0,#2
        0x08001360:    d80f        ..      BHI      0x8001382 ; HAL_RCC_OscConfig + 362
        0x08001362:    6a68        hj      LDR      r0,[r5,#0x24]
        0x08001364:    0780        ..      LSLS     r0,r0,#30
        0x08001366:    d5f7        ..      BPL      0x8001358 ; HAL_RCC_OscConfig + 320
        0x08001368:    4871        qH      LDR      r0,[pc,#452] ; [0x8001530] = 0x20000018
        0x0800136a:    f44f51fa    O..Q    MOV      r1,#0x1f40
        0x0800136e:    6800        .h      LDR      r0,[r0,#0]
        0x08001370:    fbb0f0f1    ....    UDIV     r0,r0,r1
        0x08001374:    9000        ..      STR      r0,[sp,#0]
        0x08001376:    bf00        ..      NOP      
        0x08001378:    9800        ..      LDR      r0,[sp,#0]
        0x0800137a:    1e41        A.      SUBS     r1,r0,#1
        0x0800137c:    9100        ..      STR      r1,[sp,#0]
        0x0800137e:    d2fa        ..      BCS      0x8001376 ; HAL_RCC_OscConfig + 350
        0x08001380:    e00e        ..      B        0x80013a0 ; HAL_RCC_OscConfig + 392
        0x08001382:    e080        ..      B        0x8001486 ; HAL_RCC_OscConfig + 622
        0x08001384:    f8c08000    ....    STR      r8,[r0,#0]
        0x08001388:    f7fffdbc    ....    BL       HAL_GetTick ; 0x8000f04
        0x0800138c:    4607        .F      MOV      r7,r0
        0x0800138e:    e004        ..      B        0x800139a ; HAL_RCC_OscConfig + 386
        0x08001390:    f7fffdb8    ....    BL       HAL_GetTick ; 0x8000f04
        0x08001394:    1bc0        ..      SUBS     r0,r0,r7
        0x08001396:    2802        .(      CMP      r0,#2
        0x08001398:    d875        u.      BHI      0x8001486 ; HAL_RCC_OscConfig + 622
        0x0800139a:    6a68        hj      LDR      r0,[r5,#0x24]
        0x0800139c:    0780        ..      LSLS     r0,r0,#30
        0x0800139e:    d4f7        ..      BMI      0x8001390 ; HAL_RCC_OscConfig + 376
        0x080013a0:    7820         x      LDRB     r0,[r4,#0]
        0x080013a2:    0740        @.      LSLS     r0,r0,#29
        0x080013a4:    d560        `.      BPL      0x8001468 ; HAL_RCC_OscConfig + 592
        0x080013a6:    69e8        .i      LDR      r0,[r5,#0x1c]
        0x080013a8:    2700        .'      MOVS     r7,#0
        0x080013aa:    00c0        ..      LSLS     r0,r0,#3
        0x080013ac:    d408        ..      BMI      0x80013c0 ; HAL_RCC_OscConfig + 424
        0x080013ae:    69e8        .i      LDR      r0,[r5,#0x1c]
        0x080013b0:    f0405080    @..P    ORR      r0,r0,#0x10000000
        0x080013b4:    61e8        .a      STR      r0,[r5,#0x1c]
        0x080013b6:    69e8        .i      LDR      r0,[r5,#0x1c]
        0x080013b8:    2701        .'      MOVS     r7,#1
        0x080013ba:    f0005080    ...P    AND      r0,r0,#0x10000000
        0x080013be:    9000        ..      STR      r0,[sp,#0]
        0x080013c0:    485c        \H      LDR      r0,[pc,#368] ; [0x8001534] = 0x40007000
        0x080013c2:    6801        .h      LDR      r1,[r0,#0]
        0x080013c4:    05c9        ..      LSLS     r1,r1,#23
        0x080013c6:    d413        ..      BMI      0x80013f0 ; HAL_RCC_OscConfig + 472
        0x080013c8:    6801        .h      LDR      r1,[r0,#0]
        0x080013ca:    4683        .F      MOV      r11,r0
        0x080013cc:    f4417180    A..q    ORR      r1,r1,#0x100
        0x080013d0:    6001        .`      STR      r1,[r0,#0]
        0x080013d2:    f7fffd97    ....    BL       HAL_GetTick ; 0x8000f04
        0x080013d6:    4682        .F      MOV      r10,r0
        0x080013d8:    e006        ..      B        0x80013e8 ; HAL_RCC_OscConfig + 464
        0x080013da:    bf00        ..      NOP      
        0x080013dc:    f7fffd92    ....    BL       HAL_GetTick ; 0x8000f04
        0x080013e0:    eba0000a    ....    SUB      r0,r0,r10
        0x080013e4:    2864        d(      CMP      r0,#0x64
        0x080013e6:    d84e        N.      BHI      0x8001486 ; HAL_RCC_OscConfig + 622
        0x080013e8:    f8db0000    ....    LDR      r0,[r11,#0]
        0x080013ec:    05c0        ..      LSLS     r0,r0,#23
        0x080013ee:    d5f5        ..      BPL      0x80013dc ; HAL_RCC_OscConfig + 452
        0x080013f0:    68e0        .h      LDR      r0,[r4,#0xc]
        0x080013f2:    2801        .(      CMP      r0,#1
        0x080013f4:    d00a        ..      BEQ      0x800140c ; HAL_RCC_OscConfig + 500
        0x080013f6:    b108        ..      CBZ      r0,0x80013fc ; HAL_RCC_OscConfig + 484
        0x080013f8:    2805        .(      CMP      r0,#5
        0x080013fa:    d013        ..      BEQ      0x8001424 ; HAL_RCC_OscConfig + 524
        0x080013fc:    6a28        (j      LDR      r0,[r5,#0x20]
        0x080013fe:    f0200001     ...    BIC      r0,r0,#1
        0x08001402:    6228        (b      STR      r0,[r5,#0x20]
        0x08001404:    6a28        (j      LDR      r0,[r5,#0x20]
        0x08001406:    f0200004     ...    BIC      r0,r0,#4
        0x0800140a:    e002        ..      B        0x8001412 ; HAL_RCC_OscConfig + 506
        0x0800140c:    6a28        (j      LDR      r0,[r5,#0x20]
        0x0800140e:    f0400001    @...    ORR      r0,r0,#1
        0x08001412:    6228        (b      STR      r0,[r5,#0x20]
        0x08001414:    68e0        .h      LDR      r0,[r4,#0xc]
        0x08001416:    f2413b88    A..;    MOV      r11,#0x1388
        0x0800141a:    b198        ..      CBZ      r0,0x8001444 ; HAL_RCC_OscConfig + 556
        0x0800141c:    f7fffd72    ..r.    BL       HAL_GetTick ; 0x8000f04
        0x08001420:    4682        .F      MOV      r10,r0
        0x08001422:    e00b        ..      B        0x800143c ; HAL_RCC_OscConfig + 548
        0x08001424:    6a28        (j      LDR      r0,[r5,#0x20]
        0x08001426:    f0400004    @...    ORR      r0,r0,#4
