openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x0800142a:    6228        (b      STR      r0,[r5,#0x20]
        0x0800142c:    e7ee        ..      B        0x800140c ; HAL_RCC_OscConfig + 500
        0x0800142e:    bf00        ..      NOP      
        0x08001430:    f7fffd68    ..h.    BL       HAL_GetTick ; 0x8000f04
        0x08001434:    eba0010a    ....    SUB      r1,r0,r10
        0x08001438:    4559        YE      CMP      r1,r11
        0x0800143a:    d85a        Z.      BHI      0x80014f2 ; HAL_RCC_OscConfig + 730
        0x0800143c:    6a28        (j      LDR      r0,[r5,#0x20]
        0x0800143e:    0780        ..      LSLS     r0,r0,#30
        0x08001440:    d5f6        ..      BPL      0x8001430 ; HAL_RCC_OscConfig + 536
        0x08001442:    e00c        ..      B        0x800145e ; HAL_RCC_OscConfig + 582
        0x08001444:    f7fffd5e    ..^.    BL       HAL_GetTick ; 0x8000f04
        0x08001448:    4682        .F      MOV      r10,r0
        0x0800144a:    e005        ..      B        0x8001458 ; HAL_RCC_OscConfig + 576
        0x0800144c:    f7fffd5a    ..Z.    BL       HAL_GetTick ; 0x8000f04
        0x08001450:    eba0010a    ....    SUB      r1,r0,r10
        0x08001454:    4559        YE      CMP      r1,r11
        0x08001456:    d84c        L.      BHI      0x80014f2 ; HAL_RCC_OscConfig + 730
        0x08001458:    6a28        (j      LDR      r0,[r5,#0x20]
        0x0800145a:    0780        ..      LSLS     r0,r0,#30
        0x0800145c:    d4f6        ..      BMI      0x800144c ; HAL_RCC_OscConfig + 564
        0x0800145e:    b11f        ..      CBZ      r7,0x8001468 ; HAL_RCC_OscConfig + 592
        0x08001460:    69e8        .i      LDR      r0,[r5,#0x1c]
        0x08001462:    f0205080     ..P    BIC      r0,r0,#0x10000000
        0x08001466:    61e8        .a      STR      r0,[r5,#0x1c]
        0x08001468:    69e0        .i      LDR      r0,[r4,#0x1c]
        0x0800146a:    b388        ..      CBZ      r0,0x80014d0 ; HAL_RCC_OscConfig + 696
        0x0800146c:    6869        ih      LDR      r1,[r5,#4]
        0x0800146e:    f3c10181    ....    UBFX     r1,r1,#2,#2
        0x08001472:    2902        .)      CMP      r1,#2
        0x08001474:    d044        D.      BEQ      0x8001500 ; HAL_RCC_OscConfig + 744
        0x08001476:    2802        .(      CMP      r0,#2
        0x08001478:    f8c68060    ..`.    STR      r8,[r6,#0x60]
        0x0800147c:    d004        ..      BEQ      0x8001488 ; HAL_RCC_OscConfig + 624
        0x0800147e:    f7fffd41    ..A.    BL       HAL_GetTick ; 0x8000f04
        0x08001482:    4604        .F      MOV      r4,r0
        0x08001484:    e038        8.      B        0x80014f8 ; HAL_RCC_OscConfig + 736
        0x08001486:    e034        4.      B        0x80014f2 ; HAL_RCC_OscConfig + 730
        0x08001488:    f7fffd3c    ..<.    BL       HAL_GetTick ; 0x8000f04
        0x0800148c:    4607        .F      MOV      r7,r0
        0x0800148e:    e004        ..      B        0x800149a ; HAL_RCC_OscConfig + 642
        0x08001490:    f7fffd38    ..8.    BL       HAL_GetTick ; 0x8000f04
        0x08001494:    1bc0        ..      SUBS     r0,r0,r7
        0x08001496:    2802        .(      CMP      r0,#2
        0x08001498:    d82b        +.      BHI      0x80014f2 ; HAL_RCC_OscConfig + 730
        0x0800149a:    6828        (h      LDR      r0,[r5,#0]
        0x0800149c:    0180        ..      LSLS     r0,r0,#6
        0x0800149e:    d4f7        ..      BMI      0x8001490 ; HAL_RCC_OscConfig + 632
        0x080014a0:    6a20         j      LDR      r0,[r4,#0x20]
        0x080014a2:    f5b03f80    ...?    CMP      r0,#0x10000
        0x080014a6:    d105        ..      BNE      0x80014b4 ; HAL_RCC_OscConfig + 668
        0x080014a8:    6868        hh      LDR      r0,[r5,#4]
        0x080014aa:    68a1        .h      LDR      r1,[r4,#8]
        0x080014ac:    f4203000     ..0    BIC      r0,r0,#0x20000
        0x080014b0:    4308        .C      ORRS     r0,r0,r1
        0x080014b2:    6068        h`      STR      r0,[r5,#4]
        0x080014b4:    e9d40108    ....    LDRD     r0,r1,[r4,#0x20]
        0x080014b8:    4308        .C      ORRS     r0,r0,r1
        0x080014ba:    6869        ih      LDR      r1,[r5,#4]
        0x080014bc:    f4211174    !.t.    BIC      r1,r1,#0x3d0000
        0x080014c0:    4308        .C      ORRS     r0,r0,r1
        0x080014c2:    6068        h`      STR      r0,[r5,#4]
        0x080014c4:    f8c69060    ..`.    STR      r9,[r6,#0x60]
        0x080014c8:    f7fffd1c    ....    BL       HAL_GetTick ; 0x8000f04
        0x080014cc:    4604        .F      MOV      r4,r0
        0x080014ce:    e006        ..      B        0x80014de ; HAL_RCC_OscConfig + 710
        0x080014d0:    e025        %.      B        0x800151e ; HAL_RCC_OscConfig + 774
        0x080014d2:    bf00        ..      NOP      
        0x080014d4:    f7fffd16    ....    BL       HAL_GetTick ; 0x8000f04
        0x080014d8:    1b00        ..      SUBS     r0,r0,r4
        0x080014da:    2802        .(      CMP      r0,#2
        0x080014dc:    d809        ..      BHI      0x80014f2 ; HAL_RCC_OscConfig + 730
        0x080014de:    6828        (h      LDR      r0,[r5,#0]
        0x080014e0:    0180        ..      LSLS     r0,r0,#6
        0x080014e2:    d5f7        ..      BPL      0x80014d4 ; HAL_RCC_OscConfig + 700
        0x080014e4:    e01b        ..      B        0x800151e ; HAL_RCC_OscConfig + 774
        0x080014e6:    bf00        ..      NOP      
        0x080014e8:    f7fffd0c    ....    BL       HAL_GetTick ; 0x8000f04
        0x080014ec:    1b00        ..      SUBS     r0,r0,r4
        0x080014ee:    2802        .(      CMP      r0,#2
        0x080014f0:    d902        ..      BLS      0x80014f8 ; HAL_RCC_OscConfig + 736
        0x080014f2:    2003        .       MOVS     r0,#3
        0x080014f4:    e8bd8ff8    ....    POP      {r3-r11,pc}
        0x080014f8:    6828        (h      LDR      r0,[r5,#0]
        0x080014fa:    0180        ..      LSLS     r0,r0,#6
        0x080014fc:    d4f4        ..      BMI      0x80014e8 ; HAL_RCC_OscConfig + 720
        0x080014fe:    e00e        ..      B        0x800151e ; HAL_RCC_OscConfig + 774
        0x08001500:    2801        .(      CMP      r0,#1
        0x08001502:    d0f7        ..      BEQ      0x80014f4 ; HAL_RCC_OscConfig + 732
        0x08001504:    6868        hh      LDR      r0,[r5,#4]
        0x08001506:    6a22        "j      LDR      r2,[r4,#0x20]
        0x08001508:    f4003180    ...1    AND      r1,r0,#0x10000
        0x0800150c:    4291        .B      CMP      r1,r2
        0x0800150e:    d104        ..      BNE      0x800151a ; HAL_RCC_OscConfig + 770
        0x08001510:    6a61        aj      LDR      r1,[r4,#0x24]
        0x08001512:    f4001070    ..p.    AND      r0,r0,#0x3c0000
        0x08001516:    4288        .B      CMP      r0,r1
        0x08001518:    d001        ..      BEQ      0x800151e ; HAL_RCC_OscConfig + 774
        0x0800151a:    2001        .       MOVS     r0,#1
        0x0800151c:    e7ea        ..      B        0x80014f4 ; HAL_RCC_OscConfig + 732
        0x0800151e:    2000        .       MOVS     r0,#0
        0x08001520:    e7e8        ..      B        0x80014f4 ; HAL_RCC_OscConfig + 732
    $d
        0x08001522:    0000        ..      DCW    0
        0x08001524:    40021000    ...@    DCD    1073876992
        0x08001528:    42420000    ..BB    DCD    1111621632
        0x0800152c:    42420480    ..BB    DCD    1111622784
        0x08001530:    20000018    ...     DCD    536870936
        0x08001534:    40007000    .p.@    DCD    1073770496
    $t
    i.HAL_SYSTICK_Config
    HAL_SYSTICK_Config
        0x08001538:    b510        ..      PUSH     {r4,lr}
        0x0800153a:    1e40        @.      SUBS     r0,r0,#1
        0x0800153c:    f1b07f80    ....    CMP      r0,#0x1000000
        0x08001540:    d301        ..      BCC      0x8001546 ; HAL_SYSTICK_Config + 14
        0x08001542:    2001        .       MOVS     r0,#1
        0x08001544:    bd10        ..      POP      {r4,pc}
        0x08001546:    f04f24e0    O..$    MOV      r4,#0xe000e000
        0x0800154a:    6160        `a      STR      r0,[r4,#0x14]
        0x0800154c:    210f        .!      MOVS     r1,#0xf
        0x0800154e:    1760        `.      ASRS     r0,r4,#29
        0x08001550:    f000f8fa    ....    BL       __NVIC_SetPriority ; 0x8001748
        0x08001554:    2000        .       MOVS     r0,#0
        0x08001556:    61a0        .a      STR      r0,[r4,#0x18]
        0x08001558:    2007        .       MOVS     r0,#7
        0x0800155a:    6120         a      STR      r0,[r4,#0x10]
        0x0800155c:    2000        .       MOVS     r0,#0
        0x0800155e:    bd10        ..      POP      {r4,pc}
    i.HAL_UART_Init
    HAL_UART_Init
        0x08001560:    b570        p.      PUSH     {r4-r6,lr}
        0x08001562:    0004        ..      MOVS     r4,r0
        0x08001564:    d004        ..      BEQ      0x8001570 ; HAL_UART_Init + 16
        0x08001566:    f894003d    ..=.    LDRB     r0,[r4,#0x3d]
        0x0800156a:    2500        .%      MOVS     r5,#0
        0x0800156c:    b110        ..      CBZ      r0,0x8001574 ; HAL_UART_Init + 20
        0x0800156e:    e006        ..      B        0x800157e ; HAL_UART_Init + 30
        0x08001570:    2001        .       MOVS     r0,#1
        0x08001572:    bd70        p.      POP      {r4-r6,pc}
        0x08001574:    f884503c    ..<P    STRB     r5,[r4,#0x3c]
        0x08001578:    4620         F      MOV      r0,r4
        0x0800157a:    f000f823    ..#.    BL       HAL_UART_MspInit ; 0x80015c4
        0x0800157e:    2024        $       MOVS     r0,#0x24
        0x08001580:    f884003d    ..=.    STRB     r0,[r4,#0x3d]
        0x08001584:    6820         h      LDR      r0,[r4,#0]
        0x08001586:    68c1        .h      LDR      r1,[r0,#0xc]
        0x08001588:    f4215100    !..Q    BIC      r1,r1,#0x2000
        0x0800158c:    60c1        .`      STR      r1,[r0,#0xc]
        0x0800158e:    4620         F      MOV      r0,r4
        0x08001590:    f000f87e    ..~.    BL       UART_SetConfig ; 0x8001690
        0x08001594:    6820         h      LDR      r0,[r4,#0]
        0x08001596:    6901        .i      LDR      r1,[r0,#0x10]
        0x08001598:    f4214190    !..A    BIC      r1,r1,#0x4800
        0x0800159c:    6101        .a      STR      r1,[r0,#0x10]
        0x0800159e:    6820         h      LDR      r0,[r4,#0]
        0x080015a0:    6941        Ai      LDR      r1,[r0,#0x14]
        0x080015a2:    f021012a    !.*.    BIC      r1,r1,#0x2a
        0x080015a6:    6141        Aa      STR      r1,[r0,#0x14]
        0x080015a8:    6820         h      LDR      r0,[r4,#0]
        0x080015aa:    68c1        .h      LDR      r1,[r0,#0xc]
        0x080015ac:    f4415100    A..Q    ORR      r1,r1,#0x2000
        0x080015b0:    60c1        .`      STR      r1,[r0,#0xc]
        0x080015b2:    6425        %d      STR      r5,[r4,#0x40]
        0x080015b4:    2020                MOVS     r0,#0x20
        0x080015b6:    f884003d    ..=.    STRB     r0,[r4,#0x3d]
        0x080015ba:    f884003e    ..>.    STRB     r0,[r4,#0x3e]
        0x080015be:    2000        .       MOVS     r0,#0
        0x080015c0:    bd70        p.      POP      {r4-r6,pc}
        0x080015c2:    0000        ..      MOVS     r0,r0
    i.HAL_UART_MspInit
    HAL_UART_MspInit
        0x080015c4:    b530        0.      PUSH     {r4,r5,lr}
        0x080015c6:    b085        ..      SUB      sp,sp,#0x14
        0x080015c8:    2400        .$      MOVS     r4,#0
        0x080015ca:    9400        ..      STR      r4,[sp,#0]
        0x080015cc:    9401        ..      STR      r4,[sp,#4]
        0x080015ce:    9402        ..      STR      r4,[sp,#8]
        0x080015d0:    9403        ..      STR      r4,[sp,#0xc]
        0x080015d2:    6800        .h      LDR      r0,[r0,#0]
        0x080015d4:    4914        .I      LDR      r1,[pc,#80] ; [0x8001628] = 0x40013800
        0x080015d6:    4288        .B      CMP      r0,r1
        0x080015d8:    d124        $.      BNE      0x8001624 ; HAL_UART_MspInit + 96
        0x080015da:    4814        .H      LDR      r0,[pc,#80] ; [0x800162c] = 0x40021000
        0x080015dc:    6981        .i      LDR      r1,[r0,#0x18]
        0x080015de:    f4414180    A..A    ORR      r1,r1,#0x4000
        0x080015e2:    6181        .a      STR      r1,[r0,#0x18]
        0x080015e4:    6981        .i      LDR      r1,[r0,#0x18]
        0x080015e6:    f4014180    ...A    AND      r1,r1,#0x4000
        0x080015ea:    9104        ..      STR      r1,[sp,#0x10]
        0x080015ec:    6981        .i      LDR      r1,[r0,#0x18]
        0x080015ee:    f0410104    A...    ORR      r1,r1,#4
        0x080015f2:    6181        .a      STR      r1,[r0,#0x18]
        0x080015f4:    6980        .i      LDR      r0,[r0,#0x18]
        0x080015f6:    4d0e        .M      LDR      r5,[pc,#56] ; [0x8001630] = 0x40010800
        0x080015f8:    f0000004    ....    AND      r0,r0,#4
        0x080015fc:    9004        ..      STR      r0,[sp,#0x10]
        0x080015fe:    f44f7000    O..p    MOV      r0,#0x200
        0x08001602:    9000        ..      STR      r0,[sp,#0]
        0x08001604:    2002        .       MOVS     r0,#2
        0x08001606:    9001        ..      STR      r0,[sp,#4]
        0x08001608:    2003        .       MOVS     r0,#3
        0x0800160a:    9003        ..      STR      r0,[sp,#0xc]
        0x0800160c:    4669        iF      MOV      r1,sp
        0x0800160e:    4628        (F      MOV      r0,r5
        0x08001610:    f7fffb76    ..v.    BL       HAL_GPIO_Init ; 0x8000d00
        0x08001614:    1528        (.      ASRS     r0,r5,#20
        0x08001616:    e9cd0400    ....    STRD     r0,r4,[sp,#0]
        0x0800161a:    4669        iF      MOV      r1,sp
        0x0800161c:    4628        (F      MOV      r0,r5
        0x0800161e:    9402        ..      STR      r4,[sp,#8]
        0x08001620:    f7fffb6e    ..n.    BL       HAL_GPIO_Init ; 0x8000d00
        0x08001624:    b005        ..      ADD      sp,sp,#0x14
        0x08001626:    bd30        0.      POP      {r4,r5,pc}
    $d
        0x08001628:    40013800    .8.@    DCD    1073821696
        0x0800162c:    40021000    ...@    DCD    1073876992
        0x08001630:    40010800    ...@    DCD    1073809408
    $t
    i.SystemClock_Config
    SystemClock_Config
        0x08001634:    b530        0.      PUSH     {r4,r5,lr}
        0x08001636:    b08f        ..      SUB      sp,sp,#0x3c
        0x08001638:    2128        (!      MOVS     r1,#0x28
        0x0800163a:    4668        hF      MOV      r0,sp
        0x0800163c:    f7feff8e    ....    BL       __aeabi_memclr4 ; 0x800055c
        0x08001640:    2114        .!      MOVS     r1,#0x14
        0x08001642:    a80a        ..      ADD      r0,sp,#0x28
        0x08001644:    f7feff8a    ....    BL       __aeabi_memclr4 ; 0x800055c
        0x08001648:    2502        .%      MOVS     r5,#2
        0x0800164a:    2001        .       MOVS     r0,#1
        0x0800164c:    9004        ..      STR      r0,[sp,#0x10]
        0x0800164e:    9500        ..      STR      r5,[sp,#0]
        0x08001650:    2010        .       MOVS     r0,#0x10
        0x08001652:    9005        ..      STR      r0,[sp,#0x14]
        0x08001654:    2400        .$      MOVS     r4,#0
        0x08001656:    f44f1060    O.`.    MOV      r0,#0x380000
        0x0800165a:    e9cd4008    ...@    STRD     r4,r0,[sp,#0x20]
        0x0800165e:    9507        ..      STR      r5,[sp,#0x1c]
        0x08001660:    4668        hF      MOV      r0,sp
        0x08001662:    f7fffdd9    ....    BL       HAL_RCC_OscConfig ; 0x8001218
        0x08001666:    b108        ..      CBZ      r0,0x800166c ; SystemClock_Config + 56
        0x08001668:    b672        r.      CPSID    i
        0x0800166a:    e7fe        ..      B        0x800166a ; SystemClock_Config + 54
        0x0800166c:    200f        .       MOVS     r0,#0xf
        0x0800166e:    e9cd050a    ....    STRD     r0,r5,[sp,#0x28]
        0x08001672:    f44f6080    O..`    MOV      r0,#0x400
        0x08001676:    e9cd400c    ...@    STRD     r4,r0,[sp,#0x30]
        0x0800167a:    2102        .!      MOVS     r1,#2
        0x0800167c:    a80a        ..      ADD      r0,sp,#0x28
        0x0800167e:    940e        ..      STR      r4,[sp,#0x38]
        0x08001680:    f7fffcde    ....    BL       HAL_RCC_ClockConfig ; 0x8001040
        0x08001684:    2800        .(      CMP      r0,#0
        0x08001686:    d001        ..      BEQ      0x800168c ; SystemClock_Config + 88
        0x08001688:    b672        r.      CPSID    i
        0x0800168a:    e7fe        ..      B        0x800168a ; SystemClock_Config + 86
        0x0800168c:    b00f        ..      ADD      sp,sp,#0x3c
        0x0800168e:    bd30        0.      POP      {r4,r5,pc}
    i.UART_SetConfig
    UART_SetConfig
        0x08001690:    b570        p.      PUSH     {r4-r6,lr}
        0x08001692:    4604        .F      MOV      r4,r0
        0x08001694:    6800        .h      LDR      r0,[r0,#0]
        0x08001696:    6901        .i      LDR      r1,[r0,#0x10]
        0x08001698:    68e2        .h      LDR      r2,[r4,#0xc]
        0x0800169a:    f4215140    !.@Q    BIC      r1,r1,#0x3000
        0x0800169e:    4311        .C      ORRS     r1,r1,r2
        0x080016a0:    6101        .a      STR      r1,[r0,#0x10]
        0x080016a2:    6921        !i      LDR      r1,[r4,#0x10]
        0x080016a4:    68a0        .h      LDR      r0,[r4,#8]
        0x080016a6:    4308        .C      ORRS     r0,r0,r1
        0x080016a8:    6961        ai      LDR      r1,[r4,#0x14]
        0x080016aa:    4308        .C      ORRS     r0,r0,r1
        0x080016ac:    6821        !h      LDR      r1,[r4,#0]
        0x080016ae:    68ca        .h      LDR      r2,[r1,#0xc]
        0x080016b0:    f241630c    A..c    MOV      r3,#0x160c
        0x080016b4:    439a        .C      BICS     r2,r2,r3
        0x080016b6:    4302        .C      ORRS     r2,r2,r0
        0x080016b8:    60ca        .`      STR      r2,[r1,#0xc]
        0x080016ba:    6820         h      LDR      r0,[r4,#0]
        0x080016bc:    6941        Ai      LDR      r1,[r0,#0x14]
        0x080016be:    69a2        .i      LDR      r2,[r4,#0x18]
        0x080016c0:    f4217140    !.@q    BIC      r1,r1,#0x300
        0x080016c4:    4311        .C      ORRS     r1,r1,r2
        0x080016c6:    6141        Aa      STR      r1,[r0,#0x14]
        0x080016c8:    491e        .I      LDR      r1,[pc,#120] ; [0x8001744] = 0x40013800
        0x080016ca:    6820         h      LDR      r0,[r4,#0]
        0x080016cc:    4288        .B      CMP      r0,r1
        0x080016ce:    d102        ..      BNE      0x80016d6 ; UART_SetConfig + 70
        0x080016d0:    f7fffd5c    ..\.    BL       HAL_RCC_GetPCLK2Freq ; 0x800118c
        0x080016d4:    e001        ..      B        0x80016da ; UART_SetConfig + 74
        0x080016d6:    f7fffd49    ..I.    BL       HAL_RCC_GetPCLK1Freq ; 0x800116c
        0x080016da:    eb0001c0    ....    ADD      r1,r0,r0,LSL #3
        0x080016de:    eb011200    ....    ADD      r2,r1,r0,LSL #4
        0x080016e2:    6860        `h      LDR      r0,[r4,#4]
        0x080016e4:    2164        d!      MOVS     r1,#0x64
        0x080016e6:    0080        ..      LSLS     r0,r0,#2
        0x080016e8:    fbb2f3f0    ....    UDIV     r3,r2,r0
        0x080016ec:    fbb3f3f1    ....    UDIV     r3,r3,r1
        0x080016f0:    f06f0618    o...    MVN      r6,#0x18
        0x080016f4:    4373        sC      MULS     r3,r6,r3
        0x080016f6:    fbb2f5f0    ....    UDIV     r5,r2,r0
        0x080016fa:    fbb2f6f0    ....    UDIV     r6,r2,r0
        0x080016fe:    eb050583    ....    ADD      r5,r5,r3,LSL #2
        0x08001702:    2332        2#      MOVS     r3,#0x32
        0x08001704:    eb031505    ....    ADD      r5,r3,r5,LSL #4
        0x08001708:    fbb5f5f1    ....    UDIV     r5,r5,r1
        0x0800170c:    fbb6f6f1    ....    UDIV     r6,r6,r1
        0x08001710:    f00505f0    ....    AND      r5,r5,#0xf0
        0x08001714:    eb051506    ....    ADD      r5,r5,r6,LSL #4
        0x08001718:    fbb2f6f0    ....    UDIV     r6,r2,r0
        0x0800171c:    fbb2f0f0    ....    UDIV     r0,r2,r0
        0x08001720:    fbb0f0f1    ....    UDIV     r0,r0,r1
        0x08001724:    f06f0218    o...    MVN      r2,#0x18
        0x08001728:    4350        PC      MULS     r0,r2,r0
        0x0800172a:    eb060080    ....    ADD      r0,r6,r0,LSL #2
        0x0800172e:    eb031000    ....    ADD      r0,r3,r0,LSL #4
        0x08001732:    fbb0f0f1    ....    UDIV     r0,r0,r1
        0x08001736:    6821        !h      LDR      r1,[r4,#0]
        0x08001738:    f000000f    ....    AND      r0,r0,#0xf
        0x0800173c:    4428        (D      ADD      r0,r0,r5
        0x0800173e:    6088        .`      STR      r0,[r1,#8]
        0x08001740:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x08001742:    0000        ..      DCW    0
        0x08001744:    40013800    .8.@    DCD    1073821696
    $t
    i.__NVIC_SetPriority
    __NVIC_SetPriority
        0x08001748:    0709        ..      LSLS     r1,r1,#28
        0x0800174a:    0e09        ..      LSRS     r1,r1,#24
        0x0800174c:    2800        .(      CMP      r0,#0
        0x0800174e:    db04        ..      BLT      0x800175a ; __NVIC_SetPriority + 18
        0x08001750:    f10020e0    ...     ADD      r0,r0,#0xe000e000
        0x08001754:    f8801400    ....    STRB     r1,[r0,#0x400]
        0x08001758:    4770        pG      BX       lr
        0x0800175a:    f000000f    ....    AND      r0,r0,#0xf
        0x0800175e:    f10020e0    ...     ADD      r0,r0,#0xe000e000
        0x08001762:    f8801d14    ....    STRB     r1,[r0,#0xd14]
        0x08001766:    4770        pG      BX       lr
    i.__advance_software_protect_objectwatch_check
    __advance_software_protect_objectwatch_check
        0x08001768:    b510        ..      PUSH     {r4,lr}
        0x0800176a:    b140        @.      CBZ      r0,0x800177e ; __advance_software_protect_objectwatch_check + 22
        0x0800176c:    b139        9.      CBZ      r1,0x800177e ; __advance_software_protect_objectwatch_check + 22
        0x0800176e:    1844        D.      ADDS     r4,r0,r1
        0x08001770:    7862        bx      LDRB     r2,[r4,#1]
        0x08001772:    b132        2.      CBZ      r2,0x8001782 ; __advance_software_protect_objectwatch_check + 26
        0x08001774:    f7fff816    ....    BL       $Ven$TT$L$$advance_software_protect_crc32 ; 0x80007a4
        0x08001778:    6861        ah      LDR      r1,[r4,#4]
        0x0800177a:    4281        .B      CMP      r1,r0
        0x0800177c:    d003        ..      BEQ      0x8001786 ; __advance_software_protect_objectwatch_check + 30
        0x0800177e:    2000        .       MOVS     r0,#0
        0x08001780:    bd10        ..      POP      {r4,pc}
        0x08001782:    f000f802    ....    BL       __advance_software_protect_objectwatch_update ; 0x800178a
        0x08001786:    2001        .       MOVS     r0,#1
        0x08001788:    bd10        ..      POP      {r4,pc}
    i.__advance_software_protect_objectwatch_update
    __advance_software_protect_objectwatch_update
        0x0800178a:    b510        ..      PUSH     {r4,lr}
        0x0800178c:    2800        .(      CMP      r0,#0
        0x0800178e:    d007        ..      BEQ      0x80017a0 ; __advance_software_protect_objectwatch_update + 22
        0x08001790:    2900        .)      CMP      r1,#0
