openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08001792:    d005        ..      BEQ      0x80017a0 ; __advance_software_protect_objectwatch_update + 22
        0x08001794:    1844        D.      ADDS     r4,r0,r1
        0x08001796:    f7fff805    ....    BL       $Ven$TT$L$$advance_software_protect_crc32 ; 0x80007a4
        0x0800179a:    6060        ``      STR      r0,[r4,#4]
        0x0800179c:    2001        .       MOVS     r0,#1
        0x0800179e:    7060        `p      STRB     r0,[r4,#1]
        0x080017a0:    bd10        ..      POP      {r4,pc}
    i._advance_software_protect_ramcode_data_process
    _advance_software_protect_ramcode_data_process
        0x080017a2:    b57f        ..      PUSH     {r0-r6,lr}
        0x080017a4:    2200        ."      MOVS     r2,#0
        0x080017a6:    ab02        ..      ADD      r3,sp,#8
        0x080017a8:    e006        ..      B        0x80017b8 ; _advance_software_protect_ramcode_data_process + 22
        0x080017aa:    f0020507    ....    AND      r5,r2,#7
        0x080017ae:    5c84        .\      LDRB     r4,[r0,r2]
        0x080017b0:    5d5d        ]]      LDRB     r5,[r3,r5]
        0x080017b2:    406c        l@      EORS     r4,r4,r5
        0x080017b4:    5484        .T      STRB     r4,[r0,r2]
        0x080017b6:    1c52        R.      ADDS     r2,r2,#1
        0x080017b8:    428a        .B      CMP      r2,r1
        0x080017ba:    d3f6        ..      BCC      0x80017aa ; _advance_software_protect_ramcode_data_process + 8
        0x080017bc:    bd7f        ..      POP      {r0-r6,pc}
    i.add32
    add32
        0x080017be:    6803        .h      LDR      r3,[r0,#0]
        0x080017c0:    440b        .D      ADD      r3,r3,r1
        0x080017c2:    6003        .`      STR      r3,[r0,#0]
        0x080017c4:    f9920000    ....    LDRSB    r0,[r2,#0]
        0x080017c8:    428b        .B      CMP      r3,r1
        0x080017ca:    d201        ..      BCS      0x80017d0 ; add32 + 18
        0x080017cc:    2101        .!      MOVS     r1,#1
        0x080017ce:    e000        ..      B        0x80017d2 ; add32 + 20
        0x080017d0:    2100        .!      MOVS     r1,#0
        0x080017d2:    4408        .D      ADD      r0,r0,r1
        0x080017d4:    7010        .p      STRB     r0,[r2,#0]
        0x080017d6:    4770        pG      BX       lr
    i.add64
    add64
        0x080017d8:    b570        p.      PUSH     {r4-r6,lr}
        0x080017da:    2300        .#      MOVS     r3,#0
        0x080017dc:    461c        .F      MOV      r4,r3
        0x080017de:    6805        .h      LDR      r5,[r0,#0]
        0x080017e0:    441d        .D      ADD      r5,r5,r3
        0x080017e2:    6005        .`      STR      r5,[r0,#0]
        0x080017e4:    429d        .B      CMP      r5,r3
        0x080017e6:    d201        ..      BCS      0x80017ec ; add64 + 20
        0x080017e8:    2301        .#      MOVS     r3,#1
        0x080017ea:    e000        ..      B        0x80017ee ; add64 + 22
        0x080017ec:    2300        .#      MOVS     r3,#0
        0x080017ee:    680e        .h      LDR      r6,[r1,#0]
        0x080017f0:    4435        5D      ADD      r5,r5,r6
        0x080017f2:    6005        .`      STR      r5,[r0,#0]
        0x080017f4:    680e        .h      LDR      r6,[r1,#0]
        0x080017f6:    42b5        .B      CMP      r5,r6
        0x080017f8:    d201        ..      BCS      0x80017fe ; add64 + 38
        0x080017fa:    2501        .%      MOVS     r5,#1
        0x080017fc:    e000        ..      B        0x8001800 ; add64 + 40
        0x080017fe:    2500        .%      MOVS     r5,#0
        0x08001800:    1c64        d.      ADDS     r4,r4,#1
        0x08001802:    b2e4        ..      UXTB     r4,r4
        0x08001804:    1d00        ..      ADDS     r0,r0,#4
        0x08001806:    1d09        ..      ADDS     r1,r1,#4
        0x08001808:    442b        +D      ADD      r3,r3,r5
        0x0800180a:    2c02        .,      CMP      r4,#2
        0x0800180c:    d3e7        ..      BCC      0x80017de ; add64 + 6
        0x0800180e:    6810        .h      LDR      r0,[r2,#0]
        0x08001810:    4418        .D      ADD      r0,r0,r3
        0x08001812:    6010        .`      STR      r0,[r2,#0]
        0x08001814:    bd70        p.      POP      {r4-r6,pc}
        0x08001816:    0000        ..      MOVS     r0,r0
    i.advance_software_protect_dynamic_muti_object_watcher
    advance_software_protect_dynamic_muti_object_watcher
        0x08001818:    b510        ..      PUSH     {r4,lr}
        0x0800181a:    4829        )H      LDR      r0,[pc,#164] ; [0x80018c0] = 0x800103d
        0x0800181c:    f000f978    ..x.    BL       advance_software_protect_objectwatch_list_set_callback ; 0x8001b10
        0x08001820:    2200        ."      MOVS     r2,#0
        0x08001822:    2110        .!      MOVS     r1,#0x10
        0x08001824:    4827        'H      LDR      r0,[pc,#156] ; [0x80018c4] = 0x20000158
        0x08001826:    f000f8b7    ....    BL       advance_software_protect_objectwatch_list_add ; 0x8001998
        0x0800182a:    4826        &H      LDR      r0,[pc,#152] ; [0x80018c4] = 0x20000158
        0x0800182c:    2200        ."      MOVS     r2,#0
        0x0800182e:    2114        .!      MOVS     r1,#0x14
        0x08001830:    3010        .0      ADDS     r0,r0,#0x10
        0x08001832:    f000f8b1    ....    BL       advance_software_protect_objectwatch_list_add ; 0x8001998
        0x08001836:    4823        #H      LDR      r0,[pc,#140] ; [0x80018c4] = 0x20000158
        0x08001838:    2200        ."      MOVS     r2,#0
        0x0800183a:    2114        .!      MOVS     r1,#0x14
        0x0800183c:    3024        $0      ADDS     r0,r0,#0x24
        0x0800183e:    f000f8ab    ....    BL       advance_software_protect_objectwatch_list_add ; 0x8001998
        0x08001842:    4820         H      LDR      r0,[pc,#128] ; [0x80018c4] = 0x20000158
        0x08001844:    2200        ."      MOVS     r2,#0
        0x08001846:    2120         !      MOVS     r1,#0x20
        0x08001848:    3038        80      ADDS     r0,r0,#0x38
        0x0800184a:    f000f8a5    ....    BL       advance_software_protect_objectwatch_list_add ; 0x8001998
        0x0800184e:    481d        .H      LDR      r0,[pc,#116] ; [0x80018c4] = 0x20000158
        0x08001850:    2200        ."      MOVS     r2,#0
        0x08001852:    2120         !      MOVS     r1,#0x20
        0x08001854:    3038        80      ADDS     r0,r0,#0x38
        0x08001856:    f000f89f    ....    BL       advance_software_protect_objectwatch_list_add ; 0x8001998
        0x0800185a:    2200        ."      MOVS     r2,#0
        0x0800185c:    2120         !      MOVS     r1,#0x20
        0x0800185e:    4610        .F      MOV      r0,r2
        0x08001860:    f000f89a    ....    BL       advance_software_protect_objectwatch_list_add ; 0x8001998
        0x08001864:    2400        .$      MOVS     r4,#0
        0x08001866:    2020                MOVS     r0,#0x20
        0x08001868:    f7fefce8    ....    BL       malloc ; 0x800023c
        0x0800186c:    b130        0.      CBZ      r0,0x800187c ; advance_software_protect_dynamic_muti_object_watcher + 100
        0x0800186e:    2201        ."      MOVS     r2,#1
        0x08001870:    2120         !      MOVS     r1,#0x20
        0x08001872:    f000f891    ....    BL       advance_software_protect_objectwatch_list_add ; 0x8001998
        0x08001876:    1c64        d.      ADDS     r4,r4,#1
        0x08001878:    2c64        d,      CMP      r4,#0x64
        0x0800187a:    d3f4        ..      BCC      0x8001866 ; advance_software_protect_dynamic_muti_object_watcher + 78
        0x0800187c:    4811        .H      LDR      r0,[pc,#68] ; [0x80018c4] = 0x20000158
        0x0800187e:    3010        .0      ADDS     r0,r0,#0x10
        0x08001880:    f000f8f6    ....    BL       advance_software_protect_objectwatch_list_find ; 0x8001a70
        0x08001884:    480f        .H      LDR      r0,[pc,#60] ; [0x80018c4] = 0x20000158
        0x08001886:    3038        80      ADDS     r0,r0,#0x38
        0x08001888:    f000f8c0    ....    BL       advance_software_protect_objectwatch_list_check ; 0x8001a0c
        0x0800188c:    480d        .H      LDR      r0,[pc,#52] ; [0x80018c4] = 0x20000158
        0x0800188e:    3038        80      ADDS     r0,r0,#0x38
        0x08001890:    68c1        .h      LDR      r1,[r0,#0xc]
        0x08001892:    f08101ab    ....    EOR      r1,r1,#0xab
        0x08001896:    60c1        .`      STR      r1,[r0,#0xc]
        0x08001898:    f000f8d0    ....    BL       advance_software_protect_objectwatch_list_check_all ; 0x8001a3c
        0x0800189c:    f000f946    ..F.    BL       advance_software_protect_objectwatch_list_size ; 0x8001b2c
        0x080018a0:    4808        .H      LDR      r0,[pc,#32] ; [0x80018c4] = 0x20000158
        0x080018a2:    3038        80      ADDS     r0,r0,#0x38
        0x080018a4:    f000f94e    ..N.    BL       advance_software_protect_objectwatch_list_update ; 0x8001b44
        0x080018a8:    f000f8c8    ....    BL       advance_software_protect_objectwatch_list_check_all ; 0x8001a3c
        0x080018ac:    4805        .H      LDR      r0,[pc,#20] ; [0x80018c4] = 0x20000158
        0x080018ae:    3024        $0      ADDS     r0,r0,#0x24
        0x080018b0:    f000f8f4    ....    BL       advance_software_protect_objectwatch_list_remove ; 0x8001a9c
        0x080018b4:    f000f960    ..`.    BL       advance_software_protect_objectwatch_list_update_all ; 0x8001b78
        0x080018b8:    e8bd4010    ...@    POP      {r4,lr}
        0x080018bc:    f000b912    ....    B.W      advance_software_protect_objectwatch_list_reset ; 0x8001ae4
    $d
        0x080018c0:    0800103d    =...    DCD    134221885
        0x080018c4:    20000158    X..     DCD    536871256
    $t
    i.advance_software_protect_flash_verify_check
    advance_software_protect_flash_verify_check
        0x080018c8:    4a0e        .J      LDR      r2,[pc,#56] ; [0x8001904] = 0x200000f8
        0x080018ca:    b510        ..      PUSH     {r4,lr}
        0x080018cc:    6813        .h      LDR      r3,[r2,#0]
        0x080018ce:    6854        Th      LDR      r4,[r2,#4]
        0x080018d0:    480d        .H      LDR      r0,[pc,#52] ; [0x8001908] = 0x69b5e963
        0x080018d2:    490e        .I      LDR      r1,[pc,#56] ; [0x800190c] = 0x3126d23c
        0x080018d4:    4058        X@      EORS     r0,r0,r3
        0x080018d6:    4061        a@      EORS     r1,r1,r4
        0x080018d8:    4c0d        .L      LDR      r4,[pc,#52] ; [0x8001910] = 0xf268c8eb
        0x080018da:    4b0e        .K      LDR      r3,[pc,#56] ; [0x8001914] = 0x9dfe4427
        0x080018dc:    4060        `@      EORS     r0,r0,r4
        0x080018de:    4059        Y@      EORS     r1,r1,r3
        0x080018e0:    4308        .C      ORRS     r0,r0,r1
        0x080018e2:    d10b        ..      BNE      0x80018fc ; advance_software_protect_flash_verify_check + 52
        0x080018e4:    69d3        .i      LDR      r3,[r2,#0x1c]
        0x080018e6:    6a12        .j      LDR      r2,[r2,#0x20]
        0x080018e8:    490c        .I      LDR      r1,[pc,#48] ; [0x800191c] = 0xa4534d40
        0x080018ea:    480b        .H      LDR      r0,[pc,#44] ; [0x8001918] = 0xc32cb469
        0x080018ec:    4051        Q@      EORS     r1,r1,r2
        0x080018ee:    4058        X@      EORS     r0,r0,r3
        0x080018f0:    4a08        .J      LDR      r2,[pc,#32] ; [0x8001914] = 0x9dfe4427
        0x080018f2:    4623        #F      MOV      r3,r4
        0x080018f4:    4058        X@      EORS     r0,r0,r3
        0x080018f6:    4051        Q@      EORS     r1,r1,r2
        0x080018f8:    4308        .C      ORRS     r0,r0,r1
        0x080018fa:    d001        ..      BEQ      0x8001900 ; advance_software_protect_flash_verify_check + 56
        0x080018fc:    2000        .       MOVS     r0,#0
        0x080018fe:    bd10        ..      POP      {r4,pc}
        0x08001900:    2001        .       MOVS     r0,#1
        0x08001902:    bd10        ..      POP      {r4,pc}
    $d
        0x08001904:    200000f8    ...     DCD    536871160
        0x08001908:    69b5e963    c..i    DCD    1773529443
        0x0800190c:    3126d23c    <.&1    DCD    824627772
        0x08001910:    f268c8eb    ..h.    DCD    4066953451
        0x08001914:    9dfe4427    'D..    DCD    2650686503
        0x08001918:    c32cb469    i.,.    DCD    3274486889
        0x0800191c:    a4534d40    @MS.    DCD    2756922688
    $t
    i.advance_software_protect_flash_verify_init
    advance_software_protect_flash_verify_init
        0x08001920:    b5f8        ..      PUSH     {r3-r7,lr}
        0x08001922:    4c19        .L      LDR      r4,[pc,#100] ; [0x8001988] = 0x200000f8
        0x08001924:    68e0        .h      LDR      r0,[r4,#0xc]
        0x08001926:    bb60        `.      CBNZ     r0,0x8001982 ; advance_software_protect_flash_verify_init + 98
        0x08001928:    4818        .H      LDR      r0,[pc,#96] ; [0x800198c] = 0x8007fdc
        0x0800192a:    6801        .h      LDR      r1,[r0,#0]
        0x0800192c:    6842        Bh      LDR      r2,[r0,#4]
        0x0800192e:    6021        !`      STR      r1,[r4,#0]
        0x08001930:    6062        b`      STR      r2,[r4,#4]
        0x08001932:    6881        .h      LDR      r1,[r0,#8]
        0x08001934:    60a1        .`      STR      r1,[r4,#8]
        0x08001936:    68c1        .h      LDR      r1,[r0,#0xc]
        0x08001938:    60e1        .`      STR      r1,[r4,#0xc]
        0x0800193a:    6901        .i      LDR      r1,[r0,#0x10]
        0x0800193c:    6121        !a      STR      r1,[r4,#0x10]
        0x0800193e:    6941        Ai      LDR      r1,[r0,#0x14]
        0x08001940:    6161        aa      STR      r1,[r4,#0x14]
        0x08001942:    6981        .i      LDR      r1,[r0,#0x18]
        0x08001944:    61a1        .a      STR      r1,[r4,#0x18]
        0x08001946:    69c1        .i      LDR      r1,[r0,#0x1c]
        0x08001948:    6a00        .j      LDR      r0,[r0,#0x20]
        0x0800194a:    61e1        .a      STR      r1,[r4,#0x1c]
        0x0800194c:    6220         b      STR      r0,[r4,#0x20]
        0x0800194e:    f7ffffbb    ....    BL       advance_software_protect_flash_verify_check ; 0x80018c8
        0x08001952:    b938        8.      CBNZ     r0,0x8001964 ; advance_software_protect_flash_verify_init + 68
        0x08001954:    2000        .       MOVS     r0,#0
        0x08001956:    9000        ..      STR      r0,[sp,#0]
        0x08001958:    4a0d        .J      LDR      r2,[pc,#52] ; [0x8001990] = 0x9b62c2e6
        0x0800195a:    4b0e        .K      LDR      r3,[pc,#56] ; [0x8001994] = 0xfb90ffcb
        0x0800195c:    2124        $!      MOVS     r1,#0x24
        0x0800195e:    4620         F      MOV      r0,r4
        0x08001960:    f7feff25    ..%.    BL       $Ven$TT$L$$advance_software_protect_encrypt_process ; 0x80007ae
        0x08001964:    68a0        .h      LDR      r0,[r4,#8]
        0x08001966:    68e6        .h      LDR      r6,[r4,#0xc]
        0x08001968:    00c5        ..      LSLS     r5,r0,#3
        0x0800196a:    4628        (F      MOV      r0,r5
        0x0800196c:    f7fefc66    ..f.    BL       malloc ; 0x800023c
        0x08001970:    60e0        .`      STR      r0,[r4,#0xc]
        0x08001972:    68e0        .h      LDR      r0,[r4,#0xc]
        0x08001974:    2800        .(      CMP      r0,#0
        0x08001976:    d005        ..      BEQ      0x8001984 ; advance_software_protect_flash_verify_init + 100
        0x08001978:    68e0        .h      LDR      r0,[r4,#0xc]
        0x0800197a:    462a        *F      MOV      r2,r5
        0x0800197c:    4631        1F      MOV      r1,r6
        0x0800197e:    f7fefd8e    ....    BL       __aeabi_memcpy4 ; 0x800049e
        0x08001982:    2001        .       MOVS     r0,#1
        0x08001984:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x08001986:    0000        ..      DCW    0
        0x08001988:    200000f8    ...     DCD    536871160
        0x0800198c:    08007fdc    ....    DCD    134250460
        0x08001990:    9b62c2e6    ..b.    DCD    2606940902
        0x08001994:    fb90ffcb    ....    DCD    4220583883
    $t
    i.advance_software_protect_objectwatch_list_add
    advance_software_protect_objectwatch_list_add
        0x08001998:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x0800199c:    4617        .F      MOV      r7,r2
        0x0800199e:    460e        .F      MOV      r6,r1
        0x080019a0:    0005        ..      MOVS     r5,r0
        0x080019a2:    d008        ..      BEQ      0x80019b6 ; advance_software_protect_objectwatch_list_add + 30
        0x080019a4:    b13e        >.      CBZ      r6,0x80019b6 ; advance_software_protect_objectwatch_list_add + 30
        0x080019a6:    f000f863    ..c.    BL       advance_software_protect_objectwatch_list_find ; 0x8001a70
        0x080019aa:    b138        8.      CBZ      r0,0x80019bc ; advance_software_protect_objectwatch_list_add + 36
        0x080019ac:    4629        )F      MOV      r1,r5
        0x080019ae:    2002        .       MOVS     r0,#2
        0x080019b0:    f000f8b4    ....    BL       advance_software_protect_objectwatch_list_sigslot ; 0x8001b1c
        0x080019b4:    e025        %.      B        0x8001a02 ; advance_software_protect_objectwatch_list_add + 106
        0x080019b6:    2100        .!      MOVS     r1,#0
        0x080019b8:    4608        .F      MOV      r0,r1
        0x080019ba:    e016        ..      B        0x80019ea ; advance_software_protect_objectwatch_list_add + 82
        0x080019bc:    2014        .       MOVS     r0,#0x14
        0x080019be:    f7fefc3d    ..=.    BL       malloc ; 0x800023c
        0x080019c2:    0004        ..      MOVS     r4,r0
        0x080019c4:    d00f        ..      BEQ      0x80019e6 ; advance_software_protect_objectwatch_list_add + 78
        0x080019c6:    2000        .       MOVS     r0,#0
        0x080019c8:    6025        %`      STR      r5,[r4,#0]
        0x080019ca:    e9c46003    ...`    STRD     r6,r0,[r4,#0xc]
        0x080019ce:    4631        1F      MOV      r1,r6
        0x080019d0:    4628        (F      MOV      r0,r5
        0x080019d2:    f7fefee7    ....    BL       $Ven$TT$L$$advance_software_protect_crc32 ; 0x80007a4
        0x080019d6:    60a0        .`      STR      r0,[r4,#8]
        0x080019d8:    2001        .       MOVS     r0,#1
        0x080019da:    490b        .I      LDR      r1,[pc,#44] ; [0x8001a08] = 0x20000058
        0x080019dc:    7160        `q      STRB     r0,[r4,#5]
        0x080019de:    7127        'q      STRB     r7,[r4,#4]
        0x080019e0:    6808        .h      LDR      r0,[r1,#0]
        0x080019e2:    b138        8.      CBZ      r0,0x80019f4 ; advance_software_protect_objectwatch_list_add + 92
        0x080019e4:    e009        ..      B        0x80019fa ; advance_software_protect_objectwatch_list_add + 98
        0x080019e6:    2100        .!      MOVS     r1,#0
        0x080019e8:    2001        .       MOVS     r0,#1
        0x080019ea:    f000f897    ....    BL       advance_software_protect_objectwatch_list_sigslot ; 0x8001b1c
        0x080019ee:    2000        .       MOVS     r0,#0
        0x080019f0:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x080019f4:    600c        .`      STR      r4,[r1,#0]
        0x080019f6:    e004        ..      B        0x8001a02 ; advance_software_protect_objectwatch_list_add + 106
        0x080019f8:    4608        .F      MOV      r0,r1
        0x080019fa:    6901        .i      LDR      r1,[r0,#0x10]
        0x080019fc:    2900        .)      CMP      r1,#0
        0x080019fe:    d1fb        ..      BNE      0x80019f8 ; advance_software_protect_objectwatch_list_add + 96
        0x08001a00:    6104        .a      STR      r4,[r0,#0x10]
        0x08001a02:    2001        .       MOVS     r0,#1
        0x08001a04:    e7f4        ..      B        0x80019f0 ; advance_software_protect_objectwatch_list_add + 88
    $d
        0x08001a06:    0000        ..      DCW    0
        0x08001a08:    20000058    X..     DCD    536871000
    $t
    i.advance_software_protect_objectwatch_list_check
    advance_software_protect_objectwatch_list_check
        0x08001a0c:    490a        .I      LDR      r1,[pc,#40] ; [0x8001a38] = 0x20000058
        0x08001a0e:    b510        ..      PUSH     {r4,lr}
        0x08001a10:    680c        .h      LDR      r4,[r1,#0]
        0x08001a12:    e00e        ..      B        0x8001a32 ; advance_software_protect_objectwatch_list_check + 38
        0x08001a14:    6821        !h      LDR      r1,[r4,#0]
        0x08001a16:    4281        .B      CMP      r1,r0
        0x08001a18:    d10a        ..      BNE      0x8001a30 ; advance_software_protect_objectwatch_list_check + 36
        0x08001a1a:    68e1        .h      LDR      r1,[r4,#0xc]
        0x08001a1c:    6820         h      LDR      r0,[r4,#0]
        0x08001a1e:    f7fefec1    ....    BL       $Ven$TT$L$$advance_software_protect_crc32 ; 0x80007a4
        0x08001a22:    68a1        .h      LDR      r1,[r4,#8]
        0x08001a24:    4288        .B      CMP      r0,r1
        0x08001a26:    d101        ..      BNE      0x8001a2c ; advance_software_protect_objectwatch_list_check + 32
        0x08001a28:    2001        .       MOVS     r0,#1
        0x08001a2a:    bd10        ..      POP      {r4,pc}
        0x08001a2c:    2000        .       MOVS     r0,#0
        0x08001a2e:    bd10        ..      POP      {r4,pc}
        0x08001a30:    6924        $i      LDR      r4,[r4,#0x10]
        0x08001a32:    2c00        .,      CMP      r4,#0
        0x08001a34:    d1ee        ..      BNE      0x8001a14 ; advance_software_protect_objectwatch_list_check + 8
        0x08001a36:    e7f9        ..      B        0x8001a2c ; advance_software_protect_objectwatch_list_check + 32
    $d
        0x08001a38:    20000058    X..     DCD    536871000
    $t
    i.advance_software_protect_objectwatch_list_check_all
    advance_software_protect_objectwatch_list_check_all
        0x08001a3c:    b570        p.      PUSH     {r4-r6,lr}
        0x08001a3e:    480b        .H      LDR      r0,[pc,#44] ; [0x8001a6c] = 0x20000058
        0x08001a40:    2500        .%      MOVS     r5,#0
        0x08001a42:    6804        .h      LDR      r4,[r0,#0]
        0x08001a44:    e00d        ..      B        0x8001a62 ; advance_software_protect_objectwatch_list_check_all + 38
        0x08001a46:    68e1        .h      LDR      r1,[r4,#0xc]
        0x08001a48:    6820         h      LDR      r0,[r4,#0]
        0x08001a4a:    f7fefeab    ....    BL       $Ven$TT$L$$advance_software_protect_crc32 ; 0x80007a4
        0x08001a4e:    68a1        .h      LDR      r1,[r4,#8]
        0x08001a50:    4288        .B      CMP      r0,r1
        0x08001a52:    d101        ..      BNE      0x8001a58 ; advance_software_protect_objectwatch_list_check_all + 28
        0x08001a54:    1c6d        m.      ADDS     r5,r5,#1
        0x08001a56:    e003        ..      B        0x8001a60 ; advance_software_protect_objectwatch_list_check_all + 36
        0x08001a58:    2003        .       MOVS     r0,#3
        0x08001a5a:    6821        !h      LDR      r1,[r4,#0]
        0x08001a5c:    f000f85e    ..^.    BL       advance_software_protect_objectwatch_list_sigslot ; 0x8001b1c
        0x08001a60:    6924        $i      LDR      r4,[r4,#0x10]
        0x08001a62:    2c00        .,      CMP      r4,#0
