openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08001a64:    d1ef        ..      BNE      0x8001a46 ; advance_software_protect_objectwatch_list_check_all + 10
        0x08001a66:    4628        (F      MOV      r0,r5
        0x08001a68:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x08001a6a:    0000        ..      DCW    0
        0x08001a6c:    20000058    X..     DCD    536871000
    $t
    i.advance_software_protect_objectwatch_list_find
    advance_software_protect_objectwatch_list_find
        0x08001a70:    4909        .I      LDR      r1,[pc,#36] ; [0x8001a98] = 0x20000058
        0x08001a72:    b510        ..      PUSH     {r4,lr}
        0x08001a74:    6809        .h      LDR      r1,[r1,#0]
        0x08001a76:    b950        P.      CBNZ     r0,0x8001a8e ; advance_software_protect_objectwatch_list_find + 30
        0x08001a78:    2100        .!      MOVS     r1,#0
        0x08001a7a:    4608        .F      MOV      r0,r1
        0x08001a7c:    f000f84e    ..N.    BL       advance_software_protect_objectwatch_list_sigslot ; 0x8001b1c
        0x08001a80:    e007        ..      B        0x8001a92 ; advance_software_protect_objectwatch_list_find + 34
        0x08001a82:    680a        .h      LDR      r2,[r1,#0]
        0x08001a84:    4282        .B      CMP      r2,r0
        0x08001a86:    d101        ..      BNE      0x8001a8c ; advance_software_protect_objectwatch_list_find + 28
        0x08001a88:    2001        .       MOVS     r0,#1
        0x08001a8a:    bd10        ..      POP      {r4,pc}
        0x08001a8c:    6909        .i      LDR      r1,[r1,#0x10]
        0x08001a8e:    2900        .)      CMP      r1,#0
        0x08001a90:    d1f7        ..      BNE      0x8001a82 ; advance_software_protect_objectwatch_list_find + 18
        0x08001a92:    2000        .       MOVS     r0,#0
        0x08001a94:    bd10        ..      POP      {r4,pc}
    $d
        0x08001a96:    0000        ..      DCW    0
        0x08001a98:    20000058    X..     DCD    536871000
    $t
    i.advance_software_protect_objectwatch_list_remove
    advance_software_protect_objectwatch_list_remove
        0x08001a9c:    b570        p.      PUSH     {r4-r6,lr}
        0x08001a9e:    4910        .I      LDR      r1,[pc,#64] ; [0x8001ae0] = 0x20000058
        0x08001aa0:    4603        .F      MOV      r3,r0
        0x08001aa2:    680c        .h      LDR      r4,[r1,#0]
        0x08001aa4:    4622        "F      MOV      r2,r4
        0x08001aa6:    4620         F      MOV      r0,r4
        0x08001aa8:    e015        ..      B        0x8001ad6 ; advance_software_protect_objectwatch_list_remove + 58
        0x08001aaa:    6825        %h      LDR      r5,[r4,#0]
        0x08001aac:    429d        .B      CMP      r5,r3
        0x08001aae:    d110        ..      BNE      0x8001ad2 ; advance_software_protect_objectwatch_list_remove + 54
        0x08001ab0:    42a0        .B      CMP      r0,r4
        0x08001ab2:    d102        ..      BNE      0x8001aba ; advance_software_protect_objectwatch_list_remove + 30
        0x08001ab4:    6910        .i      LDR      r0,[r2,#0x10]
        0x08001ab6:    6008        .`      STR      r0,[r1,#0]
        0x08001ab8:    e001        ..      B        0x8001abe ; advance_software_protect_objectwatch_list_remove + 34
        0x08001aba:    6921        !i      LDR      r1,[r4,#0x10]
        0x08001abc:    6101        .a      STR      r1,[r0,#0x10]
        0x08001abe:    7920         y      LDRB     r0,[r4,#4]
        0x08001ac0:    b110        ..      CBZ      r0,0x8001ac8 ; advance_software_protect_objectwatch_list_remove + 44
        0x08001ac2:    6820         h      LDR      r0,[r4,#0]
        0x08001ac4:    f7fefbe9    ....    BL       free ; 0x800029a
        0x08001ac8:    4620         F      MOV      r0,r4
        0x08001aca:    f7fefbe6    ....    BL       free ; 0x800029a
        0x08001ace:    2001        .       MOVS     r0,#1
        0x08001ad0:    bd70        p.      POP      {r4-r6,pc}
        0x08001ad2:    4620         F      MOV      r0,r4
        0x08001ad4:    6924        $i      LDR      r4,[r4,#0x10]
        0x08001ad6:    2c00        .,      CMP      r4,#0
        0x08001ad8:    d1e7        ..      BNE      0x8001aaa ; advance_software_protect_objectwatch_list_remove + 14
        0x08001ada:    2000        .       MOVS     r0,#0
        0x08001adc:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x08001ade:    0000        ..      DCW    0
        0x08001ae0:    20000058    X..     DCD    536871000
    $t
    i.advance_software_protect_objectwatch_list_reset
    advance_software_protect_objectwatch_list_reset
        0x08001ae4:    b570        p.      PUSH     {r4-r6,lr}
        0x08001ae6:    4e09        .N      LDR      r6,[pc,#36] ; [0x8001b0c] = 0x20000058
        0x08001ae8:    6834        4h      LDR      r4,[r6,#0]
        0x08001aea:    e009        ..      B        0x8001b00 ; advance_software_protect_objectwatch_list_reset + 28
        0x08001aec:    7920         y      LDRB     r0,[r4,#4]
        0x08001aee:    6925        %i      LDR      r5,[r4,#0x10]
        0x08001af0:    b110        ..      CBZ      r0,0x8001af8 ; advance_software_protect_objectwatch_list_reset + 20
        0x08001af2:    6820         h      LDR      r0,[r4,#0]
        0x08001af4:    f7fefbd1    ....    BL       free ; 0x800029a
        0x08001af8:    4620         F      MOV      r0,r4
        0x08001afa:    f7fefbce    ....    BL       free ; 0x800029a
        0x08001afe:    462c        ,F      MOV      r4,r5
        0x08001b00:    2c00        .,      CMP      r4,#0
        0x08001b02:    d1f3        ..      BNE      0x8001aec ; advance_software_protect_objectwatch_list_reset + 8
        0x08001b04:    2000        .       MOVS     r0,#0
        0x08001b06:    6030        0`      STR      r0,[r6,#0]
        0x08001b08:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x08001b0a:    0000        ..      DCW    0
        0x08001b0c:    20000058    X..     DCD    536871000
    $t
    i.advance_software_protect_objectwatch_list_set_callback
    advance_software_protect_objectwatch_list_set_callback
        0x08001b10:    4901        .I      LDR      r1,[pc,#4] ; [0x8001b18] = 0x20000058
        0x08001b12:    6048        H`      STR      r0,[r1,#4]
        0x08001b14:    4770        pG      BX       lr
    $d
        0x08001b16:    0000        ..      DCW    0
        0x08001b18:    20000058    X..     DCD    536871000
    $t
    i.advance_software_protect_objectwatch_list_sigslot
    advance_software_protect_objectwatch_list_sigslot
        0x08001b1c:    4a02        .J      LDR      r2,[pc,#8] ; [0x8001b28] = 0x20000058
        0x08001b1e:    6852        Rh      LDR      r2,[r2,#4]
        0x08001b20:    2a00        .*      CMP      r2,#0
        0x08001b22:    d000        ..      BEQ      0x8001b26 ; advance_software_protect_objectwatch_list_sigslot + 10
        0x08001b24:    4710        .G      BX       r2
        0x08001b26:    4770        pG      BX       lr
    $d
        0x08001b28:    20000058    X..     DCD    536871000
    $t
    i.advance_software_protect_objectwatch_list_size
    advance_software_protect_objectwatch_list_size
        0x08001b2c:    4904        .I      LDR      r1,[pc,#16] ; [0x8001b40] = 0x20000058
        0x08001b2e:    2000        .       MOVS     r0,#0
        0x08001b30:    6809        .h      LDR      r1,[r1,#0]
        0x08001b32:    e001        ..      B        0x8001b38 ; advance_software_protect_objectwatch_list_size + 12
        0x08001b34:    6909        .i      LDR      r1,[r1,#0x10]
        0x08001b36:    1c40        @.      ADDS     r0,r0,#1
        0x08001b38:    2900        .)      CMP      r1,#0
        0x08001b3a:    d1fb        ..      BNE      0x8001b34 ; advance_software_protect_objectwatch_list_size + 8
        0x08001b3c:    4770        pG      BX       lr
    $d
        0x08001b3e:    0000        ..      DCW    0
        0x08001b40:    20000058    X..     DCD    536871000
    $t
    i.advance_software_protect_objectwatch_list_update
    advance_software_protect_objectwatch_list_update
        0x08001b44:    490b        .I      LDR      r1,[pc,#44] ; [0x8001b74] = 0x20000058
        0x08001b46:    b510        ..      PUSH     {r4,lr}
        0x08001b48:    680c        .h      LDR      r4,[r1,#0]
        0x08001b4a:    e00a        ..      B        0x8001b62 ; advance_software_protect_objectwatch_list_update + 30
        0x08001b4c:    6821        !h      LDR      r1,[r4,#0]
        0x08001b4e:    4281        .B      CMP      r1,r0
        0x08001b50:    d106        ..      BNE      0x8001b60 ; advance_software_protect_objectwatch_list_update + 28
        0x08001b52:    68e1        .h      LDR      r1,[r4,#0xc]
        0x08001b54:    6820         h      LDR      r0,[r4,#0]
        0x08001b56:    f7fefe25    ..%.    BL       $Ven$TT$L$$advance_software_protect_crc32 ; 0x80007a4
        0x08001b5a:    60a0        .`      STR      r0,[r4,#8]
        0x08001b5c:    2001        .       MOVS     r0,#1
        0x08001b5e:    bd10        ..      POP      {r4,pc}
        0x08001b60:    6924        $i      LDR      r4,[r4,#0x10]
        0x08001b62:    2c00        .,      CMP      r4,#0
        0x08001b64:    d1f2        ..      BNE      0x8001b4c ; advance_software_protect_objectwatch_list_update + 8
        0x08001b66:    2100        .!      MOVS     r1,#0
        0x08001b68:    4608        .F      MOV      r0,r1
        0x08001b6a:    f7ffffd7    ....    BL       advance_software_protect_objectwatch_list_sigslot ; 0x8001b1c
        0x08001b6e:    2000        .       MOVS     r0,#0
        0x08001b70:    bd10        ..      POP      {r4,pc}
    $d
        0x08001b72:    0000        ..      DCW    0
        0x08001b74:    20000058    X..     DCD    536871000
    $t
    i.advance_software_protect_objectwatch_list_update_all
    advance_software_protect_objectwatch_list_update_all
        0x08001b78:    4806        .H      LDR      r0,[pc,#24] ; [0x8001b94] = 0x20000058
        0x08001b7a:    b510        ..      PUSH     {r4,lr}
        0x08001b7c:    6804        .h      LDR      r4,[r0,#0]
        0x08001b7e:    e005        ..      B        0x8001b8c ; advance_software_protect_objectwatch_list_update_all + 20
        0x08001b80:    68e1        .h      LDR      r1,[r4,#0xc]
        0x08001b82:    6820         h      LDR      r0,[r4,#0]
        0x08001b84:    f7fefe0e    ....    BL       $Ven$TT$L$$advance_software_protect_crc32 ; 0x80007a4
        0x08001b88:    60a0        .`      STR      r0,[r4,#8]
        0x08001b8a:    6924        $i      LDR      r4,[r4,#0x10]
        0x08001b8c:    2c00        .,      CMP      r4,#0
        0x08001b8e:    d1f7        ..      BNE      0x8001b80 ; advance_software_protect_objectwatch_list_update_all + 8
        0x08001b90:    bd10        ..      POP      {r4,pc}
    $d
        0x08001b92:    0000        ..      DCW    0
        0x08001b94:    20000058    X..     DCD    536871000
    $t
    i.advance_software_protect_ramcode_loader
    advance_software_protect_ramcode_loader
        0x08001b98:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08001b9c:    4e2d        -N      LDR      r6,[pc,#180] ; [0x8001c54] = 0x20000060
        0x08001b9e:    4605        .F      MOV      r5,r0
        0x08001ba0:    7830        0x      LDRB     r0,[r6,#0]
        0x08001ba2:    b108        ..      CBZ      r0,0x8001ba8 ; advance_software_protect_ramcode_loader + 16
        0x08001ba4:    2001        .       MOVS     r0,#1
        0x08001ba6:    e050        P.      B        0x8001c4a ; advance_software_protect_ramcode_loader + 178
        0x08001ba8:    482b        +H      LDR      r0,[pc,#172] ; [0x8001c58] = 0x8008100
        0x08001baa:    4c2c        ,L      LDR      r4,[pc,#176] ; [0x8001c5c] = 0x2000011c
        0x08001bac:    6801        .h      LDR      r1,[r0,#0]
        0x08001bae:    6842        Bh      LDR      r2,[r0,#4]
        0x08001bb0:    6021        !`      STR      r1,[r4,#0]
        0x08001bb2:    6062        b`      STR      r2,[r4,#4]
        0x08001bb4:    6881        .h      LDR      r1,[r0,#8]
        0x08001bb6:    60a1        .`      STR      r1,[r4,#8]
        0x08001bb8:    68c1        .h      LDR      r1,[r0,#0xc]
        0x08001bba:    60e1        .`      STR      r1,[r4,#0xc]
        0x08001bbc:    6901        .i      LDR      r1,[r0,#0x10]
        0x08001bbe:    6121        !a      STR      r1,[r4,#0x10]
        0x08001bc0:    6941        Ai      LDR      r1,[r0,#0x14]
        0x08001bc2:    6161        aa      STR      r1,[r4,#0x14]
        0x08001bc4:    6981        .i      LDR      r1,[r0,#0x18]
        0x08001bc6:    69c0        .i      LDR      r0,[r0,#0x1c]
        0x08001bc8:    61a1        .a      STR      r1,[r4,#0x18]
        0x08001bca:    61e0        .a      STR      r0,[r4,#0x1c]
        0x08001bcc:    6822        "h      LDR      r2,[r4,#0]
        0x08001bce:    6863        ch      LDR      r3,[r4,#4]
        0x08001bd0:    4823        #H      LDR      r0,[pc,#140] ; [0x8001c60] = 0xf0586646
        0x08001bd2:    4924        $I      LDR      r1,[pc,#144] ; [0x8001c64] = 0xcc189032
        0x08001bd4:    4050        P@      EORS     r0,r0,r2
        0x08001bd6:    4059        Y@      EORS     r1,r1,r3
        0x08001bd8:    4b23        #K      LDR      r3,[pc,#140] ; [0x8001c68] = 0xf268c8eb
        0x08001bda:    4a24        $J      LDR      r2,[pc,#144] ; [0x8001c6c] = 0x9dfe4427
        0x08001bdc:    4058        X@      EORS     r0,r0,r3
        0x08001bde:    4051        Q@      EORS     r1,r1,r2
        0x08001be0:    4308        .C      ORRS     r0,r0,r1
        0x08001be2:    d10b        ..      BNE      0x8001bfc ; advance_software_protect_ramcode_loader + 100
        0x08001be4:    69a2        .i      LDR      r2,[r4,#0x18]
        0x08001be6:    69e3        .i      LDR      r3,[r4,#0x1c]
        0x08001be8:    4821        !H      LDR      r0,[pc,#132] ; [0x8001c70] = 0x2ff941c7
        0x08001bea:    4922        "I      LDR      r1,[pc,#136] ; [0x8001c74] = 0x56128fc1
        0x08001bec:    4050        P@      EORS     r0,r0,r2
        0x08001bee:    4059        Y@      EORS     r1,r1,r3
        0x08001bf0:    4b1d        .K      LDR      r3,[pc,#116] ; [0x8001c68] = 0xf268c8eb
        0x08001bf2:    4a1e        .J      LDR      r2,[pc,#120] ; [0x8001c6c] = 0x9dfe4427
        0x08001bf4:    4058        X@      EORS     r0,r0,r3
        0x08001bf6:    4051        Q@      EORS     r1,r1,r2
        0x08001bf8:    4308        .C      ORRS     r0,r0,r1
        0x08001bfa:    d019        ..      BEQ      0x8001c30 ; advance_software_protect_ramcode_loader + 152
        0x08001bfc:    4f1e        .O      LDR      r7,[pc,#120] ; [0x8001c78] = 0x9b62c2e6
        0x08001bfe:    f8df807c    ..|.    LDR      r8,[pc,#124] ; [0x8001c7c] = 0xfb90ffcb
        0x08001c02:    463a        :F      MOV      r2,r7
        0x08001c04:    4643        CF      MOV      r3,r8
        0x08001c06:    2120         !      MOVS     r1,#0x20
        0x08001c08:    4814        .H      LDR      r0,[pc,#80] ; [0x8001c5c] = 0x2000011c
        0x08001c0a:    f7fffdca    ....    BL       _advance_software_protect_ramcode_data_process ; 0x80017a2
        0x08001c0e:    6922        "i      LDR      r2,[r4,#0x10]
        0x08001c10:    68e1        .h      LDR      r1,[r4,#0xc]
        0x08001c12:    68a0        .h      LDR      r0,[r4,#8]
        0x08001c14:    f7fefbfe    ....    BL       __aeabi_memcpy ; 0x8000414
        0x08001c18:    6921        !i      LDR      r1,[r4,#0x10]
        0x08001c1a:    68a0        .h      LDR      r0,[r4,#8]
        0x08001c1c:    463a        :F      MOV      r2,r7
        0x08001c1e:    4643        CF      MOV      r3,r8
        0x08001c20:    f7fffdbf    ....    BL       _advance_software_protect_ramcode_data_process ; 0x80017a2
        0x08001c24:    68a7        .h      LDR      r7,[r4,#8]
        0x08001c26:    6922        "i      LDR      r2,[r4,#0x10]
        0x08001c28:    6963        ci      LDR      r3,[r4,#0x14]
        0x08001c2a:    2000        .       MOVS     r0,#0
        0x08001c2c:    4601        .F      MOV      r1,r0
        0x08001c2e:    e004        ..      B        0x8001c3a ; advance_software_protect_ramcode_loader + 162
        0x08001c30:    2000        .       MOVS     r0,#0
        0x08001c32:    e00a        ..      B        0x8001c4a ; advance_software_protect_ramcode_loader + 178
        0x08001c34:    5c3c        <\      LDRB     r4,[r7,r0]
        0x08001c36:    1c40        @.      ADDS     r0,r0,#1
        0x08001c38:    4421        !D      ADD      r1,r1,r4
        0x08001c3a:    4290        .B      CMP      r0,r2
        0x08001c3c:    d3fa        ..      BCC      0x8001c34 ; advance_software_protect_ramcode_loader + 156
        0x08001c3e:    4299        .B      CMP      r1,r3
        0x08001c40:    d102        ..      BNE      0x8001c48 ; advance_software_protect_ramcode_loader + 176
        0x08001c42:    2001        .       MOVS     r0,#1
        0x08001c44:    7030        0p      STRB     r0,[r6,#0]
        0x08001c46:    e7ad        ..      B        0x8001ba4 ; advance_software_protect_ramcode_loader + 12
        0x08001c48:    2002        .       MOVS     r0,#2
        0x08001c4a:    46ac        .F      MOV      r12,r5
        0x08001c4c:    e8bd41f0    ...A    POP      {r4-r8,lr}
        0x08001c50:    4760        `G      BX       r12
    $d
        0x08001c52:    0000        ..      DCW    0
        0x08001c54:    20000060    `..     DCD    536871008
        0x08001c58:    08008100    ....    DCD    134250752
        0x08001c5c:    2000011c    ...     DCD    536871196
        0x08001c60:    f0586646    FfX.    DCD    4032325190
        0x08001c64:    cc189032    2...    DCD    3424161842
        0x08001c68:    f268c8eb    ..h.    DCD    4066953451
        0x08001c6c:    9dfe4427    'D..    DCD    2650686503
        0x08001c70:    2ff941c7    .A./    DCD    804864455
        0x08001c74:    56128fc1    ...V    DCD    1444057025
        0x08001c78:    9b62c2e6    ..b.    DCD    2606940902
        0x08001c7c:    fb90ffcb    ....    DCD    4220583883
    $t
    i.advance_software_protect_ramcode_sample
    advance_software_protect_ramcode_sample
        0x08001c80:    2800        .(      CMP      r0,#0
        0x08001c82:    d005        ..      BEQ      0x8001c90 ; advance_software_protect_ramcode_sample + 16
        0x08001c84:    2801        .(      CMP      r0,#1
        0x08001c86:    d003        ..      BEQ      0x8001c90 ; advance_software_protect_ramcode_sample + 16
        0x08001c88:    2802        .(      CMP      r0,#2
        0x08001c8a:    d101        ..      BNE      0x8001c90 ; advance_software_protect_ramcode_sample + 16
        0x08001c8c:    f7febd94    ....    B        $Ven$TT$L$$advance_software_protect_system_reset ; 0x80007b8
        0x08001c90:    4770        pG      BX       lr
        0x08001c92:    0000        ..      MOVS     r0,r0
    i.advance_software_protect_rights
    advance_software_protect_rights
        0x08001c94:    4803        .H      LDR      r0,[pc,#12] ; [0x8001ca4] = 0x20000061
        0x08001c96:    7801        .x      LDRB     r1,[r0,#0]
        0x08001c98:    2900        .)      CMP      r1,#0
        0x08001c9a:    d101        ..      BNE      0x8001ca0 ; advance_software_protect_rights + 12
        0x08001c9c:    2101        .!      MOVS     r1,#1
        0x08001c9e:    7001        .p      STRB     r1,[r0,#0]
        0x08001ca0:    4770        pG      BX       lr
    $d
        0x08001ca2:    0000        ..      DCW    0
        0x08001ca4:    20000061    a..     DCD    536871009
    $t
    i.advance_software_protect_samples
    advance_software_protect_samples
        0x08001ca8:    b510        ..      PUSH     {r4,lr}
        0x08001caa:    f7fffff3    ....    BL       advance_software_protect_rights ; 0x8001c94
        0x08001cae:    4808        .H      LDR      r0,[pc,#32] ; [0x8001cd0] = 0x8001c81
        0x08001cb0:    f7ffff72    ..r.    BL       advance_software_protect_ramcode_loader ; 0x8001b98
        0x08001cb4:    f000f810    ....    BL       advance_software_protect_single_object_watcher ; 0x8001cd8
        0x08001cb8:    f7fffdae    ....    BL       advance_software_protect_dynamic_muti_object_watcher ; 0x8001818
        0x08001cbc:    f7fefd81    ....    BL       $Ven$TT$L$$advance_software_protect_verify_authorization ; 0x80007c2
        0x08001cc0:    f7fefd84    ....    BL       $Ven$TT$L$$advance_software_protect_flash_verify ; 0x80007cc
        0x08001cc4:    e8bd4010    ...@    POP      {r4,lr}
        0x08001cc8:    4802        .H      LDR      r0,[pc,#8] ; [0x8001cd4] = 0x800103b
        0x08001cca:    f7febd84    ....    B        $Ven$TT$L$$advance_software_protect_anti_debugger ; 0x80007d6
    $d
        0x08001cce:    0000        ..      DCW    0
        0x08001cd0:    08001c81    ....    DCD    134225025
        0x08001cd4:    0800103b    ;...    DCD    134221883
    $t
    i.advance_software_protect_single_object_watcher
    advance_software_protect_single_object_watcher
        0x08001cd8:    b510        ..      PUSH     {r4,lr}
        0x08001cda:    2110        .!      MOVS     r1,#0x10
        0x08001cdc:    480c        .H      LDR      r0,[pc,#48] ; [0x8001d10] = 0x2000013c
        0x08001cde:    f7fffd43    ..C.    BL       __advance_software_protect_objectwatch_check ; 0x8001768
        0x08001ce2:    480b        .H      LDR      r0,[pc,#44] ; [0x8001d10] = 0x2000013c
        0x08001ce4:    2101        .!      MOVS     r1,#1
        0x08001ce6:    6001        .`      STR      r1,[r0,#0]
        0x08001ce8:    2102        .!      MOVS     r1,#2
        0x08001cea:    6041        A`      STR      r1,[r0,#4]
        0x08001cec:    2103        .!      MOVS     r1,#3
        0x08001cee:    6081        .`      STR      r1,[r0,#8]
        0x08001cf0:    4908        .I      LDR      r1,[pc,#32] ; [0x8001d14] = 0x12345678
        0x08001cf2:    60c1        .`      STR      r1,[r0,#0xc]
        0x08001cf4:    2110        .!      MOVS     r1,#0x10
        0x08001cf6:    f7fffd37    ..7.    BL       __advance_software_protect_objectwatch_check ; 0x8001768
        0x08001cfa:    2110        .!      MOVS     r1,#0x10
        0x08001cfc:    4804        .H      LDR      r0,[pc,#16] ; [0x8001d10] = 0x2000013c
        0x08001cfe:    f7fffd44    ..D.    BL       __advance_software_protect_objectwatch_update ; 0x800178a
        0x08001d02:    e8bd4010    ...@    POP      {r4,lr}
        0x08001d06:    2110        .!      MOVS     r1,#0x10
        0x08001d08:    4801        .H      LDR      r0,[pc,#4] ; [0x8001d10] = 0x2000013c
        0x08001d0a:    f7ffbd2d    ..-.    B.W      __advance_software_protect_objectwatch_check ; 0x8001768
    $d
        0x08001d0e:    0000        ..      DCW    0
        0x08001d10:    2000013c    <..     DCD    536871228
        0x08001d14:    12345678    xV4.    DCD    305419896
    $t
    i.carry64
    carry64
        0x08001d18:    b510        ..      PUSH     {r4,lr}
        0x08001d1a:    2200        ."      MOVS     r2,#0
        0x08001d1c:    6803        .h      LDR      r3,[r0,#0]
        0x08001d1e:    680c        .h      LDR      r4,[r1,#0]
        0x08001d20:    4423        #D      ADD      r3,r3,r4
        0x08001d22:    6003        .`      STR      r3,[r0,#0]
        0x08001d24:    680c        .h      LDR      r4,[r1,#0]
        0x08001d26:    42a3        .B      CMP      r3,r4
        0x08001d28:    d201        ..      BCS      0x8001d2e ; carry64 + 22
        0x08001d2a:    2301        .#      MOVS     r3,#1
