openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08001d2c:    e000        ..      B        0x8001d30 ; carry64 + 24
        0x08001d2e:    2300        .#      MOVS     r3,#0
        0x08001d30:    1c52        R.      ADDS     r2,r2,#1
        0x08001d32:    b2d2        ..      UXTB     r2,r2
        0x08001d34:    1d00        ..      ADDS     r0,r0,#4
        0x08001d36:    600b        .`      STR      r3,[r1,#0]
        0x08001d38:    2a02        .*      CMP      r2,#2
        0x08001d3a:    d3ef        ..      BCC      0x8001d1c ; carry64 + 4
        0x08001d3c:    bd10        ..      POP      {r4,pc}
        0x08001d3e:    0000        ..      MOVS     r0,r0
    i.crc32
    crc32
        0x08001d40:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08001d44:    460f        .F      MOV      r7,r1
        0x08001d46:    4606        .F      MOV      r6,r0
        0x08001d48:    f04f34ff    O..4    MOV      r4,#0xffffffff
        0x08001d4c:    2500        .%      MOVS     r5,#0
        0x08001d4e:    f8df803c    ..<.    LDR      r8,[pc,#60] ; [0x8001d8c] = 0x4c11db7
        0x08001d52:    e012        ..      B        0x8001d7a ; crc32 + 58
        0x08001d54:    5d70        p]      LDRB     r0,[r6,r5]
        0x08001d56:    2108        .!      MOVS     r1,#8
        0x08001d58:    f005fb77    ..w.    BL       reflect ; 0x800744a
        0x08001d5c:    ea846400    ...d    EOR      r4,r4,r0,LSL #24
        0x08001d60:    2008        .       MOVS     r0,#8
        0x08001d62:    4641        AF      MOV      r1,r8
        0x08001d64:    2c00        .,      CMP      r4,#0
        0x08001d66:    da02        ..      BGE      0x8001d6e ; crc32 + 46
        0x08001d68:    ea810444    ..D.    EOR      r4,r1,r4,LSL #1
        0x08001d6c:    e000        ..      B        0x8001d70 ; crc32 + 48
        0x08001d6e:    0064        d.      LSLS     r4,r4,#1
        0x08001d70:    1e40        @.      SUBS     r0,r0,#1
        0x08001d72:    f01000ff    ....    ANDS     r0,r0,#0xff
        0x08001d76:    d1f5        ..      BNE      0x8001d64 ; crc32 + 36
        0x08001d78:    1c6d        m.      ADDS     r5,r5,#1
        0x08001d7a:    42bd        .B      CMP      r5,r7
        0x08001d7c:    dbea        ..      BLT      0x8001d54 ; crc32 + 20
        0x08001d7e:    2120         !      MOVS     r1,#0x20
        0x08001d80:    4620         F      MOV      r0,r4
        0x08001d82:    f005fb62    ..b.    BL       reflect ; 0x800744a
        0x08001d86:    43c0        .C      MVNS     r0,r0
        0x08001d88:    e8bd81f0    ....    POP      {r4-r8,pc}
    $d
        0x08001d8c:    04c11db7    ....    DCD    79764919
    $t
    i.crc32_continue
    crc32_continue
        0x08001d90:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08001d94:    460e        .F      MOV      r6,r1
        0x08001d96:    4617        .F      MOV      r7,r2
        0x08001d98:    2120         !      MOVS     r1,#0x20
        0x08001d9a:    43c0        .C      MVNS     r0,r0
        0x08001d9c:    f005fb55    ..U.    BL       reflect ; 0x800744a
        0x08001da0:    4604        .F      MOV      r4,r0
        0x08001da2:    2500        .%      MOVS     r5,#0
        0x08001da4:    f8df803c    ..<.    LDR      r8,[pc,#60] ; [0x8001de4] = 0x4c11db7
        0x08001da8:    e012        ..      B        0x8001dd0 ; crc32_continue + 64
        0x08001daa:    5d70        p]      LDRB     r0,[r6,r5]
        0x08001dac:    2108        .!      MOVS     r1,#8
        0x08001dae:    f005fb4c    ..L.    BL       reflect ; 0x800744a
        0x08001db2:    ea846400    ...d    EOR      r4,r4,r0,LSL #24
        0x08001db6:    2008        .       MOVS     r0,#8
        0x08001db8:    4641        AF      MOV      r1,r8
        0x08001dba:    2c00        .,      CMP      r4,#0
        0x08001dbc:    da02        ..      BGE      0x8001dc4 ; crc32_continue + 52
        0x08001dbe:    ea810444    ..D.    EOR      r4,r1,r4,LSL #1
        0x08001dc2:    e000        ..      B        0x8001dc6 ; crc32_continue + 54
        0x08001dc4:    0064        d.      LSLS     r4,r4,#1
        0x08001dc6:    1e40        @.      SUBS     r0,r0,#1
        0x08001dc8:    f01000ff    ....    ANDS     r0,r0,#0xff
        0x08001dcc:    d1f5        ..      BNE      0x8001dba ; crc32_continue + 42
        0x08001dce:    1c6d        m.      ADDS     r5,r5,#1
        0x08001dd0:    42bd        .B      CMP      r5,r7
        0x08001dd2:    dbea        ..      BLT      0x8001daa ; crc32_continue + 26
        0x08001dd4:    2120         !      MOVS     r1,#0x20
        0x08001dd6:    4620         F      MOV      r0,r4
        0x08001dd8:    f005fb37    ..7.    BL       reflect ; 0x800744a
        0x08001ddc:    43c0        .C      MVNS     r0,r0
        0x08001dde:    e8bd81f0    ....    POP      {r4-r8,pc}
    $d
        0x08001de2:    0000        ..      DCW    0
        0x08001de4:    04c11db7    ....    DCD    79764919
    $t
    i.derive_mpi
    derive_mpi
        0x08001de8:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08001dec:    4605        .F      MOV      r5,r0
        0x08001dee:    6dc0        .m      LDR      r0,[r0,#0x5c]
        0x08001df0:    4617        .F      MOV      r7,r2
        0x08001df2:    1dc0        ..      ADDS     r0,r0,#7
        0x08001df4:    08c4        ..      LSRS     r4,r0,#3
        0x08001df6:    460e        .F      MOV      r6,r1
        0x08001df8:    42a3        .B      CMP      r3,r4
        0x08001dfa:    d800        ..      BHI      0x8001dfe ; derive_mpi + 22
        0x08001dfc:    461c        .F      MOV      r4,r3
        0x08001dfe:    4622        "F      MOV      r2,r4
        0x08001e00:    4639        9F      MOV      r1,r7
        0x08001e02:    4630        0F      MOV      r0,r6
        0x08001e04:    f004fcc5    ....    BL       mbedtls_mpi_read_binary ; 0x8006792
        0x08001e08:    0007        ..      MOVS     r7,r0
        0x08001e0a:    d118        ..      BNE      0x8001e3e ; derive_mpi + 86
        0x08001e0c:    6de8        .m      LDR      r0,[r5,#0x5c]
        0x08001e0e:    ebb00fc4    ....    CMP      r0,r4,LSL #3
        0x08001e12:    d206        ..      BCS      0x8001e22 ; derive_mpi + 58
        0x08001e14:    ebc001c4    ....    RSB      r1,r0,r4,LSL #3
        0x08001e18:    4630        0F      MOV      r0,r6
        0x08001e1a:    f004fea3    ....    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x08001e1e:    0007        ..      MOVS     r7,r0
        0x08001e20:    d10d        ..      BNE      0x8001e3e ; derive_mpi + 86
        0x08001e22:    f105014c    ..L.    ADD      r1,r5,#0x4c
        0x08001e26:    460c        .F      MOV      r4,r1
        0x08001e28:    4630        0F      MOV      r0,r6
        0x08001e2a:    f003ffa5    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08001e2e:    2800        .(      CMP      r0,#0
        0x08001e30:    db05        ..      BLT      0x8001e3e ; derive_mpi + 86
        0x08001e32:    4631        1F      MOV      r1,r6
        0x08001e34:    4622        "F      MOV      r2,r4
        0x08001e36:    4608        .F      MOV      r0,r1
        0x08001e38:    f004ff60    ..`.    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x08001e3c:    4607        .F      MOV      r7,r0
        0x08001e3e:    4638        8F      MOV      r0,r7
        0x08001e40:    e8bd81f0    ....    POP      {r4-r8,pc}
    i.ecdsa_verify_restartable
    ecdsa_verify_restartable
        0x08001e44:    e92d4ff0    -..O    PUSH     {r4-r11,lr}
        0x08001e48:    b09d        ..      SUB      sp,sp,#0x74
        0x08001e4a:    4605        .F      MOV      r5,r0
        0x08001e4c:    4699        .F      MOV      r9,r3
        0x08001e4e:    4614        .F      MOV      r4,r2
        0x08001e50:    468a        .F      MOV      r10,r1
        0x08001e52:    f10d0858    ..X.    ADD      r8,sp,#0x58
        0x08001e56:    af19        ..      ADD      r7,sp,#0x64
        0x08001e58:    a803        ..      ADD      r0,sp,#0xc
        0x08001e5a:    f8ddb09c    ....    LDR      r11,[sp,#0x9c]
        0x08001e5e:    f003f99b    ....    BL       mbedtls_ecp_point_init ; 0x8005198
        0x08001e62:    a813        ..      ADD      r0,sp,#0x4c
        0x08001e64:    f004fa88    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08001e68:    a810        ..      ADD      r0,sp,#0x40
        0x08001e6a:    f004fa85    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08001e6e:    a816        ..      ADD      r0,sp,#0x58
        0x08001e70:    f004fa82    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08001e74:    a819        ..      ADD      r0,sp,#0x64
        0x08001e76:    f004fa7f    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08001e7a:    6d68        hm      LDR      r0,[r5,#0x54]
        0x08001e7c:    b318        ..      CBZ      r0,0x8001ec6 ; ecdsa_verify_restartable + 130
        0x08001e7e:    2101        .!      MOVS     r1,#1
        0x08001e80:    9826        &.      LDR      r0,[sp,#0x98]
        0x08001e82:    f003ff61    ..a.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08001e86:    4e3b        ;N      LDR      r6,[pc,#236] ; [0x8001f74] = 0xffffb200
        0x08001e88:    2800        .(      CMP      r0,#0
        0x08001e8a:    db60        `.      BLT      0x8001f4e ; ecdsa_verify_restartable + 266
        0x08001e8c:    f105014c    ..L.    ADD      r1,r5,#0x4c
        0x08001e90:    910c        ..      STR      r1,[sp,#0x30]
        0x08001e92:    9826        &.      LDR      r0,[sp,#0x98]
        0x08001e94:    f003ff70    ..p.    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08001e98:    2800        .(      CMP      r0,#0
        0x08001e9a:    da58        X.      BGE      0x8001f4e ; ecdsa_verify_restartable + 266
        0x08001e9c:    2101        .!      MOVS     r1,#1
        0x08001e9e:    4658        XF      MOV      r0,r11
        0x08001ea0:    f003ff52    ..R.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08001ea4:    2800        .(      CMP      r0,#0
        0x08001ea6:    db52        R.      BLT      0x8001f4e ; ecdsa_verify_restartable + 266
        0x08001ea8:    4658        XF      MOV      r0,r11
        0x08001eaa:    990c        ..      LDR      r1,[sp,#0x30]
        0x08001eac:    f003ff64    ..d.    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08001eb0:    2800        .(      CMP      r0,#0
        0x08001eb2:    da4c        L.      BGE      0x8001f4e ; ecdsa_verify_restartable + 266
        0x08001eb4:    4623        #F      MOV      r3,r4
        0x08001eb6:    4652        RF      MOV      r2,r10
        0x08001eb8:    a913        ..      ADD      r1,sp,#0x4c
        0x08001eba:    4628        (F      MOV      r0,r5
        0x08001ebc:    f7ffff94    ....    BL       derive_mpi ; 0x8001de8
        0x08001ec0:    0004        ..      MOVS     r4,r0
        0x08001ec2:    d145        E.      BNE      0x8001f50 ; ecdsa_verify_restartable + 268
        0x08001ec4:    e003        ..      B        0x8001ece ; ecdsa_verify_restartable + 138
        0x08001ec6:    482c        ,H      LDR      r0,[pc,#176] ; [0x8001f78] = 0xffffb080
        0x08001ec8:    b01d        ..      ADD      sp,sp,#0x74
        0x08001eca:    e8bd8ff0    ....    POP      {r4-r11,pc}
        0x08001ece:    4659        YF      MOV      r1,r11
        0x08001ed0:    a810        ..      ADD      r0,sp,#0x40
        0x08001ed2:    9a0c        ..      LDR      r2,[sp,#0x30]
        0x08001ed4:    f004fa56    ..V.    BL       mbedtls_mpi_inv_mod ; 0x8006384
        0x08001ed8:    0004        ..      MOVS     r4,r0
        0x08001eda:    d139        9.      BNE      0x8001f50 ; ecdsa_verify_restartable + 268
        0x08001edc:    aa10        ..      ADD      r2,sp,#0x40
        0x08001ede:    a913        ..      ADD      r1,sp,#0x4c
        0x08001ee0:    4640        @F      MOV      r0,r8
        0x08001ee2:    f004fbf5    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08001ee6:    0004        ..      MOVS     r4,r0
        0x08001ee8:    d132        2.      BNE      0x8001f50 ; ecdsa_verify_restartable + 268
        0x08001eea:    4641        AF      MOV      r1,r8
        0x08001eec:    4608        .F      MOV      r0,r1
        0x08001eee:    9a0c        ..      LDR      r2,[sp,#0x30]
        0x08001ef0:    f004fbb1    ....    BL       mbedtls_mpi_mod_mpi ; 0x8006656
        0x08001ef4:    0004        ..      MOVS     r4,r0
        0x08001ef6:    d12b        +.      BNE      0x8001f50 ; ecdsa_verify_restartable + 268
        0x08001ef8:    aa10        ..      ADD      r2,sp,#0x40
        0x08001efa:    4638        8F      MOV      r0,r7
        0x08001efc:    9926        &.      LDR      r1,[sp,#0x98]
        0x08001efe:    f004fbe7    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08001f02:    0004        ..      MOVS     r4,r0
        0x08001f04:    d124        $.      BNE      0x8001f50 ; ecdsa_verify_restartable + 268
        0x08001f06:    4639        9F      MOV      r1,r7
        0x08001f08:    4608        .F      MOV      r0,r1
        0x08001f0a:    9a0c        ..      LDR      r2,[sp,#0x30]
        0x08001f0c:    f004fba3    ....    BL       mbedtls_mpi_mod_mpi ; 0x8006656
        0x08001f10:    0004        ..      MOVS     r4,r0
        0x08001f12:    d11d        ..      BNE      0x8001f50 ; ecdsa_verify_restartable + 268
        0x08001f14:    2100        .!      MOVS     r1,#0
        0x08001f16:    9700        ..      STR      r7,[sp,#0]
        0x08001f18:    e9cd9101    ....    STRD     r9,r1,[sp,#4]
        0x08001f1c:    f1050328    ..(.    ADD      r3,r5,#0x28
        0x08001f20:    4642        BF      MOV      r2,r8
        0x08001f22:    a903        ..      ADD      r1,sp,#0xc
        0x08001f24:    4628        (F      MOV      r0,r5
        0x08001f26:    f003f8e9    ....    BL       mbedtls_ecp_muladd_restartable ; 0x80050fc
        0x08001f2a:    0004        ..      MOVS     r4,r0
        0x08001f2c:    d110        ..      BNE      0x8001f50 ; ecdsa_verify_restartable + 268
        0x08001f2e:    a803        ..      ADD      r0,sp,#0xc
        0x08001f30:    f003f84a    ..J.    BL       mbedtls_ecp_is_zero ; 0x8004fc8
        0x08001f34:    b958        X.      CBNZ     r0,0x8001f4e ; ecdsa_verify_restartable + 266
        0x08001f36:    a903        ..      ADD      r1,sp,#0xc
        0x08001f38:    4608        .F      MOV      r0,r1
        0x08001f3a:    9a0c        ..      LDR      r2,[sp,#0x30]
        0x08001f3c:    f004fb8b    ....    BL       mbedtls_mpi_mod_mpi ; 0x8006656
        0x08001f40:    0004        ..      MOVS     r4,r0
        0x08001f42:    d105        ..      BNE      0x8001f50 ; ecdsa_verify_restartable + 268
        0x08001f44:    a803        ..      ADD      r0,sp,#0xc
        0x08001f46:    9926        &.      LDR      r1,[sp,#0x98]
        0x08001f48:    f003ff16    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08001f4c:    b100        ..      CBZ      r0,0x8001f50 ; ecdsa_verify_restartable + 268
        0x08001f4e:    4634        4F      MOV      r4,r6
        0x08001f50:    a803        ..      ADD      r0,sp,#0xc
        0x08001f52:    f003f911    ....    BL       mbedtls_ecp_point_free ; 0x8005178
        0x08001f56:    a813        ..      ADD      r0,sp,#0x4c
        0x08001f58:    f004f945    ..E.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08001f5c:    a810        ..      ADD      r0,sp,#0x40
        0x08001f5e:    f004f942    ..B.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08001f62:    a816        ..      ADD      r0,sp,#0x58
        0x08001f64:    f004f93f    ..?.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08001f68:    a819        ..      ADD      r0,sp,#0x64
        0x08001f6a:    f004f93c    ..<.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08001f6e:    4620         F      MOV      r0,r4
        0x08001f70:    e7aa        ..      B        0x8001ec8 ; ecdsa_verify_restartable + 132
    $d
        0x08001f72:    0000        ..      DCW    0
        0x08001f74:    ffffb200    ....    DCD    4294947328
        0x08001f78:    ffffb080    ....    DCD    4294946944
    $t
    i.ecp_comb_recode_core
    ecp_comb_recode_core
        0x08001f7c:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x08001f80:    460d        .F      MOV      r5,r1
        0x08001f82:    4699        .F      MOV      r9,r3
        0x08001f84:    4690        .F      MOV      r8,r2
        0x08001f86:    4604        .F      MOV      r4,r0
        0x08001f88:    1c49        I.      ADDS     r1,r1,#1
        0x08001f8a:    f7fefac5    ....    BL       __aeabi_memclr ; 0x8000518
        0x08001f8e:    2600        .&      MOVS     r6,#0
        0x08001f90:    e00f        ..      B        0x8001fb2 ; ecp_comb_recode_core + 54
        0x08001f92:    2700        .'      MOVS     r7,#0
        0x08001f94:    e00a        ..      B        0x8001fac ; ecp_comb_recode_core + 48
        0x08001f96:    bf00        ..      NOP      
        0x08001f98:    fb056107    ...a    MLA      r1,r5,r7,r6
        0x08001f9c:    4648        HF      MOV      r0,r9
        0x08001f9e:    f004f9b3    ....    BL       mbedtls_mpi_get_bit ; 0x8006308
        0x08001fa2:    5da1        .]      LDRB     r1,[r4,r6]
        0x08001fa4:    40b8        .@      LSLS     r0,r0,r7
        0x08001fa6:    4308        .C      ORRS     r0,r0,r1
        0x08001fa8:    55a0        .U      STRB     r0,[r4,r6]
        0x08001faa:    1c7f        ..      ADDS     r7,r7,#1
        0x08001fac:    4547        GE      CMP      r7,r8
        0x08001fae:    d3f3        ..      BCC      0x8001f98 ; ecp_comb_recode_core + 28
        0x08001fb0:    1c76        v.      ADDS     r6,r6,#1
        0x08001fb2:    42ae        .B      CMP      r6,r5
        0x08001fb4:    d3ed        ..      BCC      0x8001f92 ; ecp_comb_recode_core + 22
        0x08001fb6:    2200        ."      MOVS     r2,#0
        0x08001fb8:    2101        .!      MOVS     r1,#1
        0x08001fba:    e018        ..      B        0x8001fee ; ecp_comb_recode_core + 114
        0x08001fbc:    5c60        `\      LDRB     r0,[r4,r1]
        0x08001fbe:    eb040801    ....    ADD      r8,r4,r1
        0x08001fc2:    4603        .F      MOV      r3,r0
        0x08001fc4:    4010        .@      ANDS     r0,r0,r2
        0x08001fc6:    4053        S@      EORS     r3,r3,r2
        0x08001fc8:    f8186c01    ...l    LDRB     r6,[r8,#-1]
        0x08001fcc:    f0030201    ....    AND      r2,r3,#1
        0x08001fd0:    f1c20c01    ....    RSB      r12,r2,#1
        0x08001fd4:    4637        7F      MOV      r7,r6
        0x08001fd6:    fb06f60c    ....    MUL      r6,r6,r12
        0x08001fda:    ea030206    ....    AND      r2,r3,r6
        0x08001fde:    4302        .C      ORRS     r2,r2,r0
        0x08001fe0:    4073        s@      EORS     r3,r3,r6
        0x08001fe2:    5463        cT      STRB     r3,[r4,r1]
        0x08001fe4:    ea4710cc    G...    ORR      r0,r7,r12,LSL #7
        0x08001fe8:    f8080c01    ....    STRB     r0,[r8,#-1]
        0x08001fec:    1c49        I.      ADDS     r1,r1,#1
        0x08001fee:    42a9        .B      CMP      r1,r5
        0x08001ff0:    d9e4        ..      BLS      0x8001fbc ; ecp_comb_recode_core + 64
        0x08001ff2:    e8bd87f0    ....    POP      {r4-r10,pc}
    i.mbedtls_ecdsa_init
    mbedtls_ecdsa_init
        0x08001ff6:    f003b801    ....    B.W      mbedtls_ecp_keypair_init ; 0x8004ffc
    i.mbedtls_mpi_zeroize
    mbedtls_mpi_zeroize
        0x08001ffa:    0089        ..      LSLS     r1,r1,#2
        0x08001ffc:    f004bea6    ....    B.W      mbedtls_platform_zeroize ; 0x8006d4c
    $d.realdata
    .ARM.__AT_0x08002000
    m_signature_data
        0x08002000:    00000000    ....    DCD    0
        0x08002004:    00000000    ....    DCD    0
        0x08002008:    00000000    ....    DCD    0
        0x0800200c:    00000000    ....    DCD    0
        0x08002010:    00000000    ....    DCD    0
        0x08002014:    00000000    ....    DCD    0
        0x08002018:    00000000    ....    DCD    0
        0x0800201c:    00000000    ....    DCD    0
        0x08002020:    00000000    ....    DCD    0
        0x08002024:    00000000    ....    DCD    0
        0x08002028:    00000000    ....    DCD    0
        0x0800202c:    00000000    ....    DCD    0
        0x08002030:    00000000    ....    DCD    0
        0x08002034:    00000000    ....    DCD    0
        0x08002038:    00000000    ....    DCD    0
        0x0800203c:    00000000    ....    DCD    0
        0x08002040:    00000000    ....    DCD    0
        0x08002044:    00000000    ....    DCD    0
        0x08002048:    00000000    ....    DCD    0
        0x0800204c:    00000000    ....    DCD    0
        0x08002050:    00000000    ....    DCD    0
        0x08002054:    00000000    ....    DCD    0
        0x08002058:    00000000    ....    DCD    0
        0x0800205c:    00000000    ....    DCD    0
        0x08002060:    00000000    ....    DCD    0
        0x08002064:    00000000    ....    DCD    0
        0x08002068:    00000000    ....    DCD    0
        0x0800206c:    00000000    ....    DCD    0
        0x08002070:    00000000    ....    DCD    0
        0x08002074:    00000000    ....    DCD    0
        0x08002078:    00000000    ....    DCD    0
        0x0800207c:    00000000    ....    DCD    0
        0x08002080:    00000000    ....    DCD    0
        0x08002084:    00000000    ....    DCD    0
        0x08002088:    00000000    ....    DCD    0
        0x0800208c:    00000000    ....    DCD    0
    $t
    i.ecp_mod_p192k1
    ecp_mod_p192k1
        0x08002090:    b51c        ..      PUSH     {r2-r4,lr}
        0x08002092:    2100        .!      MOVS     r1,#0
        0x08002094:    9100        ..      STR      r1,[sp,#0]
        0x08002096:    460b        .F      MOV      r3,r1
        0x08002098:    9101        ..      STR      r1,[sp,#4]
        0x0800209a:    2206        ."      MOVS     r2,#6
        0x0800209c:    4901        .I      LDR      r1,[pc,#4] ; [0x80020a4] = 0x20000024
        0x0800209e:    f000fe43    ..C.    BL       ecp_mod_koblitz ; 0x8002d28
        0x080020a2:    bd1c        ..      POP      {r2-r4,pc}
    $d
        0x080020a4:    20000024    $..     DCD    536870948
    $t
    i.ecp_mod_p224k1
    ecp_mod_p224k1
        0x080020a8:    b51c        ..      PUSH     {r2-r4,lr}
        0x080020aa:    2100        .!      MOVS     r1,#0
        0x080020ac:    9100        ..      STR      r1,[sp,#0]
        0x080020ae:    460b        .F      MOV      r3,r1
        0x080020b0:    9101        ..      STR      r1,[sp,#4]
        0x080020b2:    2207        ."      MOVS     r2,#7
        0x080020b4:    4901        .I      LDR      r1,[pc,#4] ; [0x80020bc] = 0x2000002c
        0x080020b6:    f000fe37    ..7.    BL       ecp_mod_koblitz ; 0x8002d28
        0x080020ba:    bd1c        ..      POP      {r2-r4,pc}
    $d
        0x080020bc:    2000002c    ,..     DCD    536870956
    $t
    i.ecp_mpi_load
    ecp_mpi_load
        0x080020c0:    2301        .#      MOVS     r3,#1
        0x080020c2:    0892        ..      LSRS     r2,r2,#2
        0x080020c4:    6003        .`      STR      r3,[r0,#0]
        0x080020c6:    e9c02101    ...!    STRD     r2,r1,[r0,#4]
        0x080020ca:    4770        pG      BX       lr
    i.ecp_add_mixed
    ecp_add_mixed
        0x080020cc:    e92d43f0    -..C    PUSH     {r4-r9,lr}
        0x080020d0:    4605        .F      MOV      r5,r0
        0x080020d2:    4688        .F      MOV      r8,r1
