openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x080020d4:    f1020018    ....    ADD      r0,r2,#0x18
        0x080020d8:    b095        ..      SUB      sp,sp,#0x54
        0x080020da:    461e        .F      MOV      r6,r3
        0x080020dc:    4617        .F      MOV      r7,r2
        0x080020de:    2100        .!      MOVS     r1,#0
        0x080020e0:    4681        .F      MOV      r9,r0
        0x080020e2:    f003fe31    ..1.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080020e6:    b198        ..      CBZ      r0,0x8002110 ; ecp_add_mixed + 68
        0x080020e8:    6a30        0j      LDR      r0,[r6,#0x20]
        0x080020ea:    b1c0        ..      CBZ      r0,0x800211e ; ecp_add_mixed + 82
        0x080020ec:    f1060018    ....    ADD      r0,r6,#0x18
        0x080020f0:    2100        .!      MOVS     r1,#0
        0x080020f2:    4604        .F      MOV      r4,r0
        0x080020f4:    f003fe28    ..(.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080020f8:    b160        `.      CBZ      r0,0x8002114 ; ecp_add_mixed + 72
        0x080020fa:    6a30        0j      LDR      r0,[r6,#0x20]
        0x080020fc:    b178        x.      CBZ      r0,0x800211e ; ecp_add_mixed + 82
        0x080020fe:    2101        .!      MOVS     r1,#1
        0x08002100:    4620         F      MOV      r0,r4
        0x08002102:    f003fe21    ..!.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08002106:    b150        P.      CBZ      r0,0x800211e ; ecp_add_mixed + 82
        0x08002108:    48c5        .H      LDR      r0,[pc,#788] ; [0x8002420] = 0xffffb080
        0x0800210a:    b015        ..      ADD      sp,sp,#0x54
        0x0800210c:    e8bd83f0    ....    POP      {r4-r9,pc}
        0x08002110:    4631        1F      MOV      r1,r6
        0x08002112:    e000        ..      B        0x8002116 ; ecp_add_mixed + 74
        0x08002114:    4639        9F      MOV      r1,r7
        0x08002116:    4640        @F      MOV      r0,r8
        0x08002118:    f002fd96    ....    BL       mbedtls_ecp_copy ; 0x8004c48
        0x0800211c:    e7f5        ..      B        0x800210a ; ecp_add_mixed + 62
        0x0800211e:    4668        hF      MOV      r0,sp
        0x08002120:    f004f92a    ..*.    BL       mbedtls_mpi_init ; 0x8006378
        0x08002124:    a809        ..      ADD      r0,sp,#0x24
        0x08002126:    f004f927    ..'.    BL       mbedtls_mpi_init ; 0x8006378
        0x0800212a:    a803        ..      ADD      r0,sp,#0xc
        0x0800212c:    f004f924    ..$.    BL       mbedtls_mpi_init ; 0x8006378
        0x08002130:    a80f        ..      ADD      r0,sp,#0x3c
        0x08002132:    f004f921    ..!.    BL       mbedtls_mpi_init ; 0x8006378
        0x08002136:    a806        ..      ADD      r0,sp,#0x18
        0x08002138:    f004f91e    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x0800213c:    a80c        ..      ADD      r0,sp,#0x30
        0x0800213e:    f004f91b    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08002142:    a812        ..      ADD      r0,sp,#0x48
        0x08002144:    f004f918    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08002148:    464a        JF      MOV      r2,r9
        0x0800214a:    4611        .F      MOV      r1,r2
        0x0800214c:    4668        hF      MOV      r0,sp
        0x0800214e:    f004fabf    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002152:    0004        ..      MOVS     r4,r0
        0x08002154:    d171        q.      BNE      0x800223a ; ecp_add_mixed + 366
        0x08002156:    4629        )F      MOV      r1,r5
        0x08002158:    4668        hF      MOV      r0,sp
        0x0800215a:    f001fdb5    ....    BL       ecp_modp ; 0x8003cc8
        0x0800215e:    0004        ..      MOVS     r4,r0
        0x08002160:    d1f8        ..      BNE      0x8002154 ; ecp_add_mixed + 136
        0x08002162:    464a        JF      MOV      r2,r9
        0x08002164:    4669        iF      MOV      r1,sp
        0x08002166:    a809        ..      ADD      r0,sp,#0x24
        0x08002168:    f004fab2    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x0800216c:    0004        ..      MOVS     r4,r0
        0x0800216e:    d1f1        ..      BNE      0x8002154 ; ecp_add_mixed + 136
        0x08002170:    4629        )F      MOV      r1,r5
        0x08002172:    a809        ..      ADD      r0,sp,#0x24
        0x08002174:    f001fda8    ....    BL       ecp_modp ; 0x8003cc8
        0x08002178:    0004        ..      MOVS     r4,r0
        0x0800217a:    d1eb        ..      BNE      0x8002154 ; ecp_add_mixed + 136
        0x0800217c:    4669        iF      MOV      r1,sp
        0x0800217e:    4632        2F      MOV      r2,r6
        0x08002180:    4608        .F      MOV      r0,r1
        0x08002182:    f004faa5    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002186:    0004        ..      MOVS     r4,r0
        0x08002188:    d1e4        ..      BNE      0x8002154 ; ecp_add_mixed + 136
        0x0800218a:    4629        )F      MOV      r1,r5
        0x0800218c:    4668        hF      MOV      r0,sp
        0x0800218e:    f001fd9b    ....    BL       ecp_modp ; 0x8003cc8
        0x08002192:    0004        ..      MOVS     r4,r0
        0x08002194:    d1de        ..      BNE      0x8002154 ; ecp_add_mixed + 136
        0x08002196:    a909        ..      ADD      r1,sp,#0x24
        0x08002198:    f106020c    ....    ADD      r2,r6,#0xc
        0x0800219c:    4608        .F      MOV      r0,r1
        0x0800219e:    f004fa97    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x080021a2:    0004        ..      MOVS     r4,r0
        0x080021a4:    d1d6        ..      BNE      0x8002154 ; ecp_add_mixed + 136
        0x080021a6:    4629        )F      MOV      r1,r5
        0x080021a8:    a809        ..      ADD      r0,sp,#0x24
        0x080021aa:    f001fd8d    ....    BL       ecp_modp ; 0x8003cc8
        0x080021ae:    0004        ..      MOVS     r4,r0
        0x080021b0:    d1d0        ..      BNE      0x8002154 ; ecp_add_mixed + 136
        0x080021b2:    4669        iF      MOV      r1,sp
        0x080021b4:    463a        :F      MOV      r2,r7
        0x080021b6:    4608        .F      MOV      r0,r1
        0x080021b8:    f004fda0    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x080021bc:    e004        ..      B        0x80021c8 ; ecp_add_mixed + 252
        0x080021be:    4669        iF      MOV      r1,sp
        0x080021c0:    1d2a        *.      ADDS     r2,r5,#4
        0x080021c2:    4608        .F      MOV      r0,r1
        0x080021c4:    f003fd48    ..H.    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x080021c8:    0004        ..      MOVS     r4,r0
        0x080021ca:    d1c3        ..      BNE      0x8002154 ; ecp_add_mixed + 136
        0x080021cc:    9800        ..      LDR      r0,[sp,#0]
        0x080021ce:    2800        .(      CMP      r0,#0
        0x080021d0:    da05        ..      BGE      0x80021de ; ecp_add_mixed + 274
        0x080021d2:    2100        .!      MOVS     r1,#0
        0x080021d4:    4668        hF      MOV      r0,sp
        0x080021d6:    f003fdb7    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080021da:    2800        .(      CMP      r0,#0
        0x080021dc:    d1ef        ..      BNE      0x80021be ; ecp_add_mixed + 242
        0x080021de:    f107020c    ....    ADD      r2,r7,#0xc
        0x080021e2:    a909        ..      ADD      r1,sp,#0x24
        0x080021e4:    4616        .F      MOV      r6,r2
        0x080021e6:    4608        .F      MOV      r0,r1
        0x080021e8:    f004fd88    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x080021ec:    e004        ..      B        0x80021f8 ; ecp_add_mixed + 300
        0x080021ee:    a909        ..      ADD      r1,sp,#0x24
        0x080021f0:    1d2a        *.      ADDS     r2,r5,#4
        0x080021f2:    4608        .F      MOV      r0,r1
        0x080021f4:    f003fd30    ..0.    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x080021f8:    0004        ..      MOVS     r4,r0
        0x080021fa:    d1ab        ..      BNE      0x8002154 ; ecp_add_mixed + 136
        0x080021fc:    9809        ..      LDR      r0,[sp,#0x24]
        0x080021fe:    2800        .(      CMP      r0,#0
        0x08002200:    da05        ..      BGE      0x800220e ; ecp_add_mixed + 322
        0x08002202:    2100        .!      MOVS     r1,#0
        0x08002204:    a809        ..      ADD      r0,sp,#0x24
        0x08002206:    f003fd9f    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x0800220a:    2800        .(      CMP      r0,#0
        0x0800220c:    d1ef        ..      BNE      0x80021ee ; ecp_add_mixed + 290
        0x0800220e:    2100        .!      MOVS     r1,#0
        0x08002210:    4668        hF      MOV      r0,sp
        0x08002212:    f003fd99    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08002216:    b138        8.      CBZ      r0,0x8002228 ; ecp_add_mixed + 348
        0x08002218:    466a        jF      MOV      r2,sp
        0x0800221a:    4649        IF      MOV      r1,r9
        0x0800221c:    a812        ..      ADD      r0,sp,#0x48
        0x0800221e:    f004fa57    ..W.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002222:    0004        ..      MOVS     r4,r0
        0x08002224:    d196        ..      BNE      0x8002154 ; ecp_add_mixed + 136
        0x08002226:    e00f        ..      B        0x8002248 ; ecp_add_mixed + 380
        0x08002228:    2100        .!      MOVS     r1,#0
        0x0800222a:    a809        ..      ADD      r0,sp,#0x24
        0x0800222c:    f003fd8c    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08002230:    b120         .      CBZ      r0,0x800223c ; ecp_add_mixed + 368
        0x08002232:    4640        @F      MOV      r0,r8
        0x08002234:    f003f834    ..4.    BL       mbedtls_ecp_set_zero ; 0x80052a0
        0x08002238:    e0d9        ..      B        0x80023ee ; ecp_add_mixed + 802
        0x0800223a:    e097        ..      B        0x800236c ; ecp_add_mixed + 672
        0x0800223c:    463a        :F      MOV      r2,r7
        0x0800223e:    4641        AF      MOV      r1,r8
        0x08002240:    4628        (F      MOV      r0,r5
        0x08002242:    f000fb47    ..G.    BL       ecp_double_jac ; 0x80028d4
        0x08002246:    e0d2        ..      B        0x80023ee ; ecp_add_mixed + 802
        0x08002248:    4629        )F      MOV      r1,r5
        0x0800224a:    a812        ..      ADD      r0,sp,#0x48
        0x0800224c:    f001fd3c    ..<.    BL       ecp_modp ; 0x8003cc8
        0x08002250:    0004        ..      MOVS     r4,r0
        0x08002252:    d185        ..      BNE      0x8002160 ; ecp_add_mixed + 148
        0x08002254:    466a        jF      MOV      r2,sp
        0x08002256:    4611        .F      MOV      r1,r2
        0x08002258:    a803        ..      ADD      r0,sp,#0xc
        0x0800225a:    f004fa39    ..9.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x0800225e:    0004        ..      MOVS     r4,r0
        0x08002260:    d185        ..      BNE      0x800216e ; ecp_add_mixed + 162
        0x08002262:    4629        )F      MOV      r1,r5
        0x08002264:    a803        ..      ADD      r0,sp,#0xc
        0x08002266:    f001fd2f    ../.    BL       ecp_modp ; 0x8003cc8
        0x0800226a:    0004        ..      MOVS     r4,r0
        0x0800226c:    d17e        ~.      BNE      0x800236c ; ecp_add_mixed + 672
        0x0800226e:    466a        jF      MOV      r2,sp
        0x08002270:    a903        ..      ADD      r1,sp,#0xc
        0x08002272:    a80f        ..      ADD      r0,sp,#0x3c
        0x08002274:    f004fa2c    ..,.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002278:    0004        ..      MOVS     r4,r0
        0x0800227a:    d177        w.      BNE      0x800236c ; ecp_add_mixed + 672
        0x0800227c:    4629        )F      MOV      r1,r5
        0x0800227e:    a80f        ..      ADD      r0,sp,#0x3c
        0x08002280:    f001fd22    ..".    BL       ecp_modp ; 0x8003cc8
        0x08002284:    0004        ..      MOVS     r4,r0
        0x08002286:    d171        q.      BNE      0x800236c ; ecp_add_mixed + 672
        0x08002288:    a903        ..      ADD      r1,sp,#0xc
        0x0800228a:    463a        :F      MOV      r2,r7
        0x0800228c:    4608        .F      MOV      r0,r1
        0x0800228e:    f004fa1f    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002292:    0004        ..      MOVS     r4,r0
        0x08002294:    d16a        j.      BNE      0x800236c ; ecp_add_mixed + 672
        0x08002296:    4629        )F      MOV      r1,r5
        0x08002298:    a803        ..      ADD      r0,sp,#0xc
        0x0800229a:    f001fd15    ....    BL       ecp_modp ; 0x8003cc8
        0x0800229e:    0004        ..      MOVS     r4,r0
        0x080022a0:    d164        d.      BNE      0x800236c ; ecp_add_mixed + 672
        0x080022a2:    2202        ."      MOVS     r2,#2
        0x080022a4:    a903        ..      ADD      r1,sp,#0xc
        0x080022a6:    4668        hF      MOV      r0,sp
        0x080022a8:    f004fa06    ....    BL       mbedtls_mpi_mul_int ; 0x80066b8
        0x080022ac:    e004        ..      B        0x80022b8 ; ecp_add_mixed + 492
        0x080022ae:    4669        iF      MOV      r1,sp
        0x080022b0:    1d2a        *.      ADDS     r2,r5,#4
        0x080022b2:    4608        .F      MOV      r0,r1
        0x080022b4:    f004fcd3    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x080022b8:    0004        ..      MOVS     r4,r0
        0x080022ba:    d157        W.      BNE      0x800236c ; ecp_add_mixed + 672
        0x080022bc:    1d29        ).      ADDS     r1,r5,#4
        0x080022be:    4668        hF      MOV      r0,sp
        0x080022c0:    f003fd5a    ..Z.    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x080022c4:    2800        .(      CMP      r0,#0
        0x080022c6:    daf2        ..      BGE      0x80022ae ; ecp_add_mixed + 482
        0x080022c8:    aa09        ..      ADD      r2,sp,#0x24
        0x080022ca:    4611        .F      MOV      r1,r2
        0x080022cc:    a806        ..      ADD      r0,sp,#0x18
        0x080022ce:    f004f9ff    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x080022d2:    0004        ..      MOVS     r4,r0
        0x080022d4:    d14a        J.      BNE      0x800236c ; ecp_add_mixed + 672
        0x080022d6:    4629        )F      MOV      r1,r5
        0x080022d8:    a806        ..      ADD      r0,sp,#0x18
        0x080022da:    f001fcf5    ....    BL       ecp_modp ; 0x8003cc8
        0x080022de:    0004        ..      MOVS     r4,r0
        0x080022e0:    d144        D.      BNE      0x800236c ; ecp_add_mixed + 672
        0x080022e2:    a906        ..      ADD      r1,sp,#0x18
        0x080022e4:    466a        jF      MOV      r2,sp
        0x080022e6:    4608        .F      MOV      r0,r1
        0x080022e8:    f004fd08    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x080022ec:    e004        ..      B        0x80022f8 ; ecp_add_mixed + 556
        0x080022ee:    a906        ..      ADD      r1,sp,#0x18
        0x080022f0:    1d2a        *.      ADDS     r2,r5,#4
        0x080022f2:    4608        .F      MOV      r0,r1
        0x080022f4:    f003fcb0    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x080022f8:    0004        ..      MOVS     r4,r0
        0x080022fa:    d179        y.      BNE      0x80023f0 ; ecp_add_mixed + 804
        0x080022fc:    9806        ..      LDR      r0,[sp,#0x18]
        0x080022fe:    2800        .(      CMP      r0,#0
        0x08002300:    da05        ..      BGE      0x800230e ; ecp_add_mixed + 578
        0x08002302:    2100        .!      MOVS     r1,#0
        0x08002304:    a806        ..      ADD      r0,sp,#0x18
        0x08002306:    f003fd1f    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x0800230a:    2800        .(      CMP      r0,#0
        0x0800230c:    d1ef        ..      BNE      0x80022ee ; ecp_add_mixed + 546
        0x0800230e:    a906        ..      ADD      r1,sp,#0x18
        0x08002310:    aa0f        ..      ADD      r2,sp,#0x3c
        0x08002312:    4608        .F      MOV      r0,r1
        0x08002314:    f004fcf2    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x08002318:    e004        ..      B        0x8002324 ; ecp_add_mixed + 600
        0x0800231a:    a906        ..      ADD      r1,sp,#0x18
        0x0800231c:    1d2a        *.      ADDS     r2,r5,#4
        0x0800231e:    4608        .F      MOV      r0,r1
        0x08002320:    f003fc9a    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08002324:    0004        ..      MOVS     r4,r0
        0x08002326:    d163        c.      BNE      0x80023f0 ; ecp_add_mixed + 804
        0x08002328:    9806        ..      LDR      r0,[sp,#0x18]
        0x0800232a:    2800        .(      CMP      r0,#0
        0x0800232c:    da05        ..      BGE      0x800233a ; ecp_add_mixed + 622
        0x0800232e:    2100        .!      MOVS     r1,#0
        0x08002330:    a806        ..      ADD      r0,sp,#0x18
        0x08002332:    f003fd09    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08002336:    2800        .(      CMP      r0,#0
        0x08002338:    d1ef        ..      BNE      0x800231a ; ecp_add_mixed + 590
        0x0800233a:    a903        ..      ADD      r1,sp,#0xc
        0x0800233c:    aa06        ..      ADD      r2,sp,#0x18
        0x0800233e:    4608        .F      MOV      r0,r1
        0x08002340:    f004fcdc    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x08002344:    e004        ..      B        0x8002350 ; ecp_add_mixed + 644
        0x08002346:    a903        ..      ADD      r1,sp,#0xc
        0x08002348:    1d2a        *.      ADDS     r2,r5,#4
        0x0800234a:    4608        .F      MOV      r0,r1
        0x0800234c:    f003fc84    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08002350:    0004        ..      MOVS     r4,r0
        0x08002352:    d14d        M.      BNE      0x80023f0 ; ecp_add_mixed + 804
        0x08002354:    9803        ..      LDR      r0,[sp,#0xc]
        0x08002356:    2800        .(      CMP      r0,#0
        0x08002358:    da05        ..      BGE      0x8002366 ; ecp_add_mixed + 666
        0x0800235a:    2100        .!      MOVS     r1,#0
        0x0800235c:    a803        ..      ADD      r0,sp,#0xc
        0x0800235e:    f003fcf3    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08002362:    2800        .(      CMP      r0,#0
        0x08002364:    d1ef        ..      BNE      0x8002346 ; ecp_add_mixed + 634
        0x08002366:    aa09        ..      ADD      r2,sp,#0x24
        0x08002368:    a903        ..      ADD      r1,sp,#0xc
        0x0800236a:    e000        ..      B        0x800236e ; ecp_add_mixed + 674
        0x0800236c:    e040        @.      B        0x80023f0 ; ecp_add_mixed + 804
        0x0800236e:    4608        .F      MOV      r0,r1
        0x08002370:    f004f9ae    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002374:    0004        ..      MOVS     r4,r0
        0x08002376:    d13b        ;.      BNE      0x80023f0 ; ecp_add_mixed + 804
        0x08002378:    4629        )F      MOV      r1,r5
        0x0800237a:    a803        ..      ADD      r0,sp,#0xc
        0x0800237c:    f001fca4    ....    BL       ecp_modp ; 0x8003cc8
        0x08002380:    0004        ..      MOVS     r4,r0
        0x08002382:    d135        5.      BNE      0x80023f0 ; ecp_add_mixed + 804
        0x08002384:    a90f        ..      ADD      r1,sp,#0x3c
        0x08002386:    4632        2F      MOV      r2,r6
        0x08002388:    4608        .F      MOV      r0,r1
        0x0800238a:    f004f9a1    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x0800238e:    0004        ..      MOVS     r4,r0
        0x08002390:    d12e        ..      BNE      0x80023f0 ; ecp_add_mixed + 804
        0x08002392:    4629        )F      MOV      r1,r5
        0x08002394:    a80f        ..      ADD      r0,sp,#0x3c
        0x08002396:    f001fc97    ....    BL       ecp_modp ; 0x8003cc8
        0x0800239a:    0004        ..      MOVS     r4,r0
        0x0800239c:    d128        (.      BNE      0x80023f0 ; ecp_add_mixed + 804
        0x0800239e:    aa0f        ..      ADD      r2,sp,#0x3c
        0x080023a0:    a903        ..      ADD      r1,sp,#0xc
        0x080023a2:    a80c        ..      ADD      r0,sp,#0x30
        0x080023a4:    f004fcaa    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x080023a8:    e004        ..      B        0x80023b4 ; ecp_add_mixed + 744
        0x080023aa:    a90c        ..      ADD      r1,sp,#0x30
        0x080023ac:    1d2a        *.      ADDS     r2,r5,#4
        0x080023ae:    4608        .F      MOV      r0,r1
        0x080023b0:    f003fc52    ..R.    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x080023b4:    0004        ..      MOVS     r4,r0
        0x080023b6:    d11b        ..      BNE      0x80023f0 ; ecp_add_mixed + 804
        0x080023b8:    980c        ..      LDR      r0,[sp,#0x30]
        0x080023ba:    2800        .(      CMP      r0,#0
        0x080023bc:    da05        ..      BGE      0x80023ca ; ecp_add_mixed + 766
        0x080023be:    2100        .!      MOVS     r1,#0
        0x080023c0:    a80c        ..      ADD      r0,sp,#0x30
        0x080023c2:    f003fcc1    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080023c6:    2800        .(      CMP      r0,#0
        0x080023c8:    d1ef        ..      BNE      0x80023aa ; ecp_add_mixed + 734
        0x080023ca:    a906        ..      ADD      r1,sp,#0x18
        0x080023cc:    4640        @F      MOV      r0,r8
        0x080023ce:    f003fd19    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x080023d2:    0004        ..      MOVS     r4,r0
        0x080023d4:    d10c        ..      BNE      0x80023f0 ; ecp_add_mixed + 804
        0x080023d6:    a90c        ..      ADD      r1,sp,#0x30
        0x080023d8:    f108000c    ....    ADD      r0,r8,#0xc
        0x080023dc:    f003fd12    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x080023e0:    0004        ..      MOVS     r4,r0
        0x080023e2:    d105        ..      BNE      0x80023f0 ; ecp_add_mixed + 804
        0x080023e4:    a912        ..      ADD      r1,sp,#0x48
        0x080023e6:    f1080018    ....    ADD      r0,r8,#0x18
        0x080023ea:    f003fd0b    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x080023ee:    4604        .F      MOV      r4,r0
        0x080023f0:    4668        hF      MOV      r0,sp
        0x080023f2:    f003fef8    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080023f6:    a809        ..      ADD      r0,sp,#0x24
        0x080023f8:    f003fef5    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080023fc:    a803        ..      ADD      r0,sp,#0xc
        0x080023fe:    f003fef2    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08002402:    a80f        ..      ADD      r0,sp,#0x3c
        0x08002404:    f003feef    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08002408:    a806        ..      ADD      r0,sp,#0x18
        0x0800240a:    f003feec    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x0800240e:    a80c        ..      ADD      r0,sp,#0x30
        0x08002410:    f003fee9    ....    BL       mbedtls_mpi_free ; 0x80061e6
