openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08002414:    a812        ..      ADD      r0,sp,#0x48
        0x08002416:    f003fee6    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x0800241a:    4620         F      MOV      r0,r4
        0x0800241c:    e675        u.      B        0x800210a ; ecp_add_mixed + 62
    $d
        0x0800241e:    0000        ..      DCW    0
        0x08002420:    ffffb080    ....    DCD    4294946944
    $t
    i.ecp_check_pubkey_sw
    ecp_check_pubkey_sw
        0x08002424:    b5f0        ..      PUSH     {r4-r7,lr}
        0x08002426:    460e        .F      MOV      r6,r1
        0x08002428:    4605        .F      MOV      r5,r0
        0x0800242a:    b087        ..      SUB      sp,sp,#0x1c
        0x0800242c:    2100        .!      MOVS     r1,#0
        0x0800242e:    4630        0F      MOV      r0,r6
        0x08002430:    f003fc8a    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08002434:    4f4a        JO      LDR      r7,[pc,#296] ; [0x8002560] = 0xffffb380
        0x08002436:    2800        .(      CMP      r0,#0
        0x08002438:    db13        ..      BLT      0x8002462 ; ecp_check_pubkey_sw + 62
        0x0800243a:    f106000c    ....    ADD      r0,r6,#0xc
        0x0800243e:    2100        .!      MOVS     r1,#0
        0x08002440:    4604        .F      MOV      r4,r0
        0x08002442:    f003fc81    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08002446:    2800        .(      CMP      r0,#0
        0x08002448:    db0b        ..      BLT      0x8002462 ; ecp_check_pubkey_sw + 62
        0x0800244a:    1d29        ).      ADDS     r1,r5,#4
        0x0800244c:    4630        0F      MOV      r0,r6
        0x0800244e:    f003fc93    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08002452:    2800        .(      CMP      r0,#0
        0x08002454:    da05        ..      BGE      0x8002462 ; ecp_check_pubkey_sw + 62
        0x08002456:    1d29        ).      ADDS     r1,r5,#4
        0x08002458:    4620         F      MOV      r0,r4
        0x0800245a:    f003fc8d    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x0800245e:    2800        .(      CMP      r0,#0
        0x08002460:    db02        ..      BLT      0x8002468 ; ecp_check_pubkey_sw + 68
        0x08002462:    4638        8F      MOV      r0,r7
        0x08002464:    b007        ..      ADD      sp,sp,#0x1c
        0x08002466:    bdf0        ..      POP      {r4-r7,pc}
        0x08002468:    a803        ..      ADD      r0,sp,#0xc
        0x0800246a:    f003ff85    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x0800246e:    4668        hF      MOV      r0,sp
        0x08002470:    f003ff82    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08002474:    4622        "F      MOV      r2,r4
        0x08002476:    4611        .F      MOV      r1,r2
        0x08002478:    a803        ..      ADD      r0,sp,#0xc
        0x0800247a:    f004f929    ..).    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x0800247e:    0004        ..      MOVS     r4,r0
        0x08002480:    d166        f.      BNE      0x8002550 ; ecp_check_pubkey_sw + 300
        0x08002482:    4629        )F      MOV      r1,r5
        0x08002484:    a803        ..      ADD      r0,sp,#0xc
        0x08002486:    f001fc1f    ....    BL       ecp_modp ; 0x8003cc8
        0x0800248a:    0004        ..      MOVS     r4,r0
        0x0800248c:    d160        `.      BNE      0x8002550 ; ecp_check_pubkey_sw + 300
        0x0800248e:    4632        2F      MOV      r2,r6
        0x08002490:    4611        .F      MOV      r1,r2
        0x08002492:    4668        hF      MOV      r0,sp
        0x08002494:    f004f91c    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002498:    0004        ..      MOVS     r4,r0
        0x0800249a:    d159        Y.      BNE      0x8002550 ; ecp_check_pubkey_sw + 300
        0x0800249c:    4629        )F      MOV      r1,r5
        0x0800249e:    4668        hF      MOV      r0,sp
        0x080024a0:    f001fc12    ....    BL       ecp_modp ; 0x8003cc8
        0x080024a4:    0004        ..      MOVS     r4,r0
        0x080024a6:    d153        S.      BNE      0x8002550 ; ecp_check_pubkey_sw + 300
        0x080024a8:    69a8        .i      LDR      r0,[r5,#0x18]
        0x080024aa:    b130        0.      CBZ      r0,0x80024ba ; ecp_check_pubkey_sw + 150
        0x080024ac:    4669        iF      MOV      r1,sp
        0x080024ae:    f1050210    ....    ADD      r2,r5,#0x10
        0x080024b2:    4608        .F      MOV      r0,r1
        0x080024b4:    f003fbd0    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x080024b8:    e01b        ..      B        0x80024f2 ; ecp_check_pubkey_sw + 206
        0x080024ba:    4669        iF      MOV      r1,sp
        0x080024bc:    2203        ."      MOVS     r2,#3
        0x080024be:    4608        .F      MOV      r0,r1
        0x080024c0:    f004fc04    ....    BL       mbedtls_mpi_sub_int ; 0x8006ccc
        0x080024c4:    e004        ..      B        0x80024d0 ; ecp_check_pubkey_sw + 172
        0x080024c6:    4669        iF      MOV      r1,sp
        0x080024c8:    1d2a        *.      ADDS     r2,r5,#4
        0x080024ca:    4608        .F      MOV      r0,r1
        0x080024cc:    f003fbc4    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x080024d0:    0004        ..      MOVS     r4,r0
        0x080024d2:    d13d        =.      BNE      0x8002550 ; ecp_check_pubkey_sw + 300
        0x080024d4:    9800        ..      LDR      r0,[sp,#0]
        0x080024d6:    2800        .(      CMP      r0,#0
        0x080024d8:    da13        ..      BGE      0x8002502 ; ecp_check_pubkey_sw + 222
        0x080024da:    2100        .!      MOVS     r1,#0
        0x080024dc:    4668        hF      MOV      r0,sp
        0x080024de:    f003fc33    ..3.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080024e2:    2800        .(      CMP      r0,#0
        0x080024e4:    d1ef        ..      BNE      0x80024c6 ; ecp_check_pubkey_sw + 162
        0x080024e6:    e00c        ..      B        0x8002502 ; ecp_check_pubkey_sw + 222
        0x080024e8:    4669        iF      MOV      r1,sp
        0x080024ea:    1d2a        *.      ADDS     r2,r5,#4
        0x080024ec:    4608        .F      MOV      r0,r1
        0x080024ee:    f004fbb6    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x080024f2:    0004        ..      MOVS     r4,r0
        0x080024f4:    d12c        ,.      BNE      0x8002550 ; ecp_check_pubkey_sw + 300
        0x080024f6:    1d29        ).      ADDS     r1,r5,#4
        0x080024f8:    4668        hF      MOV      r0,sp
        0x080024fa:    f003fc3d    ..=.    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x080024fe:    2800        .(      CMP      r0,#0
        0x08002500:    daf2        ..      BGE      0x80024e8 ; ecp_check_pubkey_sw + 196
        0x08002502:    4669        iF      MOV      r1,sp
        0x08002504:    4632        2F      MOV      r2,r6
        0x08002506:    4608        .F      MOV      r0,r1
        0x08002508:    f004f8e2    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x0800250c:    0004        ..      MOVS     r4,r0
        0x0800250e:    d11f        ..      BNE      0x8002550 ; ecp_check_pubkey_sw + 300
        0x08002510:    4629        )F      MOV      r1,r5
        0x08002512:    4668        hF      MOV      r0,sp
        0x08002514:    f001fbd8    ....    BL       ecp_modp ; 0x8003cc8
        0x08002518:    0004        ..      MOVS     r4,r0
        0x0800251a:    d119        ..      BNE      0x8002550 ; ecp_check_pubkey_sw + 300
        0x0800251c:    4669        iF      MOV      r1,sp
        0x0800251e:    f105021c    ....    ADD      r2,r5,#0x1c
        0x08002522:    4608        .F      MOV      r0,r1
        0x08002524:    f003fb98    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08002528:    e004        ..      B        0x8002534 ; ecp_check_pubkey_sw + 272
        0x0800252a:    4669        iF      MOV      r1,sp
        0x0800252c:    1d2a        *.      ADDS     r2,r5,#4
        0x0800252e:    4608        .F      MOV      r0,r1
        0x08002530:    f004fb95    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08002534:    0004        ..      MOVS     r4,r0
        0x08002536:    d10b        ..      BNE      0x8002550 ; ecp_check_pubkey_sw + 300
        0x08002538:    1d29        ).      ADDS     r1,r5,#4
        0x0800253a:    4668        hF      MOV      r0,sp
        0x0800253c:    f003fc1c    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08002540:    2800        .(      CMP      r0,#0
        0x08002542:    daf2        ..      BGE      0x800252a ; ecp_check_pubkey_sw + 262
        0x08002544:    4669        iF      MOV      r1,sp
        0x08002546:    a803        ..      ADD      r0,sp,#0xc
        0x08002548:    f003fc16    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x0800254c:    b100        ..      CBZ      r0,0x8002550 ; ecp_check_pubkey_sw + 300
        0x0800254e:    463c        <F      MOV      r4,r7
        0x08002550:    a803        ..      ADD      r0,sp,#0xc
        0x08002552:    f003fe48    ..H.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08002556:    4668        hF      MOV      r0,sp
        0x08002558:    f003fe45    ..E.    BL       mbedtls_mpi_free ; 0x80061e6
        0x0800255c:    4620         F      MOV      r0,r4
        0x0800255e:    e781        ..      B        0x8002464 ; ecp_check_pubkey_sw + 64
    $d
        0x08002560:    ffffb380    ....    DCD    4294947712
    $t
    i.ecp_comb_recode_scalar
    ecp_comb_recode_scalar
        0x08002564:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x08002568:    b086        ..      SUB      sp,sp,#0x18
        0x0800256a:    4604        .F      MOV      r4,r0
        0x0800256c:    e9dd950e    ....    LDRD     r9,r5,[sp,#0x38]
        0x08002570:    461f        .F      MOV      r7,r3
        0x08002572:    4690        .F      MOV      r8,r2
        0x08002574:    460e        .F      MOV      r6,r1
        0x08002576:    4668        hF      MOV      r0,sp
        0x08002578:    f003fefe    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x0800257c:    a803        ..      ADD      r0,sp,#0xc
        0x0800257e:    f003fefb    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08002582:    f104004c    ..L.    ADD      r0,r4,#0x4c
        0x08002586:    2100        .!      MOVS     r1,#0
        0x08002588:    4682        .F      MOV      r10,r0
        0x0800258a:    f003febd    ....    BL       mbedtls_mpi_get_bit ; 0x8006308
        0x0800258e:    2801        .(      CMP      r0,#1
        0x08002590:    d003        ..      BEQ      0x800259a ; ecp_comb_recode_scalar + 54
        0x08002592:    4818        .H      LDR      r0,[pc,#96] ; [0x80025f4] = 0xffffb080
        0x08002594:    b006        ..      ADD      sp,sp,#0x18
        0x08002596:    e8bd87f0    ....    POP      {r4-r10,pc}
        0x0800259a:    2100        .!      MOVS     r1,#0
        0x0800259c:    4630        0F      MOV      r0,r6
        0x0800259e:    f003feb3    ....    BL       mbedtls_mpi_get_bit ; 0x8006308
        0x080025a2:    b140        @.      CBZ      r0,0x80025b6 ; ecp_comb_recode_scalar + 82
        0x080025a4:    2000        .       MOVS     r0,#0
        0x080025a6:    7028        (p      STRB     r0,[r5,#0]
        0x080025a8:    4631        1F      MOV      r1,r6
        0x080025aa:    4668        hF      MOV      r0,sp
        0x080025ac:    f003fc2a    ..*.    BL       mbedtls_mpi_copy ; 0x8005e04
        0x080025b0:    0004        ..      MOVS     r4,r0
        0x080025b2:    d116        ..      BNE      0x80025e2 ; ecp_comb_recode_scalar + 126
        0x080025b4:    e001        ..      B        0x80025ba ; ecp_comb_recode_scalar + 86
        0x080025b6:    2001        .       MOVS     r0,#1
        0x080025b8:    e7f5        ..      B        0x80025a6 ; ecp_comb_recode_scalar + 66
        0x080025ba:    4632        2F      MOV      r2,r6
        0x080025bc:    4651        QF      MOV      r1,r10
        0x080025be:    a803        ..      ADD      r0,sp,#0xc
        0x080025c0:    f004fb9c    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x080025c4:    0004        ..      MOVS     r4,r0
        0x080025c6:    d10c        ..      BNE      0x80025e2 ; ecp_comb_recode_scalar + 126
        0x080025c8:    782a        *x      LDRB     r2,[r5,#0]
        0x080025ca:    a903        ..      ADD      r1,sp,#0xc
        0x080025cc:    4668        hF      MOV      r0,sp
        0x080025ce:    f004f9d3    ....    BL       mbedtls_mpi_safe_cond_assign ; 0x8006978
        0x080025d2:    0004        ..      MOVS     r4,r0
        0x080025d4:    d105        ..      BNE      0x80025e2 ; ecp_comb_recode_scalar + 126
        0x080025d6:    466b        kF      MOV      r3,sp
        0x080025d8:    464a        JF      MOV      r2,r9
        0x080025da:    4639        9F      MOV      r1,r7
        0x080025dc:    4640        @F      MOV      r0,r8
        0x080025de:    f7fffccd    ....    BL       ecp_comb_recode_core ; 0x8001f7c
        0x080025e2:    a803        ..      ADD      r0,sp,#0xc
        0x080025e4:    f003fdff    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080025e8:    4668        hF      MOV      r0,sp
        0x080025ea:    f003fdfc    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080025ee:    4620         F      MOV      r0,r4
        0x080025f0:    e7d0        ..      B        0x8002594 ; ecp_comb_recode_scalar + 48
    $d
        0x080025f2:    0000        ..      DCW    0
        0x080025f4:    ffffb080    ....    DCD    4294946944
    $t
    i.ecp_double_add_mxz
    ecp_double_add_mxz
        0x080025f8:    e92d4ff0    -..O    PUSH     {r4-r11,lr}
        0x080025fc:    b09b        ..      SUB      sp,sp,#0x6c
        0x080025fe:    4605        .F      MOV      r5,r0
        0x08002600:    e9dd8a24    ..$.    LDRD     r8,r10,[sp,#0x90]
        0x08002604:    461f        .F      MOV      r7,r3
        0x08002606:    4616        .F      MOV      r6,r2
        0x08002608:    4689        .F      MOV      r9,r1
        0x0800260a:    a809        ..      ADD      r0,sp,#0x24
        0x0800260c:    f003feb4    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08002610:    a812        ..      ADD      r0,sp,#0x48
        0x08002612:    f003feb1    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08002616:    4668        hF      MOV      r0,sp
        0x08002618:    f003feae    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x0800261c:    a80c        ..      ADD      r0,sp,#0x30
        0x0800261e:    f003feab    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08002622:    a803        ..      ADD      r0,sp,#0xc
        0x08002624:    f003fea8    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08002628:    a80f        ..      ADD      r0,sp,#0x3c
        0x0800262a:    f003fea5    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x0800262e:    a806        ..      ADD      r0,sp,#0x18
        0x08002630:    f003fea2    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08002634:    a815        ..      ADD      r0,sp,#0x54
        0x08002636:    f003fe9f    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x0800263a:    a818        ..      ADD      r0,sp,#0x60
        0x0800263c:    f003fe9c    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08002640:    f1070218    ....    ADD      r2,r7,#0x18
        0x08002644:    4693        .F      MOV      r11,r2
        0x08002646:    4639        9F      MOV      r1,r7
        0x08002648:    a809        ..      ADD      r0,sp,#0x24
        0x0800264a:    f003fb05    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x0800264e:    e004        ..      B        0x800265a ; ecp_double_add_mxz + 98
        0x08002650:    a909        ..      ADD      r1,sp,#0x24
        0x08002652:    1d2a        *.      ADDS     r2,r5,#4
        0x08002654:    4608        .F      MOV      r0,r1
        0x08002656:    f004fb02    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x0800265a:    0004        ..      MOVS     r4,r0
        0x0800265c:    d17e        ~.      BNE      0x800275c ; ecp_double_add_mxz + 356
        0x0800265e:    1d29        ).      ADDS     r1,r5,#4
        0x08002660:    a809        ..      ADD      r0,sp,#0x24
        0x08002662:    f003fb89    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08002666:    2800        .(      CMP      r0,#0
        0x08002668:    daf2        ..      BGE      0x8002650 ; ecp_double_add_mxz + 88
        0x0800266a:    aa09        ..      ADD      r2,sp,#0x24
        0x0800266c:    4611        .F      MOV      r1,r2
        0x0800266e:    a812        ..      ADD      r0,sp,#0x48
        0x08002670:    f004f82e    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002674:    0004        ..      MOVS     r4,r0
        0x08002676:    d1f1        ..      BNE      0x800265c ; ecp_double_add_mxz + 100
        0x08002678:    4629        )F      MOV      r1,r5
        0x0800267a:    a812        ..      ADD      r0,sp,#0x48
        0x0800267c:    f001fb24    ..$.    BL       ecp_modp ; 0x8003cc8
        0x08002680:    0004        ..      MOVS     r4,r0
        0x08002682:    d1eb        ..      BNE      0x800265c ; ecp_double_add_mxz + 100
        0x08002684:    465a        ZF      MOV      r2,r11
        0x08002686:    4639        9F      MOV      r1,r7
        0x08002688:    4668        hF      MOV      r0,sp
        0x0800268a:    f004fb37    ..7.    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x0800268e:    e004        ..      B        0x800269a ; ecp_double_add_mxz + 162
        0x08002690:    4669        iF      MOV      r1,sp
        0x08002692:    1d2a        *.      ADDS     r2,r5,#4
        0x08002694:    4608        .F      MOV      r0,r1
        0x08002696:    f003fadf    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x0800269a:    0004        ..      MOVS     r4,r0
        0x0800269c:    d1de        ..      BNE      0x800265c ; ecp_double_add_mxz + 100
        0x0800269e:    9800        ..      LDR      r0,[sp,#0]
        0x080026a0:    2800        .(      CMP      r0,#0
        0x080026a2:    da05        ..      BGE      0x80026b0 ; ecp_double_add_mxz + 184
        0x080026a4:    2100        .!      MOVS     r1,#0
        0x080026a6:    4668        hF      MOV      r0,sp
        0x080026a8:    f003fb4e    ..N.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080026ac:    2800        .(      CMP      r0,#0
        0x080026ae:    d1ef        ..      BNE      0x8002690 ; ecp_double_add_mxz + 152
        0x080026b0:    466a        jF      MOV      r2,sp
        0x080026b2:    4611        .F      MOV      r1,r2
        0x080026b4:    a80c        ..      ADD      r0,sp,#0x30
        0x080026b6:    f004f80b    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x080026ba:    0004        ..      MOVS     r4,r0
        0x080026bc:    d1ce        ..      BNE      0x800265c ; ecp_double_add_mxz + 100
        0x080026be:    4629        )F      MOV      r1,r5
        0x080026c0:    a80c        ..      ADD      r0,sp,#0x30
        0x080026c2:    f001fb01    ....    BL       ecp_modp ; 0x8003cc8
        0x080026c6:    0004        ..      MOVS     r4,r0
        0x080026c8:    d1c8        ..      BNE      0x800265c ; ecp_double_add_mxz + 100
        0x080026ca:    aa0c        ..      ADD      r2,sp,#0x30
        0x080026cc:    a912        ..      ADD      r1,sp,#0x48
        0x080026ce:    a803        ..      ADD      r0,sp,#0xc
        0x080026d0:    f004fb14    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x080026d4:    e004        ..      B        0x80026e0 ; ecp_double_add_mxz + 232
        0x080026d6:    a903        ..      ADD      r1,sp,#0xc
        0x080026d8:    1d2a        *.      ADDS     r2,r5,#4
        0x080026da:    4608        .F      MOV      r0,r1
        0x080026dc:    f003fabc    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x080026e0:    0004        ..      MOVS     r4,r0
        0x080026e2:    d1bb        ..      BNE      0x800265c ; ecp_double_add_mxz + 100
        0x080026e4:    9803        ..      LDR      r0,[sp,#0xc]
        0x080026e6:    2800        .(      CMP      r0,#0
        0x080026e8:    da05        ..      BGE      0x80026f6 ; ecp_double_add_mxz + 254
        0x080026ea:    2100        .!      MOVS     r1,#0
        0x080026ec:    a803        ..      ADD      r0,sp,#0xc
        0x080026ee:    f003fb2b    ..+.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080026f2:    2800        .(      CMP      r0,#0
        0x080026f4:    d1ef        ..      BNE      0x80026d6 ; ecp_double_add_mxz + 222
        0x080026f6:    f1080218    ....    ADD      r2,r8,#0x18
        0x080026fa:    4617        .F      MOV      r7,r2
        0x080026fc:    4641        AF      MOV      r1,r8
        0x080026fe:    a80f        ..      ADD      r0,sp,#0x3c
        0x08002700:    f003faaa    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08002704:    e004        ..      B        0x8002710 ; ecp_double_add_mxz + 280
        0x08002706:    a90f        ..      ADD      r1,sp,#0x3c
        0x08002708:    1d2a        *.      ADDS     r2,r5,#4
        0x0800270a:    4608        .F      MOV      r0,r1
        0x0800270c:    f004faa7    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08002710:    0004        ..      MOVS     r4,r0
        0x08002712:    d1a3        ..      BNE      0x800265c ; ecp_double_add_mxz + 100
        0x08002714:    1d29        ).      ADDS     r1,r5,#4
        0x08002716:    a80f        ..      ADD      r0,sp,#0x3c
        0x08002718:    f003fb2e    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x0800271c:    2800        .(      CMP      r0,#0
        0x0800271e:    daf2        ..      BGE      0x8002706 ; ecp_double_add_mxz + 270
        0x08002720:    463a        :F      MOV      r2,r7
        0x08002722:    4641        AF      MOV      r1,r8
        0x08002724:    a806        ..      ADD      r0,sp,#0x18
        0x08002726:    f004fae9    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x0800272a:    e004        ..      B        0x8002736 ; ecp_double_add_mxz + 318
        0x0800272c:    a906        ..      ADD      r1,sp,#0x18
        0x0800272e:    1d2a        *.      ADDS     r2,r5,#4
        0x08002730:    4608        .F      MOV      r0,r1
        0x08002732:    f003fa91    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08002736:    0004        ..      MOVS     r4,r0
        0x08002738:    d110        ..      BNE      0x800275c ; ecp_double_add_mxz + 356
        0x0800273a:    9806        ..      LDR      r0,[sp,#0x18]
        0x0800273c:    2800        .(      CMP      r0,#0
        0x0800273e:    da05        ..      BGE      0x800274c ; ecp_double_add_mxz + 340
        0x08002740:    2100        .!      MOVS     r1,#0
        0x08002742:    a806        ..      ADD      r0,sp,#0x18
        0x08002744:    f003fb00    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08002748:    2800        .(      CMP      r0,#0
        0x0800274a:    d1ef        ..      BNE      0x800272c ; ecp_double_add_mxz + 308
        0x0800274c:    aa09        ..      ADD      r2,sp,#0x24
        0x0800274e:    a906        ..      ADD      r1,sp,#0x18
        0x08002750:    a815        ..      ADD      r0,sp,#0x54
