openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08002752:    f003ffbd    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002756:    0004        ..      MOVS     r4,r0
        0x08002758:    d100        ..      BNE      0x800275c ; ecp_double_add_mxz + 356
        0x0800275a:    e000        ..      B        0x800275e ; ecp_double_add_mxz + 358
        0x0800275c:    e081        ..      B        0x8002862 ; ecp_double_add_mxz + 618
        0x0800275e:    4629        )F      MOV      r1,r5
        0x08002760:    a815        ..      ADD      r0,sp,#0x54
        0x08002762:    f001fab1    ....    BL       ecp_modp ; 0x8003cc8
        0x08002766:    0004        ..      MOVS     r4,r0
        0x08002768:    d17b        {.      BNE      0x8002862 ; ecp_double_add_mxz + 618
        0x0800276a:    466a        jF      MOV      r2,sp
        0x0800276c:    a90f        ..      ADD      r1,sp,#0x3c
        0x0800276e:    a818        ..      ADD      r0,sp,#0x60
        0x08002770:    f003ffae    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002774:    0004        ..      MOVS     r4,r0
        0x08002776:    d174        t.      BNE      0x8002862 ; ecp_double_add_mxz + 618
        0x08002778:    4629        )F      MOV      r1,r5
        0x0800277a:    a818        ..      ADD      r0,sp,#0x60
        0x0800277c:    f001faa4    ....    BL       ecp_modp ; 0x8003cc8
        0x08002780:    0004        ..      MOVS     r4,r0
        0x08002782:    d16e        n.      BNE      0x8002862 ; ecp_double_add_mxz + 618
        0x08002784:    aa18        ..      ADD      r2,sp,#0x60
        0x08002786:    a915        ..      ADD      r1,sp,#0x54
        0x08002788:    4630        0F      MOV      r0,r6
        0x0800278a:    f003fa65    ..e.    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x0800278e:    0004        ..      MOVS     r4,r0
        0x08002790:    d167        g.      BNE      0x8002862 ; ecp_double_add_mxz + 618
        0x08002792:    4629        )F      MOV      r1,r5
        0x08002794:    4630        0F      MOV      r0,r6
        0x08002796:    f001fa97    ....    BL       ecp_modp ; 0x8003cc8
        0x0800279a:    0004        ..      MOVS     r4,r0
        0x0800279c:    d17b        {.      BNE      0x8002896 ; ecp_double_add_mxz + 670
        0x0800279e:    4632        2F      MOV      r2,r6
        0x080027a0:    4611        .F      MOV      r1,r2
        0x080027a2:    4608        .F      MOV      r0,r1
        0x080027a4:    f003ff94    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x080027a8:    0004        ..      MOVS     r4,r0
        0x080027aa:    d174        t.      BNE      0x8002896 ; ecp_double_add_mxz + 670
        0x080027ac:    4629        )F      MOV      r1,r5
        0x080027ae:    4630        0F      MOV      r0,r6
        0x080027b0:    f001fa8a    ....    BL       ecp_modp ; 0x8003cc8
        0x080027b4:    0004        ..      MOVS     r4,r0
        0x080027b6:    d16e        n.      BNE      0x8002896 ; ecp_double_add_mxz + 670
        0x080027b8:    f1060018    ....    ADD      r0,r6,#0x18
        0x080027bc:    aa18        ..      ADD      r2,sp,#0x60
        0x080027be:    a915        ..      ADD      r1,sp,#0x54
        0x080027c0:    4607        .F      MOV      r7,r0
        0x080027c2:    f004fa9b    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x080027c6:    e004        ..      B        0x80027d2 ; ecp_double_add_mxz + 474
        0x080027c8:    4639        9F      MOV      r1,r7
        0x080027ca:    1d2a        *.      ADDS     r2,r5,#4
        0x080027cc:    4608        .F      MOV      r0,r1
        0x080027ce:    f003fa43    ..C.    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x080027d2:    0004        ..      MOVS     r4,r0
        0x080027d4:    d15f        _.      BNE      0x8002896 ; ecp_double_add_mxz + 670
        0x080027d6:    69b0        .i      LDR      r0,[r6,#0x18]
        0x080027d8:    2800        .(      CMP      r0,#0
        0x080027da:    da05        ..      BGE      0x80027e8 ; ecp_double_add_mxz + 496
        0x080027dc:    2100        .!      MOVS     r1,#0
        0x080027de:    4638        8F      MOV      r0,r7
        0x080027e0:    f003fab2    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080027e4:    2800        .(      CMP      r0,#0
        0x080027e6:    d1ef        ..      BNE      0x80027c8 ; ecp_double_add_mxz + 464
        0x080027e8:    463a        :F      MOV      r2,r7
        0x080027ea:    4611        .F      MOV      r1,r2
        0x080027ec:    4608        .F      MOV      r0,r1
        0x080027ee:    f003ff6f    ..o.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x080027f2:    0004        ..      MOVS     r4,r0
        0x080027f4:    d14f        O.      BNE      0x8002896 ; ecp_double_add_mxz + 670
        0x080027f6:    4629        )F      MOV      r1,r5
        0x080027f8:    4638        8F      MOV      r0,r7
        0x080027fa:    f001fa65    ..e.    BL       ecp_modp ; 0x8003cc8
        0x080027fe:    0004        ..      MOVS     r4,r0
        0x08002800:    d149        I.      BNE      0x8002896 ; ecp_double_add_mxz + 670
        0x08002802:    463a        :F      MOV      r2,r7
        0x08002804:    4651        QF      MOV      r1,r10
        0x08002806:    4610        .F      MOV      r0,r2
        0x08002808:    f003ff62    ..b.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x0800280c:    0004        ..      MOVS     r4,r0
        0x0800280e:    d142        B.      BNE      0x8002896 ; ecp_double_add_mxz + 670
        0x08002810:    4629        )F      MOV      r1,r5
        0x08002812:    4638        8F      MOV      r0,r7
        0x08002814:    f001fa58    ..X.    BL       ecp_modp ; 0x8003cc8
        0x08002818:    0004        ..      MOVS     r4,r0
        0x0800281a:    d13c        <.      BNE      0x8002896 ; ecp_double_add_mxz + 670
        0x0800281c:    aa0c        ..      ADD      r2,sp,#0x30
        0x0800281e:    a912        ..      ADD      r1,sp,#0x48
        0x08002820:    4648        HF      MOV      r0,r9
        0x08002822:    f003ff55    ..U.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002826:    0004        ..      MOVS     r4,r0
        0x08002828:    d135        5.      BNE      0x8002896 ; ecp_double_add_mxz + 670
        0x0800282a:    4629        )F      MOV      r1,r5
        0x0800282c:    4648        HF      MOV      r0,r9
        0x0800282e:    f001fa4b    ..K.    BL       ecp_modp ; 0x8003cc8
        0x08002832:    0004        ..      MOVS     r4,r0
        0x08002834:    d12f        /.      BNE      0x8002896 ; ecp_double_add_mxz + 670
        0x08002836:    f1090018    ....    ADD      r0,r9,#0x18
        0x0800283a:    aa03        ..      ADD      r2,sp,#0xc
        0x0800283c:    f1050110    ....    ADD      r1,r5,#0x10
        0x08002840:    4606        .F      MOV      r6,r0
        0x08002842:    f003ff45    ..E.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002846:    0004        ..      MOVS     r4,r0
        0x08002848:    d125        %.      BNE      0x8002896 ; ecp_double_add_mxz + 670
        0x0800284a:    4629        )F      MOV      r1,r5
        0x0800284c:    4630        0F      MOV      r0,r6
        0x0800284e:    f001fa3b    ..;.    BL       ecp_modp ; 0x8003cc8
        0x08002852:    0004        ..      MOVS     r4,r0
        0x08002854:    d11f        ..      BNE      0x8002896 ; ecp_double_add_mxz + 670
        0x08002856:    4632        2F      MOV      r2,r6
        0x08002858:    a90c        ..      ADD      r1,sp,#0x30
        0x0800285a:    4610        .F      MOV      r0,r2
        0x0800285c:    f003f9fc    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08002860:    e005        ..      B        0x800286e ; ecp_double_add_mxz + 630
        0x08002862:    e018        ..      B        0x8002896 ; ecp_double_add_mxz + 670
        0x08002864:    4631        1F      MOV      r1,r6
        0x08002866:    1d2a        *.      ADDS     r2,r5,#4
        0x08002868:    4608        .F      MOV      r0,r1
        0x0800286a:    f004f9f8    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x0800286e:    0004        ..      MOVS     r4,r0
        0x08002870:    d111        ..      BNE      0x8002896 ; ecp_double_add_mxz + 670
        0x08002872:    1d29        ).      ADDS     r1,r5,#4
        0x08002874:    4630        0F      MOV      r0,r6
        0x08002876:    f003fa7f    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x0800287a:    2800        .(      CMP      r0,#0
        0x0800287c:    daf2        ..      BGE      0x8002864 ; ecp_double_add_mxz + 620
        0x0800287e:    4632        2F      MOV      r2,r6
        0x08002880:    a903        ..      ADD      r1,sp,#0xc
        0x08002882:    4610        .F      MOV      r0,r2
        0x08002884:    f003ff24    ..$.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002888:    0004        ..      MOVS     r4,r0
        0x0800288a:    d104        ..      BNE      0x8002896 ; ecp_double_add_mxz + 670
        0x0800288c:    4629        )F      MOV      r1,r5
        0x0800288e:    4630        0F      MOV      r0,r6
        0x08002890:    f001fa1a    ....    BL       ecp_modp ; 0x8003cc8
        0x08002894:    4604        .F      MOV      r4,r0
        0x08002896:    a809        ..      ADD      r0,sp,#0x24
        0x08002898:    f003fca5    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x0800289c:    a812        ..      ADD      r0,sp,#0x48
        0x0800289e:    f003fca2    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080028a2:    4668        hF      MOV      r0,sp
        0x080028a4:    f003fc9f    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080028a8:    a80c        ..      ADD      r0,sp,#0x30
        0x080028aa:    f003fc9c    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080028ae:    a803        ..      ADD      r0,sp,#0xc
        0x080028b0:    f003fc99    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080028b4:    a80f        ..      ADD      r0,sp,#0x3c
        0x080028b6:    f003fc96    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080028ba:    a806        ..      ADD      r0,sp,#0x18
        0x080028bc:    f003fc93    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080028c0:    a815        ..      ADD      r0,sp,#0x54
        0x080028c2:    f003fc90    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080028c6:    a818        ..      ADD      r0,sp,#0x60
        0x080028c8:    f003fc8d    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080028cc:    b01b        ..      ADD      sp,sp,#0x6c
        0x080028ce:    4620         F      MOV      r0,r4
        0x080028d0:    e8bd8ff0    ....    POP      {r4-r11,pc}
    i.ecp_double_jac
    ecp_double_jac
        0x080028d4:    e92d43f0    -..C    PUSH     {r4-r9,lr}
        0x080028d8:    b08d        ..      SUB      sp,sp,#0x34
        0x080028da:    4605        .F      MOV      r5,r0
        0x080028dc:    4616        .F      MOV      r6,r2
        0x080028de:    460f        .F      MOV      r7,r1
        0x080028e0:    a809        ..      ADD      r0,sp,#0x24
        0x080028e2:    f003fd49    ..I.    BL       mbedtls_mpi_init ; 0x8006378
        0x080028e6:    4668        hF      MOV      r0,sp
        0x080028e8:    f003fd46    ..F.    BL       mbedtls_mpi_init ; 0x8006378
        0x080028ec:    a803        ..      ADD      r0,sp,#0xc
        0x080028ee:    f003fd43    ..C.    BL       mbedtls_mpi_init ; 0x8006378
        0x080028f2:    a806        ..      ADD      r0,sp,#0x18
        0x080028f4:    f003fd40    ..@.    BL       mbedtls_mpi_init ; 0x8006378
        0x080028f8:    f1060018    ....    ADD      r0,r6,#0x18
        0x080028fc:    69a9        .i      LDR      r1,[r5,#0x18]
        0x080028fe:    4680        .F      MOV      r8,r0
        0x08002900:    b139        9.      CBZ      r1,0x8002912 ; ecp_double_jac + 62
        0x08002902:    4632        2F      MOV      r2,r6
        0x08002904:    4611        .F      MOV      r1,r2
        0x08002906:    4668        hF      MOV      r0,sp
        0x08002908:    f003fee2    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x0800290c:    0004        ..      MOVS     r4,r0
        0x0800290e:    d17d        }.      BNE      0x8002a0c ; ecp_double_jac + 312
        0x08002910:    e056        V.      B        0x80029c0 ; ecp_double_jac + 236
        0x08002912:    4602        .F      MOV      r2,r0
        0x08002914:    4611        .F      MOV      r1,r2
        0x08002916:    4668        hF      MOV      r0,sp
        0x08002918:    f003feda    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x0800291c:    0004        ..      MOVS     r4,r0
        0x0800291e:    d1f6        ..      BNE      0x800290e ; ecp_double_jac + 58
        0x08002920:    4629        )F      MOV      r1,r5
        0x08002922:    4668        hF      MOV      r0,sp
        0x08002924:    f001f9d0    ....    BL       ecp_modp ; 0x8003cc8
        0x08002928:    0004        ..      MOVS     r4,r0
        0x0800292a:    d1f0        ..      BNE      0x800290e ; ecp_double_jac + 58
        0x0800292c:    466a        jF      MOV      r2,sp
        0x0800292e:    4631        1F      MOV      r1,r6
        0x08002930:    a803        ..      ADD      r0,sp,#0xc
        0x08002932:    f003f991    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08002936:    e004        ..      B        0x8002942 ; ecp_double_jac + 110
        0x08002938:    a903        ..      ADD      r1,sp,#0xc
        0x0800293a:    1d2a        *.      ADDS     r2,r5,#4
        0x0800293c:    4608        .F      MOV      r0,r1
        0x0800293e:    f004f98e    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08002942:    0004        ..      MOVS     r4,r0
        0x08002944:    d1e3        ..      BNE      0x800290e ; ecp_double_jac + 58
        0x08002946:    1d29        ).      ADDS     r1,r5,#4
        0x08002948:    a803        ..      ADD      r0,sp,#0xc
        0x0800294a:    f003fa15    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x0800294e:    2800        .(      CMP      r0,#0
        0x08002950:    daf2        ..      BGE      0x8002938 ; ecp_double_jac + 100
        0x08002952:    466a        jF      MOV      r2,sp
        0x08002954:    4631        1F      MOV      r1,r6
        0x08002956:    a806        ..      ADD      r0,sp,#0x18
        0x08002958:    f004f9d0    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x0800295c:    e004        ..      B        0x8002968 ; ecp_double_jac + 148
        0x0800295e:    a906        ..      ADD      r1,sp,#0x18
        0x08002960:    1d2a        *.      ADDS     r2,r5,#4
        0x08002962:    4608        .F      MOV      r0,r1
        0x08002964:    f003f978    ..x.    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08002968:    0004        ..      MOVS     r4,r0
        0x0800296a:    d1d0        ..      BNE      0x800290e ; ecp_double_jac + 58
        0x0800296c:    9806        ..      LDR      r0,[sp,#0x18]
        0x0800296e:    2800        .(      CMP      r0,#0
        0x08002970:    da05        ..      BGE      0x800297e ; ecp_double_jac + 170
        0x08002972:    2100        .!      MOVS     r1,#0
        0x08002974:    a806        ..      ADD      r0,sp,#0x18
        0x08002976:    f003f9e7    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x0800297a:    2800        .(      CMP      r0,#0
        0x0800297c:    d1ef        ..      BNE      0x800295e ; ecp_double_jac + 138
        0x0800297e:    aa06        ..      ADD      r2,sp,#0x18
        0x08002980:    a903        ..      ADD      r1,sp,#0xc
        0x08002982:    4668        hF      MOV      r0,sp
        0x08002984:    f003fea4    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002988:    0004        ..      MOVS     r4,r0
        0x0800298a:    d1c0        ..      BNE      0x800290e ; ecp_double_jac + 58
        0x0800298c:    4629        )F      MOV      r1,r5
        0x0800298e:    4668        hF      MOV      r0,sp
        0x08002990:    f001f99a    ....    BL       ecp_modp ; 0x8003cc8
        0x08002994:    0004        ..      MOVS     r4,r0
        0x08002996:    d1ba        ..      BNE      0x800290e ; ecp_double_jac + 58
        0x08002998:    2203        ."      MOVS     r2,#3
        0x0800299a:    4669        iF      MOV      r1,sp
        0x0800299c:    a809        ..      ADD      r0,sp,#0x24
        0x0800299e:    f003fe8b    ....    BL       mbedtls_mpi_mul_int ; 0x80066b8
        0x080029a2:    e004        ..      B        0x80029ae ; ecp_double_jac + 218
        0x080029a4:    a909        ..      ADD      r1,sp,#0x24
        0x080029a6:    1d2a        *.      ADDS     r2,r5,#4
        0x080029a8:    4608        .F      MOV      r0,r1
        0x080029aa:    f004f958    ..X.    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x080029ae:    0004        ..      MOVS     r4,r0
        0x080029b0:    d1ad        ..      BNE      0x800290e ; ecp_double_jac + 58
        0x080029b2:    1d29        ).      ADDS     r1,r5,#4
        0x080029b4:    a809        ..      ADD      r0,sp,#0x24
        0x080029b6:    f003f9df    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x080029ba:    2800        .(      CMP      r0,#0
        0x080029bc:    daf2        ..      BGE      0x80029a4 ; ecp_double_jac + 208
        0x080029be:    e05c        \.      B        0x8002a7a ; ecp_double_jac + 422
        0x080029c0:    4629        )F      MOV      r1,r5
        0x080029c2:    4668        hF      MOV      r0,sp
        0x080029c4:    f001f980    ....    BL       ecp_modp ; 0x8003cc8
        0x080029c8:    0004        ..      MOVS     r4,r0
        0x080029ca:    d1a0        ..      BNE      0x800290e ; ecp_double_jac + 58
        0x080029cc:    2203        ."      MOVS     r2,#3
        0x080029ce:    4669        iF      MOV      r1,sp
        0x080029d0:    a809        ..      ADD      r0,sp,#0x24
        0x080029d2:    f003fe71    ..q.    BL       mbedtls_mpi_mul_int ; 0x80066b8
        0x080029d6:    e004        ..      B        0x80029e2 ; ecp_double_jac + 270
        0x080029d8:    a909        ..      ADD      r1,sp,#0x24
        0x080029da:    1d2a        *.      ADDS     r2,r5,#4
        0x080029dc:    4608        .F      MOV      r0,r1
        0x080029de:    f004f93e    ..>.    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x080029e2:    0004        ..      MOVS     r4,r0
        0x080029e4:    d193        ..      BNE      0x800290e ; ecp_double_jac + 58
        0x080029e6:    1d29        ).      ADDS     r1,r5,#4
        0x080029e8:    a809        ..      ADD      r0,sp,#0x24
        0x080029ea:    f003f9c5    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x080029ee:    2800        .(      CMP      r0,#0
        0x080029f0:    daf2        ..      BGE      0x80029d8 ; ecp_double_jac + 260
        0x080029f2:    f1050010    ....    ADD      r0,r5,#0x10
        0x080029f6:    2100        .!      MOVS     r1,#0
        0x080029f8:    4681        .F      MOV      r9,r0
        0x080029fa:    f003f9a5    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080029fe:    b370        p.      CBZ      r0,0x8002a5e ; ecp_double_jac + 394
        0x08002a00:    4642        BF      MOV      r2,r8
        0x08002a02:    4611        .F      MOV      r1,r2
        0x08002a04:    4668        hF      MOV      r0,sp
        0x08002a06:    f003fe63    ..c.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002a0a:    e000        ..      B        0x8002a0e ; ecp_double_jac + 314
        0x08002a0c:    e0ed        ..      B        0x8002bea ; ecp_double_jac + 790
        0x08002a0e:    0004        ..      MOVS     r4,r0
        0x08002a10:    d185        ..      BNE      0x800291e ; ecp_double_jac + 74
        0x08002a12:    4629        )F      MOV      r1,r5
        0x08002a14:    4668        hF      MOV      r0,sp
        0x08002a16:    f001f957    ..W.    BL       ecp_modp ; 0x8003cc8
        0x08002a1a:    0004        ..      MOVS     r4,r0
        0x08002a1c:    d185        ..      BNE      0x800292a ; ecp_double_jac + 86
        0x08002a1e:    466a        jF      MOV      r2,sp
        0x08002a20:    4611        .F      MOV      r1,r2
        0x08002a22:    a803        ..      ADD      r0,sp,#0xc
        0x08002a24:    f003fe54    ..T.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002a28:    0004        ..      MOVS     r4,r0
        0x08002a2a:    d18b        ..      BNE      0x8002944 ; ecp_double_jac + 112
        0x08002a2c:    4629        )F      MOV      r1,r5
        0x08002a2e:    a803        ..      ADD      r0,sp,#0xc
        0x08002a30:    f001f94a    ..J.    BL       ecp_modp ; 0x8003cc8
        0x08002a34:    0004        ..      MOVS     r4,r0
        0x08002a36:    d185        ..      BNE      0x8002944 ; ecp_double_jac + 112
        0x08002a38:    464a        JF      MOV      r2,r9
        0x08002a3a:    a903        ..      ADD      r1,sp,#0xc
        0x08002a3c:    4668        hF      MOV      r0,sp
        0x08002a3e:    f003fe47    ..G.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002a42:    0004        ..      MOVS     r4,r0
        0x08002a44:    d191        ..      BNE      0x800296a ; ecp_double_jac + 150
        0x08002a46:    4629        )F      MOV      r1,r5
        0x08002a48:    4668        hF      MOV      r0,sp
        0x08002a4a:    f001f93d    ..=.    BL       ecp_modp ; 0x8003cc8
        0x08002a4e:    0004        ..      MOVS     r4,r0
        0x08002a50:    d18b        ..      BNE      0x800296a ; ecp_double_jac + 150
        0x08002a52:    a909        ..      ADD      r1,sp,#0x24
        0x08002a54:    466a        jF      MOV      r2,sp
        0x08002a56:    4608        .F      MOV      r0,r1
        0x08002a58:    f003f8fe    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08002a5c:    e005        ..      B        0x8002a6a ; ecp_double_jac + 406
        0x08002a5e:    e00c        ..      B        0x8002a7a ; ecp_double_jac + 422
        0x08002a60:    a909        ..      ADD      r1,sp,#0x24
        0x08002a62:    1d2a        *.      ADDS     r2,r5,#4
        0x08002a64:    4608        .F      MOV      r0,r1
        0x08002a66:    f004f8fa    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08002a6a:    0004        ..      MOVS     r4,r0
        0x08002a6c:    d18d        ..      BNE      0x800298a ; ecp_double_jac + 182
        0x08002a6e:    1d29        ).      ADDS     r1,r5,#4
        0x08002a70:    a809        ..      ADD      r0,sp,#0x24
        0x08002a72:    f003f981    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08002a76:    2800        .(      CMP      r0,#0
        0x08002a78:    daf2        ..      BGE      0x8002a60 ; ecp_double_jac + 396
        0x08002a7a:    f106020c    ....    ADD      r2,r6,#0xc
        0x08002a7e:    4691        .F      MOV      r9,r2
        0x08002a80:    4611        .F      MOV      r1,r2
        0x08002a82:    a803        ..      ADD      r0,sp,#0xc
        0x08002a84:    f003fe24    ..$.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002a88:    0004        ..      MOVS     r4,r0
        0x08002a8a:    d184        ..      BNE      0x8002996 ; ecp_double_jac + 194
        0x08002a8c:    4629        )F      MOV      r1,r5
        0x08002a8e:    a803        ..      ADD      r0,sp,#0xc
        0x08002a90:    f001f91a    ....    BL       ecp_modp ; 0x8003cc8
        0x08002a94:    0004        ..      MOVS     r4,r0
