openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08002a96:    d18b        ..      BNE      0x80029b0 ; ecp_double_jac + 220
        0x08002a98:    2101        .!      MOVS     r1,#1
        0x08002a9a:    a803        ..      ADD      r0,sp,#0xc
        0x08002a9c:    f004f812    ....    BL       mbedtls_mpi_shift_l ; 0x8006ac4
        0x08002aa0:    e004        ..      B        0x8002aac ; ecp_double_jac + 472
        0x08002aa2:    a903        ..      ADD      r1,sp,#0xc
        0x08002aa4:    1d2a        *.      ADDS     r2,r5,#4
        0x08002aa6:    4608        .F      MOV      r0,r1
        0x08002aa8:    f004f8d9    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08002aac:    0004        ..      MOVS     r4,r0
        0x08002aae:    d18c        ..      BNE      0x80029ca ; ecp_double_jac + 246
        0x08002ab0:    1d29        ).      ADDS     r1,r5,#4
        0x08002ab2:    a803        ..      ADD      r0,sp,#0xc
        0x08002ab4:    f003f960    ..`.    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08002ab8:    2800        .(      CMP      r0,#0
        0x08002aba:    daf2        ..      BGE      0x8002aa2 ; ecp_double_jac + 462
        0x08002abc:    aa03        ..      ADD      r2,sp,#0xc
        0x08002abe:    4631        1F      MOV      r1,r6
        0x08002ac0:    4668        hF      MOV      r0,sp
        0x08002ac2:    f003fe05    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002ac6:    0004        ..      MOVS     r4,r0
        0x08002ac8:    d18c        ..      BNE      0x80029e4 ; ecp_double_jac + 272
        0x08002aca:    4629        )F      MOV      r1,r5
        0x08002acc:    4668        hF      MOV      r0,sp
        0x08002ace:    f001f8fb    ....    BL       ecp_modp ; 0x8003cc8
        0x08002ad2:    0004        ..      MOVS     r4,r0
        0x08002ad4:    d186        ..      BNE      0x80029e4 ; ecp_double_jac + 272
        0x08002ad6:    2101        .!      MOVS     r1,#1
        0x08002ad8:    4668        hF      MOV      r0,sp
        0x08002ada:    f003fff3    ....    BL       mbedtls_mpi_shift_l ; 0x8006ac4
        0x08002ade:    e004        ..      B        0x8002aea ; ecp_double_jac + 534
        0x08002ae0:    4669        iF      MOV      r1,sp
        0x08002ae2:    1d2a        *.      ADDS     r2,r5,#4
        0x08002ae4:    4608        .F      MOV      r0,r1
        0x08002ae6:    f004f8ba    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08002aea:    0004        ..      MOVS     r4,r0
        0x08002aec:    d17d        }.      BNE      0x8002bea ; ecp_double_jac + 790
        0x08002aee:    1d29        ).      ADDS     r1,r5,#4
        0x08002af0:    4668        hF      MOV      r0,sp
        0x08002af2:    f003f941    ..A.    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08002af6:    2800        .(      CMP      r0,#0
        0x08002af8:    daf2        ..      BGE      0x8002ae0 ; ecp_double_jac + 524
        0x08002afa:    aa03        ..      ADD      r2,sp,#0xc
        0x08002afc:    4611        .F      MOV      r1,r2
        0x08002afe:    a806        ..      ADD      r0,sp,#0x18
        0x08002b00:    f003fde6    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002b04:    0004        ..      MOVS     r4,r0
        0x08002b06:    d170        p.      BNE      0x8002bea ; ecp_double_jac + 790
        0x08002b08:    4629        )F      MOV      r1,r5
        0x08002b0a:    a806        ..      ADD      r0,sp,#0x18
        0x08002b0c:    f001f8dc    ....    BL       ecp_modp ; 0x8003cc8
        0x08002b10:    0004        ..      MOVS     r4,r0
        0x08002b12:    d16a        j.      BNE      0x8002bea ; ecp_double_jac + 790
        0x08002b14:    2101        .!      MOVS     r1,#1
        0x08002b16:    a806        ..      ADD      r0,sp,#0x18
        0x08002b18:    f003ffd4    ....    BL       mbedtls_mpi_shift_l ; 0x8006ac4
        0x08002b1c:    e004        ..      B        0x8002b28 ; ecp_double_jac + 596
        0x08002b1e:    a906        ..      ADD      r1,sp,#0x18
        0x08002b20:    1d2a        *.      ADDS     r2,r5,#4
        0x08002b22:    4608        .F      MOV      r0,r1
        0x08002b24:    f004f89b    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08002b28:    0004        ..      MOVS     r4,r0
        0x08002b2a:    d15e        ^.      BNE      0x8002bea ; ecp_double_jac + 790
        0x08002b2c:    1d29        ).      ADDS     r1,r5,#4
        0x08002b2e:    a806        ..      ADD      r0,sp,#0x18
        0x08002b30:    f003f922    ..".    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08002b34:    2800        .(      CMP      r0,#0
        0x08002b36:    daf2        ..      BGE      0x8002b1e ; ecp_double_jac + 586
        0x08002b38:    aa09        ..      ADD      r2,sp,#0x24
        0x08002b3a:    4611        .F      MOV      r1,r2
        0x08002b3c:    a803        ..      ADD      r0,sp,#0xc
        0x08002b3e:    f003fdc7    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002b42:    0004        ..      MOVS     r4,r0
        0x08002b44:    d151        Q.      BNE      0x8002bea ; ecp_double_jac + 790
        0x08002b46:    4629        )F      MOV      r1,r5
        0x08002b48:    a803        ..      ADD      r0,sp,#0xc
        0x08002b4a:    f001f8bd    ....    BL       ecp_modp ; 0x8003cc8
        0x08002b4e:    0004        ..      MOVS     r4,r0
        0x08002b50:    d14b        K.      BNE      0x8002bea ; ecp_double_jac + 790
        0x08002b52:    a903        ..      ADD      r1,sp,#0xc
        0x08002b54:    466a        jF      MOV      r2,sp
        0x08002b56:    4608        .F      MOV      r0,r1
        0x08002b58:    f004f8d0    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x08002b5c:    e004        ..      B        0x8002b68 ; ecp_double_jac + 660
        0x08002b5e:    a903        ..      ADD      r1,sp,#0xc
        0x08002b60:    1d2a        *.      ADDS     r2,r5,#4
        0x08002b62:    4608        .F      MOV      r0,r1
        0x08002b64:    f003f878    ..x.    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08002b68:    0004        ..      MOVS     r4,r0
        0x08002b6a:    d13e        >.      BNE      0x8002bea ; ecp_double_jac + 790
        0x08002b6c:    9803        ..      LDR      r0,[sp,#0xc]
        0x08002b6e:    2800        .(      CMP      r0,#0
        0x08002b70:    da05        ..      BGE      0x8002b7e ; ecp_double_jac + 682
        0x08002b72:    2100        .!      MOVS     r1,#0
        0x08002b74:    a803        ..      ADD      r0,sp,#0xc
        0x08002b76:    f003f8e7    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08002b7a:    2800        .(      CMP      r0,#0
        0x08002b7c:    d1ef        ..      BNE      0x8002b5e ; ecp_double_jac + 650
        0x08002b7e:    a903        ..      ADD      r1,sp,#0xc
        0x08002b80:    466a        jF      MOV      r2,sp
        0x08002b82:    4608        .F      MOV      r0,r1
        0x08002b84:    f004f8ba    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x08002b88:    e004        ..      B        0x8002b94 ; ecp_double_jac + 704
        0x08002b8a:    a903        ..      ADD      r1,sp,#0xc
        0x08002b8c:    1d2a        *.      ADDS     r2,r5,#4
        0x08002b8e:    4608        .F      MOV      r0,r1
        0x08002b90:    f003f862    ..b.    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08002b94:    0004        ..      MOVS     r4,r0
        0x08002b96:    d175        u.      BNE      0x8002c84 ; ecp_double_jac + 944
        0x08002b98:    9803        ..      LDR      r0,[sp,#0xc]
        0x08002b9a:    2800        .(      CMP      r0,#0
        0x08002b9c:    da05        ..      BGE      0x8002baa ; ecp_double_jac + 726
        0x08002b9e:    2100        .!      MOVS     r1,#0
        0x08002ba0:    a803        ..      ADD      r0,sp,#0xc
        0x08002ba2:    f003f8d1    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08002ba6:    2800        .(      CMP      r0,#0
        0x08002ba8:    d1ef        ..      BNE      0x8002b8a ; ecp_double_jac + 694
        0x08002baa:    4669        iF      MOV      r1,sp
        0x08002bac:    aa03        ..      ADD      r2,sp,#0xc
        0x08002bae:    4608        .F      MOV      r0,r1
        0x08002bb0:    f004f8a4    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x08002bb4:    e004        ..      B        0x8002bc0 ; ecp_double_jac + 748
        0x08002bb6:    4669        iF      MOV      r1,sp
        0x08002bb8:    1d2a        *.      ADDS     r2,r5,#4
        0x08002bba:    4608        .F      MOV      r0,r1
        0x08002bbc:    f003f84c    ..L.    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08002bc0:    0004        ..      MOVS     r4,r0
        0x08002bc2:    d15f        _.      BNE      0x8002c84 ; ecp_double_jac + 944
        0x08002bc4:    9800        ..      LDR      r0,[sp,#0]
        0x08002bc6:    2800        .(      CMP      r0,#0
        0x08002bc8:    da05        ..      BGE      0x8002bd6 ; ecp_double_jac + 770
        0x08002bca:    2100        .!      MOVS     r1,#0
        0x08002bcc:    4668        hF      MOV      r0,sp
        0x08002bce:    f003f8bb    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08002bd2:    2800        .(      CMP      r0,#0
        0x08002bd4:    d1ef        ..      BNE      0x8002bb6 ; ecp_double_jac + 738
        0x08002bd6:    4669        iF      MOV      r1,sp
        0x08002bd8:    aa09        ..      ADD      r2,sp,#0x24
        0x08002bda:    4608        .F      MOV      r0,r1
        0x08002bdc:    f003fd78    ..x.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002be0:    0004        ..      MOVS     r4,r0
        0x08002be2:    d14f        O.      BNE      0x8002c84 ; ecp_double_jac + 944
        0x08002be4:    4629        )F      MOV      r1,r5
        0x08002be6:    4668        hF      MOV      r0,sp
        0x08002be8:    e000        ..      B        0x8002bec ; ecp_double_jac + 792
        0x08002bea:    e04b        K.      B        0x8002c84 ; ecp_double_jac + 944
        0x08002bec:    f001f86c    ..l.    BL       ecp_modp ; 0x8003cc8
        0x08002bf0:    0004        ..      MOVS     r4,r0
        0x08002bf2:    d147        G.      BNE      0x8002c84 ; ecp_double_jac + 944
        0x08002bf4:    4669        iF      MOV      r1,sp
        0x08002bf6:    aa06        ..      ADD      r2,sp,#0x18
        0x08002bf8:    4608        .F      MOV      r0,r1
        0x08002bfa:    f004f87f    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x08002bfe:    e004        ..      B        0x8002c0a ; ecp_double_jac + 822
        0x08002c00:    4669        iF      MOV      r1,sp
        0x08002c02:    1d2a        *.      ADDS     r2,r5,#4
        0x08002c04:    4608        .F      MOV      r0,r1
        0x08002c06:    f003f827    ..'.    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08002c0a:    0004        ..      MOVS     r4,r0
        0x08002c0c:    d13a        :.      BNE      0x8002c84 ; ecp_double_jac + 944
        0x08002c0e:    9800        ..      LDR      r0,[sp,#0]
        0x08002c10:    2800        .(      CMP      r0,#0
        0x08002c12:    da05        ..      BGE      0x8002c20 ; ecp_double_jac + 844
        0x08002c14:    2100        .!      MOVS     r1,#0
        0x08002c16:    4668        hF      MOV      r0,sp
        0x08002c18:    f003f896    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08002c1c:    2800        .(      CMP      r0,#0
        0x08002c1e:    d1ef        ..      BNE      0x8002c00 ; ecp_double_jac + 812
        0x08002c20:    4642        BF      MOV      r2,r8
        0x08002c22:    4649        IF      MOV      r1,r9
        0x08002c24:    a806        ..      ADD      r0,sp,#0x18
        0x08002c26:    f003fd53    ..S.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002c2a:    0004        ..      MOVS     r4,r0
        0x08002c2c:    d12a        *.      BNE      0x8002c84 ; ecp_double_jac + 944
        0x08002c2e:    4629        )F      MOV      r1,r5
        0x08002c30:    a806        ..      ADD      r0,sp,#0x18
        0x08002c32:    f001f849    ..I.    BL       ecp_modp ; 0x8003cc8
        0x08002c36:    0004        ..      MOVS     r4,r0
        0x08002c38:    d124        $.      BNE      0x8002c84 ; ecp_double_jac + 944
        0x08002c3a:    2101        .!      MOVS     r1,#1
        0x08002c3c:    a806        ..      ADD      r0,sp,#0x18
        0x08002c3e:    f003ff41    ..A.    BL       mbedtls_mpi_shift_l ; 0x8006ac4
        0x08002c42:    e004        ..      B        0x8002c4e ; ecp_double_jac + 890
        0x08002c44:    a906        ..      ADD      r1,sp,#0x18
        0x08002c46:    1d2a        *.      ADDS     r2,r5,#4
        0x08002c48:    4608        .F      MOV      r0,r1
        0x08002c4a:    f004f808    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08002c4e:    0004        ..      MOVS     r4,r0
        0x08002c50:    d118        ..      BNE      0x8002c84 ; ecp_double_jac + 944
        0x08002c52:    1d29        ).      ADDS     r1,r5,#4
        0x08002c54:    a806        ..      ADD      r0,sp,#0x18
        0x08002c56:    f003f88f    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08002c5a:    2800        .(      CMP      r0,#0
        0x08002c5c:    daf2        ..      BGE      0x8002c44 ; ecp_double_jac + 880
        0x08002c5e:    a903        ..      ADD      r1,sp,#0xc
        0x08002c60:    4638        8F      MOV      r0,r7
        0x08002c62:    f003f8cf    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08002c66:    0004        ..      MOVS     r4,r0
        0x08002c68:    d10c        ..      BNE      0x8002c84 ; ecp_double_jac + 944
        0x08002c6a:    4669        iF      MOV      r1,sp
        0x08002c6c:    f107000c    ....    ADD      r0,r7,#0xc
        0x08002c70:    f003f8c8    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08002c74:    0004        ..      MOVS     r4,r0
        0x08002c76:    d105        ..      BNE      0x8002c84 ; ecp_double_jac + 944
        0x08002c78:    a906        ..      ADD      r1,sp,#0x18
        0x08002c7a:    f1070018    ....    ADD      r0,r7,#0x18
        0x08002c7e:    f003f8c1    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08002c82:    4604        .F      MOV      r4,r0
        0x08002c84:    a809        ..      ADD      r0,sp,#0x24
        0x08002c86:    f003faae    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08002c8a:    4668        hF      MOV      r0,sp
        0x08002c8c:    f003faab    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08002c90:    a803        ..      ADD      r0,sp,#0xc
        0x08002c92:    f003faa8    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08002c96:    a806        ..      ADD      r0,sp,#0x18
        0x08002c98:    f003faa5    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08002c9c:    b00d        ..      ADD      sp,sp,#0x34
        0x08002c9e:    4620         F      MOV      r0,r4
        0x08002ca0:    e8bd83f0    ....    POP      {r4-r9,pc}
    i.ecp_group_load
    ecp_group_load
        0x08002ca4:    e92d5ff0    -.._    PUSH     {r4-r12,lr}
        0x08002ca8:    4604        .F      MOV      r4,r0
        0x08002caa:    e9dd8611    ....    LDRD     r8,r6,[sp,#0x44]
        0x08002cae:    e9dda70b    ....    LDRD     r10,r7,[sp,#0x2c]
        0x08002cb2:    461d        .F      MOV      r5,r3
        0x08002cb4:    1d00        ..      ADDS     r0,r0,#4
        0x08002cb6:    f8ddb028    ..(.    LDR      r11,[sp,#0x28]
        0x08002cba:    f8dd9038    ..8.    LDR      r9,[sp,#0x38]
        0x08002cbe:    f7fff9ff    ....    BL       ecp_mpi_load ; 0x80020c0
        0x08002cc2:    b12d        -.      CBZ      r5,0x8002cd0 ; ecp_group_load + 44
        0x08002cc4:    465a        ZF      MOV      r2,r11
        0x08002cc6:    4629        )F      MOV      r1,r5
        0x08002cc8:    f1040010    ....    ADD      r0,r4,#0x10
        0x08002ccc:    f7fff9f8    ....    BL       ecp_mpi_load ; 0x80020c0
        0x08002cd0:    463a        :F      MOV      r2,r7
        0x08002cd2:    4651        QF      MOV      r1,r10
        0x08002cd4:    f104001c    ....    ADD      r0,r4,#0x1c
        0x08002cd8:    f7fff9f2    ....    BL       ecp_mpi_load ; 0x80020c0
        0x08002cdc:    4632        2F      MOV      r2,r6
        0x08002cde:    f104004c    ..L.    ADD      r0,r4,#0x4c
        0x08002ce2:    4641        AF      MOV      r1,r8
        0x08002ce4:    4606        .F      MOV      r6,r0
        0x08002ce6:    f7fff9eb    ....    BL       ecp_mpi_load ; 0x80020c0
        0x08002cea:    464a        JF      MOV      r2,r9
        0x08002cec:    f1040028    ..(.    ADD      r0,r4,#0x28
        0x08002cf0:    990d        ..      LDR      r1,[sp,#0x34]
        0x08002cf2:    f7fff9e5    ....    BL       ecp_mpi_load ; 0x80020c0
        0x08002cf6:    e9dd120f    ....    LDRD     r1,r2,[sp,#0x3c]
        0x08002cfa:    f1040034    ..4.    ADD      r0,r4,#0x34
        0x08002cfe:    f7fff9df    ....    BL       ecp_mpi_load ; 0x80020c0
        0x08002d02:    2501        .%      MOVS     r5,#1
        0x08002d04:    4807        .H      LDR      r0,[pc,#28] ; [0x8002d24] = 0x20000020
        0x08002d06:    6425        %d      STR      r5,[r4,#0x40]
        0x08002d08:    e9c45011    ...P    STRD     r5,r0,[r4,#0x44]
        0x08002d0c:    1d20         .      ADDS     r0,r4,#4
        0x08002d0e:    f002ffca    ....    BL       mbedtls_mpi_bitlen ; 0x8005ca6
        0x08002d12:    65a0        .e      STR      r0,[r4,#0x58]
        0x08002d14:    4630        0F      MOV      r0,r6
        0x08002d16:    f002ffc6    ....    BL       mbedtls_mpi_bitlen ; 0x8005ca6
        0x08002d1a:    e9c40517    ....    STRD     r0,r5,[r4,#0x5c]
        0x08002d1e:    2000        .       MOVS     r0,#0
        0x08002d20:    e8bd9ff0    ....    POP      {r4-r12,pc}
    $d
        0x08002d24:    20000020     ..     DCD    536870944
    $t
    i.ecp_mod_koblitz
    ecp_mod_koblitz
        0x08002d28:    e92d4ff0    -..O    PUSH     {r4-r11,lr}
        0x08002d2c:    b095        ..      SUB      sp,sp,#0x54
        0x08002d2e:    4605        .F      MOV      r5,r0
        0x08002d30:    e9dda91e    ....    LDRD     r10,r9,[sp,#0x78]
        0x08002d34:    6840        @h      LDR      r0,[r0,#4]
        0x08002d36:    4614        .F      MOV      r4,r2
        0x08002d38:    461f        .F      MOV      r7,r3
        0x08002d3a:    42a0        .B      CMP      r0,r4
        0x08002d3c:    d203        ..      BCS      0x8002d46 ; ecp_mod_koblitz + 30
        0x08002d3e:    2000        .       MOVS     r0,#0
        0x08002d40:    b015        ..      ADD      sp,sp,#0x54
        0x08002d42:    e8bd8ff0    ....    POP      {r4-r11,pc}
        0x08002d46:    9103        ..      STR      r1,[sp,#0xc]
        0x08002d48:    2001        .       MOVS     r0,#1
        0x08002d4a:    2102        .!      MOVS     r1,#2
        0x08002d4c:    e9cd0101    ....    STRD     r0,r1,[sp,#4]
        0x08002d50:    9011        ..      STR      r0,[sp,#0x44]
        0x08002d52:    a804        ..      ADD      r0,sp,#0x10
        0x08002d54:    9013        ..      STR      r0,[sp,#0x4c]
        0x08002d56:    6869        ih      LDR      r1,[r5,#4]
        0x08002d58:    eba40b07    ....    SUB      r11,r4,r7
        0x08002d5c:    eba1010b    ....    SUB      r1,r1,r11
        0x08002d60:    eb040807    ....    ADD      r8,r4,r7
        0x08002d64:    9112        ..      STR      r1,[sp,#0x48]
        0x08002d66:    4541        AE      CMP      r1,r8
        0x08002d68:    d901        ..      BLS      0x8002d6e ; ecp_mod_koblitz + 70
        0x08002d6a:    f8cd8048    ..H.    STR      r8,[sp,#0x48]
        0x08002d6e:    212c        ,!      MOVS     r1,#0x2c
        0x08002d70:    a804        ..      ADD      r0,sp,#0x10
        0x08002d72:    f7fdfbf3    ....    BL       __aeabi_memclr4 ; 0x800055c
        0x08002d76:    68a8        .h      LDR      r0,[r5,#8]
        0x08002d78:    eb000084    ....    ADD      r0,r0,r4,LSL #2
        0x08002d7c:    eba00187    ....    SUB      r1,r0,r7,LSL #2
        0x08002d80:    9812        ..      LDR      r0,[sp,#0x48]
        0x08002d82:    0082        ..      LSLS     r2,r0,#2
        0x08002d84:    a804        ..      ADD      r0,sp,#0x10
        0x08002d86:    f7fdfb8a    ....    BL       __aeabi_memcpy4 ; 0x800049e
        0x08002d8a:    f1ba0000    ....    SUBS     r0,r10,#0
        0x08002d8e:    d005        ..      BEQ      0x8002d9c ; ecp_mod_koblitz + 116
        0x08002d90:    4601        .F      MOV      r1,r0
        0x08002d92:    a811        ..      ADD      r0,sp,#0x44
        0x08002d94:    f003fee6    ....    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x08002d98:    2800        .(      CMP      r0,#0
        0x08002d9a:    d1d1        ..      BNE      0x8002d40 ; ecp_mod_koblitz + 24
        0x08002d9c:    9902        ..      LDR      r1,[sp,#8]
        0x08002d9e:    9812        ..      LDR      r0,[sp,#0x48]
        0x08002da0:    f1b90f00    ....    CMP      r9,#0
        0x08002da4:    4408        .D      ADD      r0,r0,r1
        0x08002da6:    f06f0103    o...    MVN      r1,#3
        0x08002daa:    eb010684    ....    ADD      r6,r1,r4,LSL #2
        0x08002dae:    9012        ..      STR      r0,[sp,#0x48]
        0x08002db0:    d004        ..      BEQ      0x8002dbc ; ecp_mod_koblitz + 148
        0x08002db2:    68a8        .h      LDR      r0,[r5,#8]
        0x08002db4:    5981        .Y      LDR      r1,[r0,r6]
        0x08002db6:    ea010109    ....    AND      r1,r1,r9
        0x08002dba:    5181        .Q      STR      r1,[r0,r6]
        0x08002dbc:    4620         F      MOV      r0,r4
        0x08002dbe:    e004        ..      B        0x8002dca ; ecp_mod_koblitz + 162
        0x08002dc0:    68aa        .h      LDR      r2,[r5,#8]
        0x08002dc2:    2100        .!      MOVS     r1,#0
        0x08002dc4:    f8421020    B. .    STR      r1,[r2,r0,LSL #2]
        0x08002dc8:    1c40        @.      ADDS     r0,r0,#1
        0x08002dca:    6869        ih      LDR      r1,[r5,#4]
        0x08002dcc:    4281        .B      CMP      r1,r0
        0x08002dce:    d8f7        ..      BHI      0x8002dc0 ; ecp_mod_koblitz + 152
        0x08002dd0:    a911        ..      ADD      r1,sp,#0x44
        0x08002dd2:    aa01        ..      ADD      r2,sp,#4
        0x08002dd4:    4608        .F      MOV      r0,r1
        0x08002dd6:    f003fc7b    ..{.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002dda:    2800        .(      CMP      r0,#0
        0x08002ddc:    d1b0        ..      BNE      0x8002d40 ; ecp_mod_koblitz + 24
        0x08002dde:    4629        )F      MOV      r1,r5
        0x08002de0:    aa11        ..      ADD      r2,sp,#0x44
        0x08002de2:    4608        .F      MOV      r0,r1
        0x08002de4:    f002fec4    ....    BL       mbedtls_mpi_add_abs ; 0x8005b70
        0x08002de8:    2800        .(      CMP      r0,#0
        0x08002dea:    d1a9        ..      BNE      0x8002d40 ; ecp_mod_koblitz + 24
        0x08002dec:    6869        ih      LDR      r1,[r5,#4]
        0x08002dee:    eba1000b    ....    SUB      r0,r1,r11
        0x08002df2:    9012        ..      STR      r0,[sp,#0x48]
        0x08002df4:    4540        @E      CMP      r0,r8
        0x08002df6:    d901        ..      BLS      0x8002dfc ; ecp_mod_koblitz + 212
        0x08002df8:    f8cd8048    ..H.    STR      r8,[sp,#0x48]
        0x08002dfc:    212c        ,!      MOVS     r1,#0x2c
