openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08002dfe:    a804        ..      ADD      r0,sp,#0x10
        0x08002e00:    f7fdfbac    ....    BL       __aeabi_memclr4 ; 0x800055c
        0x08002e04:    68a8        .h      LDR      r0,[r5,#8]
        0x08002e06:    eb000084    ....    ADD      r0,r0,r4,LSL #2
        0x08002e0a:    eba00187    ....    SUB      r1,r0,r7,LSL #2
        0x08002e0e:    9812        ..      LDR      r0,[sp,#0x48]
        0x08002e10:    0082        ..      LSLS     r2,r0,#2
        0x08002e12:    a804        ..      ADD      r0,sp,#0x10
        0x08002e14:    f7fdfb43    ..C.    BL       __aeabi_memcpy4 ; 0x800049e
        0x08002e18:    f1ba0000    ....    SUBS     r0,r10,#0
        0x08002e1c:    d005        ..      BEQ      0x8002e2a ; ecp_mod_koblitz + 258
        0x08002e1e:    4601        .F      MOV      r1,r0
        0x08002e20:    a811        ..      ADD      r0,sp,#0x44
        0x08002e22:    f003fe9f    ....    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x08002e26:    2800        .(      CMP      r0,#0
        0x08002e28:    d18a        ..      BNE      0x8002d40 ; ecp_mod_koblitz + 24
        0x08002e2a:    9902        ..      LDR      r1,[sp,#8]
        0x08002e2c:    9812        ..      LDR      r0,[sp,#0x48]
        0x08002e2e:    f1b90f00    ....    CMP      r9,#0
        0x08002e32:    4408        .D      ADD      r0,r0,r1
        0x08002e34:    9012        ..      STR      r0,[sp,#0x48]
        0x08002e36:    d004        ..      BEQ      0x8002e42 ; ecp_mod_koblitz + 282
        0x08002e38:    68a8        .h      LDR      r0,[r5,#8]
        0x08002e3a:    5981        .Y      LDR      r1,[r0,r6]
        0x08002e3c:    ea010109    ....    AND      r1,r1,r9
        0x08002e40:    5181        .Q      STR      r1,[r0,r6]
        0x08002e42:    2000        .       MOVS     r0,#0
        0x08002e44:    e003        ..      B        0x8002e4e ; ecp_mod_koblitz + 294
        0x08002e46:    68a9        .h      LDR      r1,[r5,#8]
        0x08002e48:    f8410024    A.$.    STR      r0,[r1,r4,LSL #2]
        0x08002e4c:    1c64        d.      ADDS     r4,r4,#1
        0x08002e4e:    6869        ih      LDR      r1,[r5,#4]
        0x08002e50:    42a1        .B      CMP      r1,r4
        0x08002e52:    d8f8        ..      BHI      0x8002e46 ; ecp_mod_koblitz + 286
        0x08002e54:    a911        ..      ADD      r1,sp,#0x44
        0x08002e56:    aa01        ..      ADD      r2,sp,#4
        0x08002e58:    4608        .F      MOV      r0,r1
        0x08002e5a:    f003fc39    ..9.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08002e5e:    2800        .(      CMP      r0,#0
        0x08002e60:    d19b        ..      BNE      0x8002d9a ; ecp_mod_koblitz + 114
        0x08002e62:    4629        )F      MOV      r1,r5
        0x08002e64:    aa11        ..      ADD      r2,sp,#0x44
        0x08002e66:    4608        .F      MOV      r0,r1
        0x08002e68:    f002fe82    ....    BL       mbedtls_mpi_add_abs ; 0x8005b70
        0x08002e6c:    e768        h.      B        0x8002d40 ; ecp_mod_koblitz + 24
    i.ecp_mod_p192
    ecp_mod_p192
        0x08002e6e:    e92d43f8    -..C    PUSH     {r3-r9,lr}
        0x08002e72:    2600        .&      MOVS     r6,#0
        0x08002e74:    4605        .F      MOV      r5,r0
        0x08002e76:    210c        .!      MOVS     r1,#0xc
        0x08002e78:    9600        ..      STR      r6,[sp,#0]
        0x08002e7a:    f003fa55    ..U.    BL       mbedtls_mpi_grow ; 0x8006328
        0x08002e7e:    ea5f0800    _...    MOVS     r8,r0
        0x08002e82:    d13f        ?.      BNE      0x8002f04 ; ecp_mod_p192 + 150
        0x08002e84:    e9d50401    ....    LDRD     r0,r4,[r5,#4]
        0x08002e88:    eb040780    ....    ADD      r7,r4,r0,LSL #2
        0x08002e8c:    f1040118    ....    ADD      r1,r4,#0x18
        0x08002e90:    466a        jF      MOV      r2,sp
        0x08002e92:    4620         F      MOV      r0,r4
        0x08002e94:    f7fefca0    ....    BL       add64 ; 0x80017d8
        0x08002e98:    68a9        .h      LDR      r1,[r5,#8]
        0x08002e9a:    466a        jF      MOV      r2,sp
        0x08002e9c:    4620         F      MOV      r0,r4
        0x08002e9e:    3128        (1      ADDS     r1,r1,#0x28
        0x08002ea0:    f7fefc9a    ....    BL       add64 ; 0x80017d8
        0x08002ea4:    3408        .4      ADDS     r4,r4,#8
        0x08002ea6:    4669        iF      MOV      r1,sp
        0x08002ea8:    4620         F      MOV      r0,r4
        0x08002eaa:    f7feff35    ..5.    BL       carry64 ; 0x8001d18
        0x08002eae:    68a9        .h      LDR      r1,[r5,#8]
        0x08002eb0:    466a        jF      MOV      r2,sp
        0x08002eb2:    4620         F      MOV      r0,r4
        0x08002eb4:    3118        .1      ADDS     r1,r1,#0x18
        0x08002eb6:    f7fefc8f    ....    BL       add64 ; 0x80017d8
        0x08002eba:    68a9        .h      LDR      r1,[r5,#8]
        0x08002ebc:    466a        jF      MOV      r2,sp
        0x08002ebe:    4620         F      MOV      r0,r4
        0x08002ec0:    3120         1      ADDS     r1,r1,#0x20
        0x08002ec2:    f7fefc89    ....    BL       add64 ; 0x80017d8
        0x08002ec6:    68a9        .h      LDR      r1,[r5,#8]
        0x08002ec8:    466a        jF      MOV      r2,sp
        0x08002eca:    4620         F      MOV      r0,r4
        0x08002ecc:    3128        (1      ADDS     r1,r1,#0x28
        0x08002ece:    f7fefc83    ....    BL       add64 ; 0x80017d8
        0x08002ed2:    3408        .4      ADDS     r4,r4,#8
        0x08002ed4:    4669        iF      MOV      r1,sp
        0x08002ed6:    4620         F      MOV      r0,r4
        0x08002ed8:    f7feff1e    ....    BL       carry64 ; 0x8001d18
        0x08002edc:    68a9        .h      LDR      r1,[r5,#8]
        0x08002ede:    466a        jF      MOV      r2,sp
        0x08002ee0:    4620         F      MOV      r0,r4
        0x08002ee2:    3120         1      ADDS     r1,r1,#0x20
        0x08002ee4:    f7fefc78    ..x.    BL       add64 ; 0x80017d8
        0x08002ee8:    68a9        .h      LDR      r1,[r5,#8]
        0x08002eea:    466a        jF      MOV      r2,sp
        0x08002eec:    4620         F      MOV      r0,r4
        0x08002eee:    3128        (1      ADDS     r1,r1,#0x28
        0x08002ef0:    f7fefc72    ..r.    BL       add64 ; 0x80017d8
        0x08002ef4:    9800        ..      LDR      r0,[sp,#0]
        0x08002ef6:    f8440f08    D...    STR      r0,[r4,#8]!
        0x08002efa:    e000        ..      B        0x8002efe ; ecp_mod_p192 + 144
        0x08002efc:    6026        &`      STR      r6,[r4,#0]
        0x08002efe:    1d24        $.      ADDS     r4,r4,#4
        0x08002f00:    42bc        .B      CMP      r4,r7
        0x08002f02:    d3fb        ..      BCC      0x8002efc ; ecp_mod_p192 + 142
        0x08002f04:    4640        @F      MOV      r0,r8
        0x08002f06:    e8bd83f8    ....    POP      {r3-r9,pc}
    i.ecp_mod_p224
    ecp_mod_p224
        0x08002f0a:    b5f0        ..      PUSH     {r4-r7,lr}
        0x08002f0c:    b091        ..      SUB      sp,sp,#0x44
        0x08002f0e:    4604        .F      MOV      r4,r0
        0x08002f10:    2001        .       MOVS     r0,#1
        0x08002f12:    9003        ..      STR      r0,[sp,#0xc]
        0x08002f14:    2008        .       MOVS     r0,#8
        0x08002f16:    9004        ..      STR      r0,[sp,#0x10]
        0x08002f18:    2500        .%      MOVS     r5,#0
        0x08002f1a:    a806        ..      ADD      r0,sp,#0x18
        0x08002f1c:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x08002f20:    27e0        .'      MOVS     r7,#0xe0
        0x08002f22:    2120         !      MOVS     r1,#0x20
        0x08002f24:    9005        ..      STR      r0,[sp,#0x14]
        0x08002f26:    f7fdfb19    ....    BL       __aeabi_memclr4 ; 0x800055c
        0x08002f2a:    210e        .!      MOVS     r1,#0xe
        0x08002f2c:    4620         F      MOV      r0,r4
        0x08002f2e:    f003f9fb    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x08002f32:    0006        ..      MOVS     r6,r0
        0x08002f34:    d17d        }.      BNE      0x8003032 ; ecp_mod_p224 + 296
        0x08002f36:    68a0        .h      LDR      r0,[r4,#8]
        0x08002f38:    aa01        ..      ADD      r2,sp,#4
        0x08002f3a:    6800        .h      LDR      r0,[r0,#0]
        0x08002f3c:    9000        ..      STR      r0,[sp,#0]
        0x08002f3e:    68a0        .h      LDR      r0,[r4,#8]
        0x08002f40:    69c1        .i      LDR      r1,[r0,#0x1c]
        0x08002f42:    4668        hF      MOV      r0,sp
        0x08002f44:    f004faf9    ....    BL       sub32 ; 0x800753a
        0x08002f48:    68a0        .h      LDR      r0,[r4,#8]
        0x08002f4a:    aa01        ..      ADD      r2,sp,#4
        0x08002f4c:    6ac1        .j      LDR      r1,[r0,#0x2c]
        0x08002f4e:    4668        hF      MOV      r0,sp
        0x08002f50:    f004faf3    ....    BL       sub32 ; 0x800753a
        0x08002f54:    68a1        .h      LDR      r1,[r4,#8]
        0x08002f56:    9800        ..      LDR      r0,[sp,#0]
        0x08002f58:    aa01        ..      ADD      r2,sp,#4
        0x08002f5a:    6008        .`      STR      r0,[r1,#0]
        0x08002f5c:    68a0        .h      LDR      r0,[r4,#8]
        0x08002f5e:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08002f62:    6840        @h      LDR      r0,[r0,#4]
        0x08002f64:    9000        ..      STR      r0,[sp,#0]
        0x08002f66:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x08002f6a:    2900        .)      CMP      r1,#0
        0x08002f6c:    da04        ..      BGE      0x8002f78 ; ecp_mod_p224 + 110
        0x08002f6e:    4249        IB      RSBS     r1,r1,#0
        0x08002f70:    4668        hF      MOV      r0,sp
        0x08002f72:    f004fae2    ....    BL       sub32 ; 0x800753a
        0x08002f76:    e002        ..      B        0x8002f7e ; ecp_mod_p224 + 116
        0x08002f78:    4668        hF      MOV      r0,sp
        0x08002f7a:    f7fefc20    .. .    BL       add32 ; 0x80017be
        0x08002f7e:    68a0        .h      LDR      r0,[r4,#8]
        0x08002f80:    aa01        ..      ADD      r2,sp,#4
        0x08002f82:    6a01        .j      LDR      r1,[r0,#0x20]
        0x08002f84:    4668        hF      MOV      r0,sp
        0x08002f86:    f004fad8    ....    BL       sub32 ; 0x800753a
        0x08002f8a:    68a0        .h      LDR      r0,[r4,#8]
        0x08002f8c:    aa01        ..      ADD      r2,sp,#4
        0x08002f8e:    6b01        .k      LDR      r1,[r0,#0x30]
        0x08002f90:    4668        hF      MOV      r0,sp
        0x08002f92:    f004fad2    ....    BL       sub32 ; 0x800753a
        0x08002f96:    68a1        .h      LDR      r1,[r4,#8]
        0x08002f98:    9800        ..      LDR      r0,[sp,#0]
        0x08002f9a:    aa01        ..      ADD      r2,sp,#4
        0x08002f9c:    6048        H`      STR      r0,[r1,#4]
        0x08002f9e:    68a0        .h      LDR      r0,[r4,#8]
        0x08002fa0:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08002fa4:    6880        .h      LDR      r0,[r0,#8]
        0x08002fa6:    9000        ..      STR      r0,[sp,#0]
        0x08002fa8:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x08002fac:    2900        .)      CMP      r1,#0
        0x08002fae:    da04        ..      BGE      0x8002fba ; ecp_mod_p224 + 176
        0x08002fb0:    4249        IB      RSBS     r1,r1,#0
        0x08002fb2:    4668        hF      MOV      r0,sp
        0x08002fb4:    f004fac1    ....    BL       sub32 ; 0x800753a
        0x08002fb8:    e002        ..      B        0x8002fc0 ; ecp_mod_p224 + 182
        0x08002fba:    4668        hF      MOV      r0,sp
        0x08002fbc:    f7fefbff    ....    BL       add32 ; 0x80017be
        0x08002fc0:    68a0        .h      LDR      r0,[r4,#8]
        0x08002fc2:    aa01        ..      ADD      r2,sp,#4
        0x08002fc4:    6a41        Aj      LDR      r1,[r0,#0x24]
        0x08002fc6:    4668        hF      MOV      r0,sp
        0x08002fc8:    f004fab7    ....    BL       sub32 ; 0x800753a
        0x08002fcc:    68a0        .h      LDR      r0,[r4,#8]
        0x08002fce:    aa01        ..      ADD      r2,sp,#4
        0x08002fd0:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x08002fd2:    4668        hF      MOV      r0,sp
        0x08002fd4:    f004fab1    ....    BL       sub32 ; 0x800753a
        0x08002fd8:    68a1        .h      LDR      r1,[r4,#8]
        0x08002fda:    9800        ..      LDR      r0,[sp,#0]
        0x08002fdc:    aa01        ..      ADD      r2,sp,#4
        0x08002fde:    6088        .`      STR      r0,[r1,#8]
        0x08002fe0:    68a0        .h      LDR      r0,[r4,#8]
        0x08002fe2:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08002fe6:    68c0        .h      LDR      r0,[r0,#0xc]
        0x08002fe8:    9000        ..      STR      r0,[sp,#0]
        0x08002fea:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x08002fee:    2900        .)      CMP      r1,#0
        0x08002ff0:    da04        ..      BGE      0x8002ffc ; ecp_mod_p224 + 242
        0x08002ff2:    4249        IB      RSBS     r1,r1,#0
        0x08002ff4:    4668        hF      MOV      r0,sp
        0x08002ff6:    f004faa0    ....    BL       sub32 ; 0x800753a
        0x08002ffa:    e002        ..      B        0x8003002 ; ecp_mod_p224 + 248
        0x08002ffc:    4668        hF      MOV      r0,sp
        0x08002ffe:    f7fefbde    ....    BL       add32 ; 0x80017be
        0x08003002:    68a0        .h      LDR      r0,[r4,#8]
        0x08003004:    aa01        ..      ADD      r2,sp,#4
        0x08003006:    6a81        .j      LDR      r1,[r0,#0x28]
        0x08003008:    4668        hF      MOV      r0,sp
        0x0800300a:    f004fa96    ....    BL       sub32 ; 0x800753a
        0x0800300e:    68a0        .h      LDR      r0,[r4,#8]
        0x08003010:    aa01        ..      ADD      r2,sp,#4
        0x08003012:    69c1        .i      LDR      r1,[r0,#0x1c]
        0x08003014:    4668        hF      MOV      r0,sp
        0x08003016:    f7fefbd2    ....    BL       add32 ; 0x80017be
        0x0800301a:    68a0        .h      LDR      r0,[r4,#8]
        0x0800301c:    aa01        ..      ADD      r2,sp,#4
        0x0800301e:    6ac1        .j      LDR      r1,[r0,#0x2c]
        0x08003020:    4668        hF      MOV      r0,sp
        0x08003022:    f7fefbcc    ....    BL       add32 ; 0x80017be
        0x08003026:    68a1        .h      LDR      r1,[r4,#8]
        0x08003028:    9800        ..      LDR      r0,[sp,#0]
        0x0800302a:    60c8        .`      STR      r0,[r1,#0xc]
        0x0800302c:    68a0        .h      LDR      r0,[r4,#8]
        0x0800302e:    6900        .i      LDR      r0,[r0,#0x10]
        0x08003030:    e000        ..      B        0x8003034 ; ecp_mod_p224 + 298
        0x08003032:    e087        ..      B        0x8003144 ; ecp_mod_p224 + 570
        0x08003034:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003038:    9000        ..      STR      r0,[sp,#0]
        0x0800303a:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x0800303e:    2900        .)      CMP      r1,#0
        0x08003040:    aa01        ..      ADD      r2,sp,#4
        0x08003042:    da04        ..      BGE      0x800304e ; ecp_mod_p224 + 324
        0x08003044:    4249        IB      RSBS     r1,r1,#0
        0x08003046:    4668        hF      MOV      r0,sp
        0x08003048:    f004fa77    ..w.    BL       sub32 ; 0x800753a
        0x0800304c:    e002        ..      B        0x8003054 ; ecp_mod_p224 + 330
        0x0800304e:    4668        hF      MOV      r0,sp
        0x08003050:    f7fefbb5    ....    BL       add32 ; 0x80017be
        0x08003054:    68a0        .h      LDR      r0,[r4,#8]
        0x08003056:    aa01        ..      ADD      r2,sp,#4
        0x08003058:    6ac1        .j      LDR      r1,[r0,#0x2c]
        0x0800305a:    4668        hF      MOV      r0,sp
        0x0800305c:    f004fa6d    ..m.    BL       sub32 ; 0x800753a
        0x08003060:    68a0        .h      LDR      r0,[r4,#8]
        0x08003062:    aa01        ..      ADD      r2,sp,#4
        0x08003064:    6a01        .j      LDR      r1,[r0,#0x20]
        0x08003066:    4668        hF      MOV      r0,sp
        0x08003068:    f7fefba9    ....    BL       add32 ; 0x80017be
        0x0800306c:    68a0        .h      LDR      r0,[r4,#8]
        0x0800306e:    aa01        ..      ADD      r2,sp,#4
        0x08003070:    6b01        .k      LDR      r1,[r0,#0x30]
        0x08003072:    4668        hF      MOV      r0,sp
        0x08003074:    f7fefba3    ....    BL       add32 ; 0x80017be
        0x08003078:    68a1        .h      LDR      r1,[r4,#8]
        0x0800307a:    9800        ..      LDR      r0,[sp,#0]
        0x0800307c:    aa01        ..      ADD      r2,sp,#4
        0x0800307e:    6108        .a      STR      r0,[r1,#0x10]
        0x08003080:    68a0        .h      LDR      r0,[r4,#8]
        0x08003082:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003086:    6940        @i      LDR      r0,[r0,#0x14]
        0x08003088:    9000        ..      STR      r0,[sp,#0]
        0x0800308a:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x0800308e:    2900        .)      CMP      r1,#0
        0x08003090:    da04        ..      BGE      0x800309c ; ecp_mod_p224 + 402
        0x08003092:    4249        IB      RSBS     r1,r1,#0
        0x08003094:    4668        hF      MOV      r0,sp
        0x08003096:    f004fa50    ..P.    BL       sub32 ; 0x800753a
        0x0800309a:    e002        ..      B        0x80030a2 ; ecp_mod_p224 + 408
        0x0800309c:    4668        hF      MOV      r0,sp
        0x0800309e:    f7fefb8e    ....    BL       add32 ; 0x80017be
        0x080030a2:    68a0        .h      LDR      r0,[r4,#8]
        0x080030a4:    aa01        ..      ADD      r2,sp,#4
        0x080030a6:    6b01        .k      LDR      r1,[r0,#0x30]
        0x080030a8:    4668        hF      MOV      r0,sp
        0x080030aa:    f004fa46    ..F.    BL       sub32 ; 0x800753a
        0x080030ae:    68a0        .h      LDR      r0,[r4,#8]
        0x080030b0:    aa01        ..      ADD      r2,sp,#4
        0x080030b2:    6a41        Aj      LDR      r1,[r0,#0x24]
        0x080030b4:    4668        hF      MOV      r0,sp
        0x080030b6:    f7fefb82    ....    BL       add32 ; 0x80017be
        0x080030ba:    68a0        .h      LDR      r0,[r4,#8]
        0x080030bc:    aa01        ..      ADD      r2,sp,#4
        0x080030be:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x080030c0:    4668        hF      MOV      r0,sp
        0x080030c2:    f7fefb7c    ..|.    BL       add32 ; 0x80017be
        0x080030c6:    68a1        .h      LDR      r1,[r4,#8]
        0x080030c8:    9800        ..      LDR      r0,[sp,#0]
        0x080030ca:    aa01        ..      ADD      r2,sp,#4
        0x080030cc:    6148        Ha      STR      r0,[r1,#0x14]
        0x080030ce:    68a0        .h      LDR      r0,[r4,#8]
        0x080030d0:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x080030d4:    6980        .i      LDR      r0,[r0,#0x18]
        0x080030d6:    9000        ..      STR      r0,[sp,#0]
        0x080030d8:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x080030dc:    2900        .)      CMP      r1,#0
        0x080030de:    da04        ..      BGE      0x80030ea ; ecp_mod_p224 + 480
        0x080030e0:    4249        IB      RSBS     r1,r1,#0
        0x080030e2:    4668        hF      MOV      r0,sp
        0x080030e4:    f004fa29    ..).    BL       sub32 ; 0x800753a
        0x080030e8:    e002        ..      B        0x80030f0 ; ecp_mod_p224 + 486
        0x080030ea:    4668        hF      MOV      r0,sp
        0x080030ec:    f7fefb67    ..g.    BL       add32 ; 0x80017be
        0x080030f0:    68a0        .h      LDR      r0,[r4,#8]
        0x080030f2:    aa01        ..      ADD      r2,sp,#4
        0x080030f4:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x080030f6:    4668        hF      MOV      r0,sp
        0x080030f8:    f004fa1f    ....    BL       sub32 ; 0x800753a
        0x080030fc:    68a0        .h      LDR      r0,[r4,#8]
        0x080030fe:    aa01        ..      ADD      r2,sp,#4
        0x08003100:    6a81        .j      LDR      r1,[r0,#0x28]
        0x08003102:    4668        hF      MOV      r0,sp
        0x08003104:    f7fefb5b    ..[.    BL       add32 ; 0x80017be
        0x08003108:    68a1        .h      LDR      r1,[r4,#8]
        0x0800310a:    9800        ..      LDR      r0,[sp,#0]
        0x0800310c:    6188        .a      STR      r0,[r1,#0x18]
        0x0800310e:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003112:    2007        .       MOVS     r0,#7
        0x08003114:    2900        .)      CMP      r1,#0
        0x08003116:    dc00        ..      BGT      0x800311a ; ecp_mod_p224 + 528
        0x08003118:    2100        .!      MOVS     r1,#0
        0x0800311a:    68a2        .h      LDR      r2,[r4,#8]
        0x0800311c:    61d1        .a      STR      r1,[r2,#0x1c]
        0x0800311e:    9500        ..      STR      r5,[sp,#0]
        0x08003120:    e003        ..      B        0x800312a ; ecp_mod_p224 + 544
        0x08003122:    68a2        .h      LDR      r2,[r4,#8]
        0x08003124:    9900        ..      LDR      r1,[sp,#0]
        0x08003126:    f8421020    B. .    STR      r1,[r2,r0,LSL #2]
        0x0800312a:    6861        ah      LDR      r1,[r4,#4]
        0x0800312c:    1c40        @.      ADDS     r0,r0,#1
        0x0800312e:    4288        .B      CMP      r0,r1
        0x08003130:    d3f7        ..      BCC      0x8003122 ; ecp_mod_p224 + 536
        0x08003132:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003136:    2900        .)      CMP      r1,#0
        0x08003138:    da04        ..      BGE      0x8003144 ; ecp_mod_p224 + 570
        0x0800313a:    463b        ;F      MOV      r3,r7
        0x0800313c:    aa03        ..      ADD      r2,sp,#0xc
        0x0800313e:    4620         F      MOV      r0,r4
        0x08003140:    f001fbda    ....    BL       fix_negative ; 0x80048f8
        0x08003144:    b011        ..      ADD      sp,sp,#0x44
        0x08003146:    4630        0F      MOV      r0,r6
        0x08003148:    bdf0        ..      POP      {r4-r7,pc}
        0x0800314a:    0000        ..      MOVS     r0,r0
    i.ecp_mod_p255
    ecp_mod_p255
        0x0800314c:    b510        ..      PUSH     {r4,lr}
        0x0800314e:    4604        .F      MOV      r4,r0
        0x08003150:    6840        @h      LDR      r0,[r0,#4]
        0x08003152:    b08e        ..      SUB      sp,sp,#0x38
        0x08003154:    2808        .(      CMP      r0,#8
        0x08003156:    d202        ..      BCS      0x800315e ; ecp_mod_p255 + 18
        0x08003158:    2000        .       MOVS     r0,#0
        0x0800315a:    b00e        ..      ADD      sp,sp,#0x38
        0x0800315c:    bd10        ..      POP      {r4,pc}
        0x0800315e:    2001        .       MOVS     r0,#1
        0x08003160:    900a        ..      STR      r0,[sp,#0x28]
        0x08003162:    6860        `h      LDR      r0,[r4,#4]
        0x08003164:    1fc0        ..      SUBS     r0,r0,#7
        0x08003166:    900b        ..      STR      r0,[sp,#0x2c]
        0x08003168:    2809        .(      CMP      r0,#9
