openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x0800316a:    d901        ..      BLS      0x8003170 ; ecp_mod_p255 + 36
        0x0800316c:    481a        .H      LDR      r0,[pc,#104] ; [0x80031d8] = 0xffffb080
        0x0800316e:    e7f4        ..      B        0x800315a ; ecp_mod_p255 + 14
        0x08003170:    f8cdd030    ..0.    STR      sp,[sp,#0x30]
        0x08003174:    2128        (!      MOVS     r1,#0x28
        0x08003176:    4668        hF      MOV      r0,sp
        0x08003178:    f7fdf9f0    ....    BL       __aeabi_memclr4 ; 0x800055c
        0x0800317c:    980b        ..      LDR      r0,[sp,#0x2c]
        0x0800317e:    68a1        .h      LDR      r1,[r4,#8]
        0x08003180:    0082        ..      LSLS     r2,r0,#2
        0x08003182:    4668        hF      MOV      r0,sp
        0x08003184:    311c        .1      ADDS     r1,r1,#0x1c
        0x08003186:    f7fdf98a    ....    BL       __aeabi_memcpy4 ; 0x800049e
        0x0800318a:    211f        .!      MOVS     r1,#0x1f
        0x0800318c:    a80a        ..      ADD      r0,sp,#0x28
        0x0800318e:    f003fce9    ....    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x08003192:    2800        .(      CMP      r0,#0
        0x08003194:    d1e1        ..      BNE      0x800315a ; ecp_mod_p255 + 14
        0x08003196:    980b        ..      LDR      r0,[sp,#0x2c]
        0x08003198:    2200        ."      MOVS     r2,#0
        0x0800319a:    1c40        @.      ADDS     r0,r0,#1
        0x0800319c:    900b        ..      STR      r0,[sp,#0x2c]
        0x0800319e:    21ff        .!      MOVS     r1,#0xff
        0x080031a0:    4620         F      MOV      r0,r4
        0x080031a2:    f003fc64    ..d.    BL       mbedtls_mpi_set_bit ; 0x8006a6e
        0x080031a6:    2800        .(      CMP      r0,#0
        0x080031a8:    d1d7        ..      BNE      0x800315a ; ecp_mod_p255 + 14
        0x080031aa:    2008        .       MOVS     r0,#8
        0x080031ac:    2100        .!      MOVS     r1,#0
        0x080031ae:    e003        ..      B        0x80031b8 ; ecp_mod_p255 + 108
        0x080031b0:    68a2        .h      LDR      r2,[r4,#8]
        0x080031b2:    f8421020    B. .    STR      r1,[r2,r0,LSL #2]
        0x080031b6:    1c40        @.      ADDS     r0,r0,#1
        0x080031b8:    6862        bh      LDR      r2,[r4,#4]
        0x080031ba:    4282        .B      CMP      r2,r0
        0x080031bc:    d8f8        ..      BHI      0x80031b0 ; ecp_mod_p255 + 100
        0x080031be:    a90a        ..      ADD      r1,sp,#0x28
        0x080031c0:    2213        ."      MOVS     r2,#0x13
        0x080031c2:    4608        .F      MOV      r0,r1
        0x080031c4:    f003fa78    ..x.    BL       mbedtls_mpi_mul_int ; 0x80066b8
        0x080031c8:    2800        .(      CMP      r0,#0
        0x080031ca:    d1c6        ..      BNE      0x800315a ; ecp_mod_p255 + 14
        0x080031cc:    4621        !F      MOV      r1,r4
        0x080031ce:    aa0a        ..      ADD      r2,sp,#0x28
        0x080031d0:    4608        .F      MOV      r0,r1
        0x080031d2:    f002fccd    ....    BL       mbedtls_mpi_add_abs ; 0x8005b70
        0x080031d6:    e7c0        ..      B        0x800315a ; ecp_mod_p255 + 14
    $d
        0x080031d8:    ffffb080    ....    DCD    4294946944
    $t
    i.ecp_mod_p256
    ecp_mod_p256
        0x080031dc:    b5f0        ..      PUSH     {r4-r7,lr}
        0x080031de:    b091        ..      SUB      sp,sp,#0x44
        0x080031e0:    4604        .F      MOV      r4,r0
        0x080031e2:    2001        .       MOVS     r0,#1
        0x080031e4:    9003        ..      STR      r0,[sp,#0xc]
        0x080031e6:    2009        .       MOVS     r0,#9
        0x080031e8:    9004        ..      STR      r0,[sp,#0x10]
        0x080031ea:    2500        .%      MOVS     r5,#0
        0x080031ec:    a806        ..      ADD      r0,sp,#0x18
        0x080031ee:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x080031f2:    f44f7780    O..w    MOV      r7,#0x100
        0x080031f6:    2124        $!      MOVS     r1,#0x24
        0x080031f8:    9005        ..      STR      r0,[sp,#0x14]
        0x080031fa:    f7fdf9af    ....    BL       __aeabi_memclr4 ; 0x800055c
        0x080031fe:    2110        .!      MOVS     r1,#0x10
        0x08003200:    4620         F      MOV      r0,r4
        0x08003202:    f003f891    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x08003206:    0006        ..      MOVS     r6,r0
        0x08003208:    d171        q.      BNE      0x80032ee ; ecp_mod_p256 + 274
        0x0800320a:    68a0        .h      LDR      r0,[r4,#8]
        0x0800320c:    aa01        ..      ADD      r2,sp,#4
        0x0800320e:    6800        .h      LDR      r0,[r0,#0]
        0x08003210:    9000        ..      STR      r0,[sp,#0]
        0x08003212:    68a0        .h      LDR      r0,[r4,#8]
        0x08003214:    6a01        .j      LDR      r1,[r0,#0x20]
        0x08003216:    4668        hF      MOV      r0,sp
        0x08003218:    f7fefad1    ....    BL       add32 ; 0x80017be
        0x0800321c:    68a0        .h      LDR      r0,[r4,#8]
        0x0800321e:    aa01        ..      ADD      r2,sp,#4
        0x08003220:    6a41        Aj      LDR      r1,[r0,#0x24]
        0x08003222:    4668        hF      MOV      r0,sp
        0x08003224:    f7fefacb    ....    BL       add32 ; 0x80017be
        0x08003228:    68a0        .h      LDR      r0,[r4,#8]
        0x0800322a:    aa01        ..      ADD      r2,sp,#4
        0x0800322c:    6ac1        .j      LDR      r1,[r0,#0x2c]
        0x0800322e:    4668        hF      MOV      r0,sp
        0x08003230:    f004f983    ....    BL       sub32 ; 0x800753a
        0x08003234:    68a0        .h      LDR      r0,[r4,#8]
        0x08003236:    aa01        ..      ADD      r2,sp,#4
        0x08003238:    6b01        .k      LDR      r1,[r0,#0x30]
        0x0800323a:    4668        hF      MOV      r0,sp
        0x0800323c:    f004f97d    ..}.    BL       sub32 ; 0x800753a
        0x08003240:    68a0        .h      LDR      r0,[r4,#8]
        0x08003242:    aa01        ..      ADD      r2,sp,#4
        0x08003244:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x08003246:    4668        hF      MOV      r0,sp
        0x08003248:    f004f977    ..w.    BL       sub32 ; 0x800753a
        0x0800324c:    68a0        .h      LDR      r0,[r4,#8]
        0x0800324e:    aa01        ..      ADD      r2,sp,#4
        0x08003250:    6b81        .k      LDR      r1,[r0,#0x38]
        0x08003252:    4668        hF      MOV      r0,sp
        0x08003254:    f004f971    ..q.    BL       sub32 ; 0x800753a
        0x08003258:    68a1        .h      LDR      r1,[r4,#8]
        0x0800325a:    9800        ..      LDR      r0,[sp,#0]
        0x0800325c:    aa01        ..      ADD      r2,sp,#4
        0x0800325e:    6008        .`      STR      r0,[r1,#0]
        0x08003260:    68a0        .h      LDR      r0,[r4,#8]
        0x08003262:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003266:    6840        @h      LDR      r0,[r0,#4]
        0x08003268:    9000        ..      STR      r0,[sp,#0]
        0x0800326a:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x0800326e:    2900        .)      CMP      r1,#0
        0x08003270:    da04        ..      BGE      0x800327c ; ecp_mod_p256 + 160
        0x08003272:    4249        IB      RSBS     r1,r1,#0
        0x08003274:    4668        hF      MOV      r0,sp
        0x08003276:    f004f960    ..`.    BL       sub32 ; 0x800753a
        0x0800327a:    e002        ..      B        0x8003282 ; ecp_mod_p256 + 166
        0x0800327c:    4668        hF      MOV      r0,sp
        0x0800327e:    f7fefa9e    ....    BL       add32 ; 0x80017be
        0x08003282:    68a0        .h      LDR      r0,[r4,#8]
        0x08003284:    aa01        ..      ADD      r2,sp,#4
        0x08003286:    6a41        Aj      LDR      r1,[r0,#0x24]
        0x08003288:    4668        hF      MOV      r0,sp
        0x0800328a:    f7fefa98    ....    BL       add32 ; 0x80017be
        0x0800328e:    68a0        .h      LDR      r0,[r4,#8]
        0x08003290:    aa01        ..      ADD      r2,sp,#4
        0x08003292:    6a81        .j      LDR      r1,[r0,#0x28]
        0x08003294:    4668        hF      MOV      r0,sp
        0x08003296:    f7fefa92    ....    BL       add32 ; 0x80017be
        0x0800329a:    68a0        .h      LDR      r0,[r4,#8]
        0x0800329c:    aa01        ..      ADD      r2,sp,#4
        0x0800329e:    6b01        .k      LDR      r1,[r0,#0x30]
        0x080032a0:    4668        hF      MOV      r0,sp
        0x080032a2:    f004f94a    ..J.    BL       sub32 ; 0x800753a
        0x080032a6:    68a0        .h      LDR      r0,[r4,#8]
        0x080032a8:    aa01        ..      ADD      r2,sp,#4
        0x080032aa:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x080032ac:    4668        hF      MOV      r0,sp
        0x080032ae:    f004f944    ..D.    BL       sub32 ; 0x800753a
        0x080032b2:    68a0        .h      LDR      r0,[r4,#8]
        0x080032b4:    aa01        ..      ADD      r2,sp,#4
        0x080032b6:    6b81        .k      LDR      r1,[r0,#0x38]
        0x080032b8:    4668        hF      MOV      r0,sp
        0x080032ba:    f004f93e    ..>.    BL       sub32 ; 0x800753a
        0x080032be:    68a0        .h      LDR      r0,[r4,#8]
        0x080032c0:    aa01        ..      ADD      r2,sp,#4
        0x080032c2:    6bc1        .k      LDR      r1,[r0,#0x3c]
        0x080032c4:    4668        hF      MOV      r0,sp
        0x080032c6:    f004f938    ..8.    BL       sub32 ; 0x800753a
        0x080032ca:    68a1        .h      LDR      r1,[r4,#8]
        0x080032cc:    9800        ..      LDR      r0,[sp,#0]
        0x080032ce:    aa01        ..      ADD      r2,sp,#4
        0x080032d0:    6048        H`      STR      r0,[r1,#4]
        0x080032d2:    68a0        .h      LDR      r0,[r4,#8]
        0x080032d4:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x080032d8:    6880        .h      LDR      r0,[r0,#8]
        0x080032da:    9000        ..      STR      r0,[sp,#0]
        0x080032dc:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x080032e0:    2900        .)      CMP      r1,#0
        0x080032e2:    da05        ..      BGE      0x80032f0 ; ecp_mod_p256 + 276
        0x080032e4:    4249        IB      RSBS     r1,r1,#0
        0x080032e6:    4668        hF      MOV      r0,sp
        0x080032e8:    f004f927    ..'.    BL       sub32 ; 0x800753a
        0x080032ec:    e003        ..      B        0x80032f6 ; ecp_mod_p256 + 282
        0x080032ee:    e18b        ..      B        0x8003608 ; ecp_mod_p256 + 1068
        0x080032f0:    4668        hF      MOV      r0,sp
        0x080032f2:    f7fefa64    ..d.    BL       add32 ; 0x80017be
        0x080032f6:    68a0        .h      LDR      r0,[r4,#8]
        0x080032f8:    aa01        ..      ADD      r2,sp,#4
        0x080032fa:    6a81        .j      LDR      r1,[r0,#0x28]
        0x080032fc:    4668        hF      MOV      r0,sp
        0x080032fe:    f7fefa5e    ..^.    BL       add32 ; 0x80017be
        0x08003302:    68a0        .h      LDR      r0,[r4,#8]
        0x08003304:    aa01        ..      ADD      r2,sp,#4
        0x08003306:    6ac1        .j      LDR      r1,[r0,#0x2c]
        0x08003308:    4668        hF      MOV      r0,sp
        0x0800330a:    f7fefa58    ..X.    BL       add32 ; 0x80017be
        0x0800330e:    68a0        .h      LDR      r0,[r4,#8]
        0x08003310:    aa01        ..      ADD      r2,sp,#4
        0x08003312:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x08003314:    4668        hF      MOV      r0,sp
        0x08003316:    f004f910    ....    BL       sub32 ; 0x800753a
        0x0800331a:    68a0        .h      LDR      r0,[r4,#8]
        0x0800331c:    aa01        ..      ADD      r2,sp,#4
        0x0800331e:    6b81        .k      LDR      r1,[r0,#0x38]
        0x08003320:    4668        hF      MOV      r0,sp
        0x08003322:    f004f90a    ....    BL       sub32 ; 0x800753a
        0x08003326:    68a0        .h      LDR      r0,[r4,#8]
        0x08003328:    aa01        ..      ADD      r2,sp,#4
        0x0800332a:    6bc1        .k      LDR      r1,[r0,#0x3c]
        0x0800332c:    4668        hF      MOV      r0,sp
        0x0800332e:    f004f904    ....    BL       sub32 ; 0x800753a
        0x08003332:    68a1        .h      LDR      r1,[r4,#8]
        0x08003334:    9800        ..      LDR      r0,[sp,#0]
        0x08003336:    aa01        ..      ADD      r2,sp,#4
        0x08003338:    6088        .`      STR      r0,[r1,#8]
        0x0800333a:    68a0        .h      LDR      r0,[r4,#8]
        0x0800333c:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003340:    68c0        .h      LDR      r0,[r0,#0xc]
        0x08003342:    9000        ..      STR      r0,[sp,#0]
        0x08003344:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x08003348:    2900        .)      CMP      r1,#0
        0x0800334a:    da04        ..      BGE      0x8003356 ; ecp_mod_p256 + 378
        0x0800334c:    4249        IB      RSBS     r1,r1,#0
        0x0800334e:    4668        hF      MOV      r0,sp
        0x08003350:    f004f8f3    ....    BL       sub32 ; 0x800753a
        0x08003354:    e002        ..      B        0x800335c ; ecp_mod_p256 + 384
        0x08003356:    4668        hF      MOV      r0,sp
        0x08003358:    f7fefa31    ..1.    BL       add32 ; 0x80017be
        0x0800335c:    68a0        .h      LDR      r0,[r4,#8]
        0x0800335e:    aa01        ..      ADD      r2,sp,#4
        0x08003360:    6ac1        .j      LDR      r1,[r0,#0x2c]
        0x08003362:    4668        hF      MOV      r0,sp
        0x08003364:    f7fefa2b    ..+.    BL       add32 ; 0x80017be
        0x08003368:    68a0        .h      LDR      r0,[r4,#8]
        0x0800336a:    aa01        ..      ADD      r2,sp,#4
        0x0800336c:    6ac1        .j      LDR      r1,[r0,#0x2c]
        0x0800336e:    4668        hF      MOV      r0,sp
        0x08003370:    f7fefa25    ..%.    BL       add32 ; 0x80017be
        0x08003374:    68a0        .h      LDR      r0,[r4,#8]
        0x08003376:    aa01        ..      ADD      r2,sp,#4
        0x08003378:    6b01        .k      LDR      r1,[r0,#0x30]
        0x0800337a:    4668        hF      MOV      r0,sp
        0x0800337c:    f7fefa1f    ....    BL       add32 ; 0x80017be
        0x08003380:    68a0        .h      LDR      r0,[r4,#8]
        0x08003382:    aa01        ..      ADD      r2,sp,#4
        0x08003384:    6b01        .k      LDR      r1,[r0,#0x30]
        0x08003386:    4668        hF      MOV      r0,sp
        0x08003388:    f7fefa19    ....    BL       add32 ; 0x80017be
        0x0800338c:    68a0        .h      LDR      r0,[r4,#8]
        0x0800338e:    aa01        ..      ADD      r2,sp,#4
        0x08003390:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x08003392:    4668        hF      MOV      r0,sp
        0x08003394:    f7fefa13    ....    BL       add32 ; 0x80017be
        0x08003398:    68a0        .h      LDR      r0,[r4,#8]
        0x0800339a:    aa01        ..      ADD      r2,sp,#4
        0x0800339c:    6bc1        .k      LDR      r1,[r0,#0x3c]
        0x0800339e:    4668        hF      MOV      r0,sp
        0x080033a0:    f004f8cb    ....    BL       sub32 ; 0x800753a
        0x080033a4:    68a0        .h      LDR      r0,[r4,#8]
        0x080033a6:    aa01        ..      ADD      r2,sp,#4
        0x080033a8:    6a01        .j      LDR      r1,[r0,#0x20]
        0x080033aa:    4668        hF      MOV      r0,sp
        0x080033ac:    f004f8c5    ....    BL       sub32 ; 0x800753a
        0x080033b0:    68a0        .h      LDR      r0,[r4,#8]
        0x080033b2:    aa01        ..      ADD      r2,sp,#4
        0x080033b4:    6a41        Aj      LDR      r1,[r0,#0x24]
        0x080033b6:    4668        hF      MOV      r0,sp
        0x080033b8:    f004f8bf    ....    BL       sub32 ; 0x800753a
        0x080033bc:    68a1        .h      LDR      r1,[r4,#8]
        0x080033be:    9800        ..      LDR      r0,[sp,#0]
        0x080033c0:    aa01        ..      ADD      r2,sp,#4
        0x080033c2:    60c8        .`      STR      r0,[r1,#0xc]
        0x080033c4:    68a0        .h      LDR      r0,[r4,#8]
        0x080033c6:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x080033ca:    6900        .i      LDR      r0,[r0,#0x10]
        0x080033cc:    9000        ..      STR      r0,[sp,#0]
        0x080033ce:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x080033d2:    2900        .)      CMP      r1,#0
        0x080033d4:    da04        ..      BGE      0x80033e0 ; ecp_mod_p256 + 516
        0x080033d6:    4249        IB      RSBS     r1,r1,#0
        0x080033d8:    4668        hF      MOV      r0,sp
        0x080033da:    f004f8ae    ....    BL       sub32 ; 0x800753a
        0x080033de:    e002        ..      B        0x80033e6 ; ecp_mod_p256 + 522
        0x080033e0:    4668        hF      MOV      r0,sp
        0x080033e2:    f7fef9ec    ....    BL       add32 ; 0x80017be
        0x080033e6:    68a0        .h      LDR      r0,[r4,#8]
        0x080033e8:    aa01        ..      ADD      r2,sp,#4
        0x080033ea:    6b01        .k      LDR      r1,[r0,#0x30]
        0x080033ec:    4668        hF      MOV      r0,sp
        0x080033ee:    f7fef9e6    ....    BL       add32 ; 0x80017be
        0x080033f2:    68a0        .h      LDR      r0,[r4,#8]
        0x080033f4:    aa01        ..      ADD      r2,sp,#4
        0x080033f6:    6b01        .k      LDR      r1,[r0,#0x30]
        0x080033f8:    4668        hF      MOV      r0,sp
        0x080033fa:    f7fef9e0    ....    BL       add32 ; 0x80017be
        0x080033fe:    68a0        .h      LDR      r0,[r4,#8]
        0x08003400:    aa01        ..      ADD      r2,sp,#4
        0x08003402:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x08003404:    4668        hF      MOV      r0,sp
        0x08003406:    f7fef9da    ....    BL       add32 ; 0x80017be
        0x0800340a:    68a0        .h      LDR      r0,[r4,#8]
        0x0800340c:    aa01        ..      ADD      r2,sp,#4
        0x0800340e:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x08003410:    4668        hF      MOV      r0,sp
        0x08003412:    f7fef9d4    ....    BL       add32 ; 0x80017be
        0x08003416:    68a0        .h      LDR      r0,[r4,#8]
        0x08003418:    aa01        ..      ADD      r2,sp,#4
        0x0800341a:    6b81        .k      LDR      r1,[r0,#0x38]
        0x0800341c:    4668        hF      MOV      r0,sp
        0x0800341e:    f7fef9ce    ....    BL       add32 ; 0x80017be
        0x08003422:    68a0        .h      LDR      r0,[r4,#8]
        0x08003424:    aa01        ..      ADD      r2,sp,#4
        0x08003426:    6a41        Aj      LDR      r1,[r0,#0x24]
        0x08003428:    4668        hF      MOV      r0,sp
        0x0800342a:    f004f886    ....    BL       sub32 ; 0x800753a
        0x0800342e:    68a0        .h      LDR      r0,[r4,#8]
        0x08003430:    aa01        ..      ADD      r2,sp,#4
        0x08003432:    6a81        .j      LDR      r1,[r0,#0x28]
        0x08003434:    4668        hF      MOV      r0,sp
        0x08003436:    f004f880    ....    BL       sub32 ; 0x800753a
        0x0800343a:    68a1        .h      LDR      r1,[r4,#8]
        0x0800343c:    9800        ..      LDR      r0,[sp,#0]
        0x0800343e:    aa01        ..      ADD      r2,sp,#4
        0x08003440:    6108        .a      STR      r0,[r1,#0x10]
        0x08003442:    68a0        .h      LDR      r0,[r4,#8]
        0x08003444:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003448:    6940        @i      LDR      r0,[r0,#0x14]
        0x0800344a:    9000        ..      STR      r0,[sp,#0]
        0x0800344c:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x08003450:    2900        .)      CMP      r1,#0
        0x08003452:    da04        ..      BGE      0x800345e ; ecp_mod_p256 + 642
        0x08003454:    4249        IB      RSBS     r1,r1,#0
        0x08003456:    4668        hF      MOV      r0,sp
        0x08003458:    f004f86f    ..o.    BL       sub32 ; 0x800753a
        0x0800345c:    e002        ..      B        0x8003464 ; ecp_mod_p256 + 648
        0x0800345e:    4668        hF      MOV      r0,sp
        0x08003460:    f7fef9ad    ....    BL       add32 ; 0x80017be
        0x08003464:    68a0        .h      LDR      r0,[r4,#8]
        0x08003466:    aa01        ..      ADD      r2,sp,#4
        0x08003468:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x0800346a:    4668        hF      MOV      r0,sp
        0x0800346c:    f7fef9a7    ....    BL       add32 ; 0x80017be
        0x08003470:    68a0        .h      LDR      r0,[r4,#8]
        0x08003472:    aa01        ..      ADD      r2,sp,#4
        0x08003474:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x08003476:    4668        hF      MOV      r0,sp
        0x08003478:    f7fef9a1    ....    BL       add32 ; 0x80017be
        0x0800347c:    68a0        .h      LDR      r0,[r4,#8]
        0x0800347e:    aa01        ..      ADD      r2,sp,#4
        0x08003480:    6b81        .k      LDR      r1,[r0,#0x38]
        0x08003482:    4668        hF      MOV      r0,sp
        0x08003484:    f7fef99b    ....    BL       add32 ; 0x80017be
        0x08003488:    68a0        .h      LDR      r0,[r4,#8]
        0x0800348a:    aa01        ..      ADD      r2,sp,#4
        0x0800348c:    6b81        .k      LDR      r1,[r0,#0x38]
        0x0800348e:    4668        hF      MOV      r0,sp
        0x08003490:    f7fef995    ....    BL       add32 ; 0x80017be
        0x08003494:    68a0        .h      LDR      r0,[r4,#8]
        0x08003496:    aa01        ..      ADD      r2,sp,#4
        0x08003498:    6bc1        .k      LDR      r1,[r0,#0x3c]
        0x0800349a:    4668        hF      MOV      r0,sp
        0x0800349c:    f7fef98f    ....    BL       add32 ; 0x80017be
        0x080034a0:    68a0        .h      LDR      r0,[r4,#8]
        0x080034a2:    aa01        ..      ADD      r2,sp,#4
        0x080034a4:    6a81        .j      LDR      r1,[r0,#0x28]
        0x080034a6:    4668        hF      MOV      r0,sp
        0x080034a8:    f004f847    ..G.    BL       sub32 ; 0x800753a
        0x080034ac:    68a0        .h      LDR      r0,[r4,#8]
        0x080034ae:    aa01        ..      ADD      r2,sp,#4
        0x080034b0:    6ac1        .j      LDR      r1,[r0,#0x2c]
        0x080034b2:    4668        hF      MOV      r0,sp
        0x080034b4:    f004f841    ..A.    BL       sub32 ; 0x800753a
        0x080034b8:    68a1        .h      LDR      r1,[r4,#8]
        0x080034ba:    9800        ..      LDR      r0,[sp,#0]
        0x080034bc:    aa01        ..      ADD      r2,sp,#4
        0x080034be:    6148        Ha      STR      r0,[r1,#0x14]
        0x080034c0:    68a0        .h      LDR      r0,[r4,#8]
        0x080034c2:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x080034c6:    6980        .i      LDR      r0,[r0,#0x18]
        0x080034c8:    9000        ..      STR      r0,[sp,#0]
        0x080034ca:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x080034ce:    2900        .)      CMP      r1,#0
        0x080034d0:    da04        ..      BGE      0x80034dc ; ecp_mod_p256 + 768
        0x080034d2:    4249        IB      RSBS     r1,r1,#0
        0x080034d4:    4668        hF      MOV      r0,sp
