openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x080034d6:    f004f830    ..0.    BL       sub32 ; 0x800753a
        0x080034da:    e002        ..      B        0x80034e2 ; ecp_mod_p256 + 774
        0x080034dc:    4668        hF      MOV      r0,sp
        0x080034de:    f7fef96e    ..n.    BL       add32 ; 0x80017be
        0x080034e2:    68a0        .h      LDR      r0,[r4,#8]
        0x080034e4:    aa01        ..      ADD      r2,sp,#4
        0x080034e6:    6b81        .k      LDR      r1,[r0,#0x38]
        0x080034e8:    4668        hF      MOV      r0,sp
        0x080034ea:    f7fef968    ..h.    BL       add32 ; 0x80017be
        0x080034ee:    68a0        .h      LDR      r0,[r4,#8]
        0x080034f0:    aa01        ..      ADD      r2,sp,#4
        0x080034f2:    6b81        .k      LDR      r1,[r0,#0x38]
        0x080034f4:    4668        hF      MOV      r0,sp
        0x080034f6:    f7fef962    ..b.    BL       add32 ; 0x80017be
        0x080034fa:    68a0        .h      LDR      r0,[r4,#8]
        0x080034fc:    aa01        ..      ADD      r2,sp,#4
        0x080034fe:    6bc1        .k      LDR      r1,[r0,#0x3c]
        0x08003500:    4668        hF      MOV      r0,sp
        0x08003502:    f7fef95c    ..\.    BL       add32 ; 0x80017be
        0x08003506:    68a0        .h      LDR      r0,[r4,#8]
        0x08003508:    aa01        ..      ADD      r2,sp,#4
        0x0800350a:    6bc1        .k      LDR      r1,[r0,#0x3c]
        0x0800350c:    4668        hF      MOV      r0,sp
        0x0800350e:    f7fef956    ..V.    BL       add32 ; 0x80017be
        0x08003512:    68a0        .h      LDR      r0,[r4,#8]
        0x08003514:    aa01        ..      ADD      r2,sp,#4
        0x08003516:    6b81        .k      LDR      r1,[r0,#0x38]
        0x08003518:    4668        hF      MOV      r0,sp
        0x0800351a:    f7fef950    ..P.    BL       add32 ; 0x80017be
        0x0800351e:    68a0        .h      LDR      r0,[r4,#8]
        0x08003520:    aa01        ..      ADD      r2,sp,#4
        0x08003522:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x08003524:    4668        hF      MOV      r0,sp
        0x08003526:    f7fef94a    ..J.    BL       add32 ; 0x80017be
        0x0800352a:    68a0        .h      LDR      r0,[r4,#8]
        0x0800352c:    aa01        ..      ADD      r2,sp,#4
        0x0800352e:    6a01        .j      LDR      r1,[r0,#0x20]
        0x08003530:    4668        hF      MOV      r0,sp
        0x08003532:    f004f802    ....    BL       sub32 ; 0x800753a
        0x08003536:    68a0        .h      LDR      r0,[r4,#8]
        0x08003538:    aa01        ..      ADD      r2,sp,#4
        0x0800353a:    6a41        Aj      LDR      r1,[r0,#0x24]
        0x0800353c:    4668        hF      MOV      r0,sp
        0x0800353e:    f003fffc    ....    BL       sub32 ; 0x800753a
        0x08003542:    68a1        .h      LDR      r1,[r4,#8]
        0x08003544:    9800        ..      LDR      r0,[sp,#0]
        0x08003546:    aa01        ..      ADD      r2,sp,#4
        0x08003548:    6188        .a      STR      r0,[r1,#0x18]
        0x0800354a:    68a0        .h      LDR      r0,[r4,#8]
        0x0800354c:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003550:    69c0        .i      LDR      r0,[r0,#0x1c]
        0x08003552:    9000        ..      STR      r0,[sp,#0]
        0x08003554:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x08003558:    2900        .)      CMP      r1,#0
        0x0800355a:    da04        ..      BGE      0x8003566 ; ecp_mod_p256 + 906
        0x0800355c:    4249        IB      RSBS     r1,r1,#0
        0x0800355e:    4668        hF      MOV      r0,sp
        0x08003560:    f003ffeb    ....    BL       sub32 ; 0x800753a
        0x08003564:    e002        ..      B        0x800356c ; ecp_mod_p256 + 912
        0x08003566:    4668        hF      MOV      r0,sp
        0x08003568:    f7fef929    ..).    BL       add32 ; 0x80017be
        0x0800356c:    68a0        .h      LDR      r0,[r4,#8]
        0x0800356e:    aa01        ..      ADD      r2,sp,#4
        0x08003570:    6bc1        .k      LDR      r1,[r0,#0x3c]
        0x08003572:    4668        hF      MOV      r0,sp
        0x08003574:    f7fef923    ..#.    BL       add32 ; 0x80017be
        0x08003578:    68a0        .h      LDR      r0,[r4,#8]
        0x0800357a:    aa01        ..      ADD      r2,sp,#4
        0x0800357c:    6bc1        .k      LDR      r1,[r0,#0x3c]
        0x0800357e:    4668        hF      MOV      r0,sp
        0x08003580:    f7fef91d    ....    BL       add32 ; 0x80017be
        0x08003584:    68a0        .h      LDR      r0,[r4,#8]
        0x08003586:    aa01        ..      ADD      r2,sp,#4
        0x08003588:    6bc1        .k      LDR      r1,[r0,#0x3c]
        0x0800358a:    4668        hF      MOV      r0,sp
        0x0800358c:    f7fef917    ....    BL       add32 ; 0x80017be
        0x08003590:    68a0        .h      LDR      r0,[r4,#8]
        0x08003592:    aa01        ..      ADD      r2,sp,#4
        0x08003594:    6a01        .j      LDR      r1,[r0,#0x20]
        0x08003596:    4668        hF      MOV      r0,sp
        0x08003598:    f7fef911    ....    BL       add32 ; 0x80017be
        0x0800359c:    68a0        .h      LDR      r0,[r4,#8]
        0x0800359e:    aa01        ..      ADD      r2,sp,#4
        0x080035a0:    6a81        .j      LDR      r1,[r0,#0x28]
        0x080035a2:    4668        hF      MOV      r0,sp
        0x080035a4:    f003ffc9    ....    BL       sub32 ; 0x800753a
        0x080035a8:    68a0        .h      LDR      r0,[r4,#8]
        0x080035aa:    aa01        ..      ADD      r2,sp,#4
        0x080035ac:    6ac1        .j      LDR      r1,[r0,#0x2c]
        0x080035ae:    4668        hF      MOV      r0,sp
        0x080035b0:    f003ffc3    ....    BL       sub32 ; 0x800753a
        0x080035b4:    68a0        .h      LDR      r0,[r4,#8]
        0x080035b6:    aa01        ..      ADD      r2,sp,#4
        0x080035b8:    6b01        .k      LDR      r1,[r0,#0x30]
        0x080035ba:    4668        hF      MOV      r0,sp
        0x080035bc:    f003ffbd    ....    BL       sub32 ; 0x800753a
        0x080035c0:    68a0        .h      LDR      r0,[r4,#8]
        0x080035c2:    aa01        ..      ADD      r2,sp,#4
        0x080035c4:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x080035c6:    4668        hF      MOV      r0,sp
        0x080035c8:    f003ffb7    ....    BL       sub32 ; 0x800753a
        0x080035cc:    68a1        .h      LDR      r1,[r4,#8]
        0x080035ce:    9800        ..      LDR      r0,[sp,#0]
        0x080035d0:    61c8        .a      STR      r0,[r1,#0x1c]
        0x080035d2:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x080035d6:    2008        .       MOVS     r0,#8
        0x080035d8:    2900        .)      CMP      r1,#0
        0x080035da:    dc00        ..      BGT      0x80035de ; ecp_mod_p256 + 1026
        0x080035dc:    2100        .!      MOVS     r1,#0
        0x080035de:    68a2        .h      LDR      r2,[r4,#8]
        0x080035e0:    6211        .b      STR      r1,[r2,#0x20]
        0x080035e2:    9500        ..      STR      r5,[sp,#0]
        0x080035e4:    e003        ..      B        0x80035ee ; ecp_mod_p256 + 1042
        0x080035e6:    68a2        .h      LDR      r2,[r4,#8]
        0x080035e8:    9900        ..      LDR      r1,[sp,#0]
        0x080035ea:    f8421020    B. .    STR      r1,[r2,r0,LSL #2]
        0x080035ee:    6861        ah      LDR      r1,[r4,#4]
        0x080035f0:    1c40        @.      ADDS     r0,r0,#1
        0x080035f2:    4288        .B      CMP      r0,r1
        0x080035f4:    d3f7        ..      BCC      0x80035e6 ; ecp_mod_p256 + 1034
        0x080035f6:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x080035fa:    2900        .)      CMP      r1,#0
        0x080035fc:    da04        ..      BGE      0x8003608 ; ecp_mod_p256 + 1068
        0x080035fe:    463b        ;F      MOV      r3,r7
        0x08003600:    aa03        ..      ADD      r2,sp,#0xc
        0x08003602:    4620         F      MOV      r0,r4
        0x08003604:    f001f978    ..x.    BL       fix_negative ; 0x80048f8
        0x08003608:    b011        ..      ADD      sp,sp,#0x44
        0x0800360a:    4630        0F      MOV      r0,r6
        0x0800360c:    bdf0        ..      POP      {r4-r7,pc}
        0x0800360e:    0000        ..      MOVS     r0,r0
    i.ecp_mod_p256k1
    ecp_mod_p256k1
        0x08003610:    b51c        ..      PUSH     {r2-r4,lr}
        0x08003612:    2100        .!      MOVS     r1,#0
        0x08003614:    9100        ..      STR      r1,[sp,#0]
        0x08003616:    460b        .F      MOV      r3,r1
        0x08003618:    9101        ..      STR      r1,[sp,#4]
        0x0800361a:    2208        ."      MOVS     r2,#8
        0x0800361c:    4901        .I      LDR      r1,[pc,#4] ; [0x8003624] = 0x20000034
        0x0800361e:    f7fffb83    ....    BL       ecp_mod_koblitz ; 0x8002d28
        0x08003622:    bd1c        ..      POP      {r2-r4,pc}
    $d
        0x08003624:    20000034    4..     DCD    536870964
    $t
    i.ecp_mod_p384
    ecp_mod_p384
        0x08003628:    b5f0        ..      PUSH     {r4-r7,lr}
        0x0800362a:    b095        ..      SUB      sp,sp,#0x54
        0x0800362c:    4604        .F      MOV      r4,r0
        0x0800362e:    2001        .       MOVS     r0,#1
        0x08003630:    9003        ..      STR      r0,[sp,#0xc]
        0x08003632:    200d        .       MOVS     r0,#0xd
        0x08003634:    9004        ..      STR      r0,[sp,#0x10]
        0x08003636:    2500        .%      MOVS     r5,#0
        0x08003638:    a806        ..      ADD      r0,sp,#0x18
        0x0800363a:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x0800363e:    f44f77c0    O..w    MOV      r7,#0x180
        0x08003642:    2134        4!      MOVS     r1,#0x34
        0x08003644:    9005        ..      STR      r0,[sp,#0x14]
        0x08003646:    f7fcff89    ....    BL       __aeabi_memclr4 ; 0x800055c
        0x0800364a:    2118        .!      MOVS     r1,#0x18
        0x0800364c:    4620         F      MOV      r0,r4
        0x0800364e:    f002fe6b    ..k.    BL       mbedtls_mpi_grow ; 0x8006328
        0x08003652:    0006        ..      MOVS     r6,r0
        0x08003654:    d17e        ~.      BNE      0x8003754 ; ecp_mod_p384 + 300
        0x08003656:    68a0        .h      LDR      r0,[r4,#8]
        0x08003658:    aa01        ..      ADD      r2,sp,#4
        0x0800365a:    6800        .h      LDR      r0,[r0,#0]
        0x0800365c:    9000        ..      STR      r0,[sp,#0]
        0x0800365e:    68a0        .h      LDR      r0,[r4,#8]
        0x08003660:    6b01        .k      LDR      r1,[r0,#0x30]
        0x08003662:    4668        hF      MOV      r0,sp
        0x08003664:    f7fef8ab    ....    BL       add32 ; 0x80017be
        0x08003668:    68a0        .h      LDR      r0,[r4,#8]
        0x0800366a:    aa01        ..      ADD      r2,sp,#4
        0x0800366c:    6d41        Am      LDR      r1,[r0,#0x54]
        0x0800366e:    4668        hF      MOV      r0,sp
        0x08003670:    f7fef8a5    ....    BL       add32 ; 0x80017be
        0x08003674:    68a0        .h      LDR      r0,[r4,#8]
        0x08003676:    aa01        ..      ADD      r2,sp,#4
        0x08003678:    6d01        .m      LDR      r1,[r0,#0x50]
        0x0800367a:    4668        hF      MOV      r0,sp
        0x0800367c:    f7fef89f    ....    BL       add32 ; 0x80017be
        0x08003680:    68a0        .h      LDR      r0,[r4,#8]
        0x08003682:    aa01        ..      ADD      r2,sp,#4
        0x08003684:    6dc1        .m      LDR      r1,[r0,#0x5c]
        0x08003686:    4668        hF      MOV      r0,sp
        0x08003688:    f003ff57    ..W.    BL       sub32 ; 0x800753a
        0x0800368c:    68a1        .h      LDR      r1,[r4,#8]
        0x0800368e:    9800        ..      LDR      r0,[sp,#0]
        0x08003690:    aa01        ..      ADD      r2,sp,#4
        0x08003692:    6008        .`      STR      r0,[r1,#0]
        0x08003694:    68a0        .h      LDR      r0,[r4,#8]
        0x08003696:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x0800369a:    6840        @h      LDR      r0,[r0,#4]
        0x0800369c:    9000        ..      STR      r0,[sp,#0]
        0x0800369e:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x080036a2:    2900        .)      CMP      r1,#0
        0x080036a4:    da04        ..      BGE      0x80036b0 ; ecp_mod_p384 + 136
        0x080036a6:    4249        IB      RSBS     r1,r1,#0
        0x080036a8:    4668        hF      MOV      r0,sp
        0x080036aa:    f003ff46    ..F.    BL       sub32 ; 0x800753a
        0x080036ae:    e002        ..      B        0x80036b6 ; ecp_mod_p384 + 142
        0x080036b0:    4668        hF      MOV      r0,sp
        0x080036b2:    f7fef884    ....    BL       add32 ; 0x80017be
        0x080036b6:    68a0        .h      LDR      r0,[r4,#8]
        0x080036b8:    aa01        ..      ADD      r2,sp,#4
        0x080036ba:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x080036bc:    4668        hF      MOV      r0,sp
        0x080036be:    f7fef87e    ..~.    BL       add32 ; 0x80017be
        0x080036c2:    68a0        .h      LDR      r0,[r4,#8]
        0x080036c4:    aa01        ..      ADD      r2,sp,#4
        0x080036c6:    6d81        .m      LDR      r1,[r0,#0x58]
        0x080036c8:    4668        hF      MOV      r0,sp
        0x080036ca:    f7fef878    ..x.    BL       add32 ; 0x80017be
        0x080036ce:    68a0        .h      LDR      r0,[r4,#8]
        0x080036d0:    aa01        ..      ADD      r2,sp,#4
        0x080036d2:    6dc1        .m      LDR      r1,[r0,#0x5c]
        0x080036d4:    4668        hF      MOV      r0,sp
        0x080036d6:    f7fef872    ..r.    BL       add32 ; 0x80017be
        0x080036da:    68a0        .h      LDR      r0,[r4,#8]
        0x080036dc:    aa01        ..      ADD      r2,sp,#4
        0x080036de:    6b01        .k      LDR      r1,[r0,#0x30]
        0x080036e0:    4668        hF      MOV      r0,sp
        0x080036e2:    f003ff2a    ..*.    BL       sub32 ; 0x800753a
        0x080036e6:    68a0        .h      LDR      r0,[r4,#8]
        0x080036e8:    aa01        ..      ADD      r2,sp,#4
        0x080036ea:    6d01        .m      LDR      r1,[r0,#0x50]
        0x080036ec:    4668        hF      MOV      r0,sp
        0x080036ee:    f003ff24    ..$.    BL       sub32 ; 0x800753a
        0x080036f2:    68a1        .h      LDR      r1,[r4,#8]
        0x080036f4:    9800        ..      LDR      r0,[sp,#0]
        0x080036f6:    aa01        ..      ADD      r2,sp,#4
        0x080036f8:    6048        H`      STR      r0,[r1,#4]
        0x080036fa:    68a0        .h      LDR      r0,[r4,#8]
        0x080036fc:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003700:    6880        .h      LDR      r0,[r0,#8]
        0x08003702:    9000        ..      STR      r0,[sp,#0]
        0x08003704:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x08003708:    2900        .)      CMP      r1,#0
        0x0800370a:    da04        ..      BGE      0x8003716 ; ecp_mod_p384 + 238
        0x0800370c:    4249        IB      RSBS     r1,r1,#0
        0x0800370e:    4668        hF      MOV      r0,sp
        0x08003710:    f003ff13    ....    BL       sub32 ; 0x800753a
        0x08003714:    e002        ..      B        0x800371c ; ecp_mod_p384 + 244
        0x08003716:    4668        hF      MOV      r0,sp
        0x08003718:    f7fef851    ..Q.    BL       add32 ; 0x80017be
        0x0800371c:    68a0        .h      LDR      r0,[r4,#8]
        0x0800371e:    aa01        ..      ADD      r2,sp,#4
        0x08003720:    6b81        .k      LDR      r1,[r0,#0x38]
        0x08003722:    4668        hF      MOV      r0,sp
        0x08003724:    f7fef84b    ..K.    BL       add32 ; 0x80017be
        0x08003728:    68a0        .h      LDR      r0,[r4,#8]
        0x0800372a:    aa01        ..      ADD      r2,sp,#4
        0x0800372c:    6dc1        .m      LDR      r1,[r0,#0x5c]
        0x0800372e:    4668        hF      MOV      r0,sp
        0x08003730:    f7fef845    ..E.    BL       add32 ; 0x80017be
        0x08003734:    68a0        .h      LDR      r0,[r4,#8]
        0x08003736:    aa01        ..      ADD      r2,sp,#4
        0x08003738:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x0800373a:    4668        hF      MOV      r0,sp
        0x0800373c:    f003fefd    ....    BL       sub32 ; 0x800753a
        0x08003740:    68a0        .h      LDR      r0,[r4,#8]
        0x08003742:    aa01        ..      ADD      r2,sp,#4
        0x08003744:    6d41        Am      LDR      r1,[r0,#0x54]
        0x08003746:    4668        hF      MOV      r0,sp
        0x08003748:    f003fef7    ....    BL       sub32 ; 0x800753a
        0x0800374c:    68a1        .h      LDR      r1,[r4,#8]
        0x0800374e:    9800        ..      LDR      r0,[sp,#0]
        0x08003750:    6088        .`      STR      r0,[r1,#8]
        0x08003752:    e000        ..      B        0x8003756 ; ecp_mod_p384 + 302
        0x08003754:    e215        ..      B        0x8003b82 ; ecp_mod_p384 + 1370
        0x08003756:    68a0        .h      LDR      r0,[r4,#8]
        0x08003758:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x0800375c:    aa01        ..      ADD      r2,sp,#4
        0x0800375e:    68c0        .h      LDR      r0,[r0,#0xc]
        0x08003760:    9000        ..      STR      r0,[sp,#0]
        0x08003762:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x08003766:    2900        .)      CMP      r1,#0
        0x08003768:    da04        ..      BGE      0x8003774 ; ecp_mod_p384 + 332
        0x0800376a:    4249        IB      RSBS     r1,r1,#0
        0x0800376c:    4668        hF      MOV      r0,sp
        0x0800376e:    f003fee4    ....    BL       sub32 ; 0x800753a
        0x08003772:    e002        ..      B        0x800377a ; ecp_mod_p384 + 338
        0x08003774:    4668        hF      MOV      r0,sp
        0x08003776:    f7fef822    ..".    BL       add32 ; 0x80017be
        0x0800377a:    68a0        .h      LDR      r0,[r4,#8]
        0x0800377c:    aa01        ..      ADD      r2,sp,#4
        0x0800377e:    6bc1        .k      LDR      r1,[r0,#0x3c]
        0x08003780:    4668        hF      MOV      r0,sp
        0x08003782:    f7fef81c    ....    BL       add32 ; 0x80017be
        0x08003786:    68a0        .h      LDR      r0,[r4,#8]
        0x08003788:    aa01        ..      ADD      r2,sp,#4
        0x0800378a:    6b01        .k      LDR      r1,[r0,#0x30]
        0x0800378c:    4668        hF      MOV      r0,sp
        0x0800378e:    f7fef816    ....    BL       add32 ; 0x80017be
        0x08003792:    68a0        .h      LDR      r0,[r4,#8]
        0x08003794:    aa01        ..      ADD      r2,sp,#4
        0x08003796:    6d01        .m      LDR      r1,[r0,#0x50]
        0x08003798:    4668        hF      MOV      r0,sp
        0x0800379a:    f7fef810    ....    BL       add32 ; 0x80017be
        0x0800379e:    68a0        .h      LDR      r0,[r4,#8]
        0x080037a0:    aa01        ..      ADD      r2,sp,#4
        0x080037a2:    6d41        Am      LDR      r1,[r0,#0x54]
        0x080037a4:    4668        hF      MOV      r0,sp
        0x080037a6:    f7fef80a    ....    BL       add32 ; 0x80017be
        0x080037aa:    68a0        .h      LDR      r0,[r4,#8]
        0x080037ac:    aa01        ..      ADD      r2,sp,#4
        0x080037ae:    6b81        .k      LDR      r1,[r0,#0x38]
        0x080037b0:    4668        hF      MOV      r0,sp
        0x080037b2:    f003fec2    ....    BL       sub32 ; 0x800753a
        0x080037b6:    68a0        .h      LDR      r0,[r4,#8]
        0x080037b8:    aa01        ..      ADD      r2,sp,#4
        0x080037ba:    6d81        .m      LDR      r1,[r0,#0x58]
        0x080037bc:    4668        hF      MOV      r0,sp
        0x080037be:    f003febc    ....    BL       sub32 ; 0x800753a
        0x080037c2:    68a0        .h      LDR      r0,[r4,#8]
        0x080037c4:    aa01        ..      ADD      r2,sp,#4
        0x080037c6:    6dc1        .m      LDR      r1,[r0,#0x5c]
        0x080037c8:    4668        hF      MOV      r0,sp
        0x080037ca:    f003feb6    ....    BL       sub32 ; 0x800753a
        0x080037ce:    68a1        .h      LDR      r1,[r4,#8]
        0x080037d0:    9800        ..      LDR      r0,[sp,#0]
        0x080037d2:    aa01        ..      ADD      r2,sp,#4
        0x080037d4:    60c8        .`      STR      r0,[r1,#0xc]
        0x080037d6:    68a0        .h      LDR      r0,[r4,#8]
        0x080037d8:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x080037dc:    6900        .i      LDR      r0,[r0,#0x10]
        0x080037de:    9000        ..      STR      r0,[sp,#0]
        0x080037e0:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x080037e4:    2900        .)      CMP      r1,#0
        0x080037e6:    da04        ..      BGE      0x80037f2 ; ecp_mod_p384 + 458
        0x080037e8:    4249        IB      RSBS     r1,r1,#0
        0x080037ea:    4668        hF      MOV      r0,sp
        0x080037ec:    f003fea5    ....    BL       sub32 ; 0x800753a
        0x080037f0:    e002        ..      B        0x80037f8 ; ecp_mod_p384 + 464
        0x080037f2:    4668        hF      MOV      r0,sp
        0x080037f4:    f7fdffe3    ....    BL       add32 ; 0x80017be
        0x080037f8:    68a0        .h      LDR      r0,[r4,#8]
        0x080037fa:    aa01        ..      ADD      r2,sp,#4
        0x080037fc:    6d41        Am      LDR      r1,[r0,#0x54]
        0x080037fe:    4668        hF      MOV      r0,sp
        0x08003800:    f7fdffdd    ....    BL       add32 ; 0x80017be
        0x08003804:    68a0        .h      LDR      r0,[r4,#8]
        0x08003806:    aa01        ..      ADD      r2,sp,#4
        0x08003808:    6d41        Am      LDR      r1,[r0,#0x54]
        0x0800380a:    4668        hF      MOV      r0,sp
        0x0800380c:    f7fdffd7    ....    BL       add32 ; 0x80017be
        0x08003810:    68a0        .h      LDR      r0,[r4,#8]
        0x08003812:    aa01        ..      ADD      r2,sp,#4
        0x08003814:    6c01        .l      LDR      r1,[r0,#0x40]
        0x08003816:    4668        hF      MOV      r0,sp
        0x08003818:    f7fdffd1    ....    BL       add32 ; 0x80017be
        0x0800381c:    68a0        .h      LDR      r0,[r4,#8]
        0x0800381e:    aa01        ..      ADD      r2,sp,#4
        0x08003820:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x08003822:    4668        hF      MOV      r0,sp
        0x08003824:    f7fdffcb    ....    BL       add32 ; 0x80017be
        0x08003828:    68a0        .h      LDR      r0,[r4,#8]
        0x0800382a:    aa01        ..      ADD      r2,sp,#4
        0x0800382c:    6b01        .k      LDR      r1,[r0,#0x30]
        0x0800382e:    4668        hF      MOV      r0,sp
        0x08003830:    f7fdffc5    ....    BL       add32 ; 0x80017be
        0x08003834:    68a0        .h      LDR      r0,[r4,#8]
        0x08003836:    aa01        ..      ADD      r2,sp,#4
        0x08003838:    6d01        .m      LDR      r1,[r0,#0x50]
        0x0800383a:    4668        hF      MOV      r0,sp
        0x0800383c:    f7fdffbf    ....    BL       add32 ; 0x80017be
        0x08003840:    68a0        .h      LDR      r0,[r4,#8]
        0x08003842:    aa01        ..      ADD      r2,sp,#4
