openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08003844:    6d81        .m      LDR      r1,[r0,#0x58]
        0x08003846:    4668        hF      MOV      r0,sp
        0x08003848:    f7fdffb9    ....    BL       add32 ; 0x80017be
        0x0800384c:    68a0        .h      LDR      r0,[r4,#8]
        0x0800384e:    aa01        ..      ADD      r2,sp,#4
        0x08003850:    6bc1        .k      LDR      r1,[r0,#0x3c]
        0x08003852:    4668        hF      MOV      r0,sp
        0x08003854:    f003fe71    ..q.    BL       sub32 ; 0x800753a
        0x08003858:    68a0        .h      LDR      r0,[r4,#8]
        0x0800385a:    aa01        ..      ADD      r2,sp,#4
        0x0800385c:    6dc1        .m      LDR      r1,[r0,#0x5c]
        0x0800385e:    4668        hF      MOV      r0,sp
        0x08003860:    f003fe6b    ..k.    BL       sub32 ; 0x800753a
        0x08003864:    68a0        .h      LDR      r0,[r4,#8]
        0x08003866:    aa01        ..      ADD      r2,sp,#4
        0x08003868:    6dc1        .m      LDR      r1,[r0,#0x5c]
        0x0800386a:    4668        hF      MOV      r0,sp
        0x0800386c:    f003fe65    ..e.    BL       sub32 ; 0x800753a
        0x08003870:    68a1        .h      LDR      r1,[r4,#8]
        0x08003872:    9800        ..      LDR      r0,[sp,#0]
        0x08003874:    aa01        ..      ADD      r2,sp,#4
        0x08003876:    6108        .a      STR      r0,[r1,#0x10]
        0x08003878:    68a0        .h      LDR      r0,[r4,#8]
        0x0800387a:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x0800387e:    6940        @i      LDR      r0,[r0,#0x14]
        0x08003880:    9000        ..      STR      r0,[sp,#0]
        0x08003882:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x08003886:    2900        .)      CMP      r1,#0
        0x08003888:    da04        ..      BGE      0x8003894 ; ecp_mod_p384 + 620
        0x0800388a:    4249        IB      RSBS     r1,r1,#0
        0x0800388c:    4668        hF      MOV      r0,sp
        0x0800388e:    f003fe54    ..T.    BL       sub32 ; 0x800753a
        0x08003892:    e002        ..      B        0x800389a ; ecp_mod_p384 + 626
        0x08003894:    4668        hF      MOV      r0,sp
        0x08003896:    f7fdff92    ....    BL       add32 ; 0x80017be
        0x0800389a:    68a0        .h      LDR      r0,[r4,#8]
        0x0800389c:    aa01        ..      ADD      r2,sp,#4
        0x0800389e:    6d81        .m      LDR      r1,[r0,#0x58]
        0x080038a0:    4668        hF      MOV      r0,sp
        0x080038a2:    f7fdff8c    ....    BL       add32 ; 0x80017be
        0x080038a6:    68a0        .h      LDR      r0,[r4,#8]
        0x080038a8:    aa01        ..      ADD      r2,sp,#4
        0x080038aa:    6d81        .m      LDR      r1,[r0,#0x58]
        0x080038ac:    4668        hF      MOV      r0,sp
        0x080038ae:    f7fdff86    ....    BL       add32 ; 0x80017be
        0x080038b2:    68a0        .h      LDR      r0,[r4,#8]
        0x080038b4:    aa01        ..      ADD      r2,sp,#4
        0x080038b6:    6c41        Al      LDR      r1,[r0,#0x44]
        0x080038b8:    4668        hF      MOV      r0,sp
        0x080038ba:    f7fdff80    ....    BL       add32 ; 0x80017be
        0x080038be:    68a0        .h      LDR      r0,[r4,#8]
        0x080038c0:    aa01        ..      ADD      r2,sp,#4
        0x080038c2:    6b81        .k      LDR      r1,[r0,#0x38]
        0x080038c4:    4668        hF      MOV      r0,sp
        0x080038c6:    f7fdff7a    ..z.    BL       add32 ; 0x80017be
        0x080038ca:    68a0        .h      LDR      r0,[r4,#8]
        0x080038cc:    aa01        ..      ADD      r2,sp,#4
        0x080038ce:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x080038d0:    4668        hF      MOV      r0,sp
        0x080038d2:    f7fdff74    ..t.    BL       add32 ; 0x80017be
        0x080038d6:    68a0        .h      LDR      r0,[r4,#8]
        0x080038d8:    aa01        ..      ADD      r2,sp,#4
        0x080038da:    6d41        Am      LDR      r1,[r0,#0x54]
        0x080038dc:    4668        hF      MOV      r0,sp
        0x080038de:    f7fdff6e    ..n.    BL       add32 ; 0x80017be
        0x080038e2:    68a0        .h      LDR      r0,[r4,#8]
        0x080038e4:    aa01        ..      ADD      r2,sp,#4
        0x080038e6:    6dc1        .m      LDR      r1,[r0,#0x5c]
        0x080038e8:    4668        hF      MOV      r0,sp
        0x080038ea:    f7fdff68    ..h.    BL       add32 ; 0x80017be
        0x080038ee:    68a0        .h      LDR      r0,[r4,#8]
        0x080038f0:    aa01        ..      ADD      r2,sp,#4
        0x080038f2:    6c01        .l      LDR      r1,[r0,#0x40]
        0x080038f4:    4668        hF      MOV      r0,sp
        0x080038f6:    f003fe20    .. .    BL       sub32 ; 0x800753a
        0x080038fa:    68a1        .h      LDR      r1,[r4,#8]
        0x080038fc:    9800        ..      LDR      r0,[sp,#0]
        0x080038fe:    aa01        ..      ADD      r2,sp,#4
        0x08003900:    6148        Ha      STR      r0,[r1,#0x14]
        0x08003902:    68a0        .h      LDR      r0,[r4,#8]
        0x08003904:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003908:    6980        .i      LDR      r0,[r0,#0x18]
        0x0800390a:    9000        ..      STR      r0,[sp,#0]
        0x0800390c:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x08003910:    2900        .)      CMP      r1,#0
        0x08003912:    da04        ..      BGE      0x800391e ; ecp_mod_p384 + 758
        0x08003914:    4249        IB      RSBS     r1,r1,#0
        0x08003916:    4668        hF      MOV      r0,sp
        0x08003918:    f003fe0f    ....    BL       sub32 ; 0x800753a
        0x0800391c:    e002        ..      B        0x8003924 ; ecp_mod_p384 + 764
        0x0800391e:    4668        hF      MOV      r0,sp
        0x08003920:    f7fdff4d    ..M.    BL       add32 ; 0x80017be
        0x08003924:    68a0        .h      LDR      r0,[r4,#8]
        0x08003926:    aa01        ..      ADD      r2,sp,#4
        0x08003928:    6dc1        .m      LDR      r1,[r0,#0x5c]
        0x0800392a:    4668        hF      MOV      r0,sp
        0x0800392c:    f7fdff47    ..G.    BL       add32 ; 0x80017be
        0x08003930:    68a0        .h      LDR      r0,[r4,#8]
        0x08003932:    aa01        ..      ADD      r2,sp,#4
        0x08003934:    6dc1        .m      LDR      r1,[r0,#0x5c]
        0x08003936:    4668        hF      MOV      r0,sp
        0x08003938:    f7fdff41    ..A.    BL       add32 ; 0x80017be
        0x0800393c:    68a0        .h      LDR      r0,[r4,#8]
        0x0800393e:    aa01        ..      ADD      r2,sp,#4
        0x08003940:    6c81        .l      LDR      r1,[r0,#0x48]
        0x08003942:    4668        hF      MOV      r0,sp
        0x08003944:    f7fdff3b    ..;.    BL       add32 ; 0x80017be
        0x08003948:    68a0        .h      LDR      r0,[r4,#8]
        0x0800394a:    aa01        ..      ADD      r2,sp,#4
        0x0800394c:    6bc1        .k      LDR      r1,[r0,#0x3c]
        0x0800394e:    4668        hF      MOV      r0,sp
        0x08003950:    f7fdff35    ..5.    BL       add32 ; 0x80017be
        0x08003954:    68a0        .h      LDR      r0,[r4,#8]
        0x08003956:    aa01        ..      ADD      r2,sp,#4
        0x08003958:    6b81        .k      LDR      r1,[r0,#0x38]
        0x0800395a:    4668        hF      MOV      r0,sp
        0x0800395c:    f7fdff2f    ../.    BL       add32 ; 0x80017be
        0x08003960:    68a0        .h      LDR      r0,[r4,#8]
        0x08003962:    aa01        ..      ADD      r2,sp,#4
        0x08003964:    6d81        .m      LDR      r1,[r0,#0x58]
        0x08003966:    4668        hF      MOV      r0,sp
        0x08003968:    f7fdff29    ..).    BL       add32 ; 0x80017be
        0x0800396c:    68a0        .h      LDR      r0,[r4,#8]
        0x0800396e:    aa01        ..      ADD      r2,sp,#4
        0x08003970:    6c41        Al      LDR      r1,[r0,#0x44]
        0x08003972:    4668        hF      MOV      r0,sp
        0x08003974:    f003fde1    ....    BL       sub32 ; 0x800753a
        0x08003978:    68a1        .h      LDR      r1,[r4,#8]
        0x0800397a:    9800        ..      LDR      r0,[sp,#0]
        0x0800397c:    aa01        ..      ADD      r2,sp,#4
        0x0800397e:    6188        .a      STR      r0,[r1,#0x18]
        0x08003980:    68a0        .h      LDR      r0,[r4,#8]
        0x08003982:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003986:    69c0        .i      LDR      r0,[r0,#0x1c]
        0x08003988:    9000        ..      STR      r0,[sp,#0]
        0x0800398a:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x0800398e:    2900        .)      CMP      r1,#0
        0x08003990:    da04        ..      BGE      0x800399c ; ecp_mod_p384 + 884
        0x08003992:    4249        IB      RSBS     r1,r1,#0
        0x08003994:    4668        hF      MOV      r0,sp
        0x08003996:    f003fdd0    ....    BL       sub32 ; 0x800753a
        0x0800399a:    e002        ..      B        0x80039a2 ; ecp_mod_p384 + 890
        0x0800399c:    4668        hF      MOV      r0,sp
        0x0800399e:    f7fdff0e    ....    BL       add32 ; 0x80017be
        0x080039a2:    68a0        .h      LDR      r0,[r4,#8]
        0x080039a4:    aa01        ..      ADD      r2,sp,#4
        0x080039a6:    6cc1        .l      LDR      r1,[r0,#0x4c]
        0x080039a8:    4668        hF      MOV      r0,sp
        0x080039aa:    f7fdff08    ....    BL       add32 ; 0x80017be
        0x080039ae:    68a0        .h      LDR      r0,[r4,#8]
        0x080039b0:    aa01        ..      ADD      r2,sp,#4
        0x080039b2:    6c01        .l      LDR      r1,[r0,#0x40]
        0x080039b4:    4668        hF      MOV      r0,sp
        0x080039b6:    f7fdff02    ....    BL       add32 ; 0x80017be
        0x080039ba:    68a0        .h      LDR      r0,[r4,#8]
        0x080039bc:    aa01        ..      ADD      r2,sp,#4
        0x080039be:    6bc1        .k      LDR      r1,[r0,#0x3c]
        0x080039c0:    4668        hF      MOV      r0,sp
        0x080039c2:    f7fdfefc    ....    BL       add32 ; 0x80017be
        0x080039c6:    68a0        .h      LDR      r0,[r4,#8]
        0x080039c8:    aa01        ..      ADD      r2,sp,#4
        0x080039ca:    6dc1        .m      LDR      r1,[r0,#0x5c]
        0x080039cc:    4668        hF      MOV      r0,sp
        0x080039ce:    f7fdfef6    ....    BL       add32 ; 0x80017be
        0x080039d2:    68a0        .h      LDR      r0,[r4,#8]
        0x080039d4:    aa01        ..      ADD      r2,sp,#4
        0x080039d6:    6c81        .l      LDR      r1,[r0,#0x48]
        0x080039d8:    4668        hF      MOV      r0,sp
        0x080039da:    f003fdae    ....    BL       sub32 ; 0x800753a
        0x080039de:    68a1        .h      LDR      r1,[r4,#8]
        0x080039e0:    9800        ..      LDR      r0,[sp,#0]
        0x080039e2:    aa01        ..      ADD      r2,sp,#4
        0x080039e4:    61c8        .a      STR      r0,[r1,#0x1c]
        0x080039e6:    68a0        .h      LDR      r0,[r4,#8]
        0x080039e8:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x080039ec:    6a00        .j      LDR      r0,[r0,#0x20]
        0x080039ee:    9000        ..      STR      r0,[sp,#0]
        0x080039f0:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x080039f4:    2900        .)      CMP      r1,#0
        0x080039f6:    da04        ..      BGE      0x8003a02 ; ecp_mod_p384 + 986
        0x080039f8:    4249        IB      RSBS     r1,r1,#0
        0x080039fa:    4668        hF      MOV      r0,sp
        0x080039fc:    f003fd9d    ....    BL       sub32 ; 0x800753a
        0x08003a00:    e002        ..      B        0x8003a08 ; ecp_mod_p384 + 992
        0x08003a02:    4668        hF      MOV      r0,sp
        0x08003a04:    f7fdfedb    ....    BL       add32 ; 0x80017be
        0x08003a08:    68a0        .h      LDR      r0,[r4,#8]
        0x08003a0a:    aa01        ..      ADD      r2,sp,#4
        0x08003a0c:    6d01        .m      LDR      r1,[r0,#0x50]
        0x08003a0e:    4668        hF      MOV      r0,sp
        0x08003a10:    f7fdfed5    ....    BL       add32 ; 0x80017be
        0x08003a14:    68a0        .h      LDR      r0,[r4,#8]
        0x08003a16:    aa01        ..      ADD      r2,sp,#4
        0x08003a18:    6c41        Al      LDR      r1,[r0,#0x44]
        0x08003a1a:    4668        hF      MOV      r0,sp
        0x08003a1c:    f7fdfecf    ....    BL       add32 ; 0x80017be
        0x08003a20:    68a0        .h      LDR      r0,[r4,#8]
        0x08003a22:    aa01        ..      ADD      r2,sp,#4
        0x08003a24:    6c01        .l      LDR      r1,[r0,#0x40]
        0x08003a26:    4668        hF      MOV      r0,sp
        0x08003a28:    f7fdfec9    ....    BL       add32 ; 0x80017be
        0x08003a2c:    68a0        .h      LDR      r0,[r4,#8]
        0x08003a2e:    aa01        ..      ADD      r2,sp,#4
        0x08003a30:    6cc1        .l      LDR      r1,[r0,#0x4c]
        0x08003a32:    4668        hF      MOV      r0,sp
        0x08003a34:    f003fd81    ....    BL       sub32 ; 0x800753a
        0x08003a38:    68a1        .h      LDR      r1,[r4,#8]
        0x08003a3a:    9800        ..      LDR      r0,[sp,#0]
        0x08003a3c:    aa01        ..      ADD      r2,sp,#4
        0x08003a3e:    6208        .b      STR      r0,[r1,#0x20]
        0x08003a40:    68a0        .h      LDR      r0,[r4,#8]
        0x08003a42:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003a46:    6a40        @j      LDR      r0,[r0,#0x24]
        0x08003a48:    9000        ..      STR      r0,[sp,#0]
        0x08003a4a:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x08003a4e:    2900        .)      CMP      r1,#0
        0x08003a50:    da04        ..      BGE      0x8003a5c ; ecp_mod_p384 + 1076
        0x08003a52:    4249        IB      RSBS     r1,r1,#0
        0x08003a54:    4668        hF      MOV      r0,sp
        0x08003a56:    f003fd70    ..p.    BL       sub32 ; 0x800753a
        0x08003a5a:    e002        ..      B        0x8003a62 ; ecp_mod_p384 + 1082
        0x08003a5c:    4668        hF      MOV      r0,sp
        0x08003a5e:    f7fdfeae    ....    BL       add32 ; 0x80017be
        0x08003a62:    68a0        .h      LDR      r0,[r4,#8]
        0x08003a64:    aa01        ..      ADD      r2,sp,#4
        0x08003a66:    6d41        Am      LDR      r1,[r0,#0x54]
        0x08003a68:    4668        hF      MOV      r0,sp
        0x08003a6a:    f7fdfea8    ....    BL       add32 ; 0x80017be
        0x08003a6e:    68a0        .h      LDR      r0,[r4,#8]
        0x08003a70:    aa01        ..      ADD      r2,sp,#4
        0x08003a72:    6c81        .l      LDR      r1,[r0,#0x48]
        0x08003a74:    4668        hF      MOV      r0,sp
        0x08003a76:    f7fdfea2    ....    BL       add32 ; 0x80017be
        0x08003a7a:    68a0        .h      LDR      r0,[r4,#8]
        0x08003a7c:    aa01        ..      ADD      r2,sp,#4
        0x08003a7e:    6c41        Al      LDR      r1,[r0,#0x44]
        0x08003a80:    4668        hF      MOV      r0,sp
        0x08003a82:    f7fdfe9c    ....    BL       add32 ; 0x80017be
        0x08003a86:    68a0        .h      LDR      r0,[r4,#8]
        0x08003a88:    aa01        ..      ADD      r2,sp,#4
        0x08003a8a:    6d01        .m      LDR      r1,[r0,#0x50]
        0x08003a8c:    4668        hF      MOV      r0,sp
        0x08003a8e:    f003fd54    ..T.    BL       sub32 ; 0x800753a
        0x08003a92:    68a1        .h      LDR      r1,[r4,#8]
        0x08003a94:    9800        ..      LDR      r0,[sp,#0]
        0x08003a96:    aa01        ..      ADD      r2,sp,#4
        0x08003a98:    6248        Hb      STR      r0,[r1,#0x24]
        0x08003a9a:    68a0        .h      LDR      r0,[r4,#8]
        0x08003a9c:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003aa0:    6a80        .j      LDR      r0,[r0,#0x28]
        0x08003aa2:    9000        ..      STR      r0,[sp,#0]
        0x08003aa4:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x08003aa8:    2900        .)      CMP      r1,#0
        0x08003aaa:    da04        ..      BGE      0x8003ab6 ; ecp_mod_p384 + 1166
        0x08003aac:    4249        IB      RSBS     r1,r1,#0
        0x08003aae:    4668        hF      MOV      r0,sp
        0x08003ab0:    f003fd43    ..C.    BL       sub32 ; 0x800753a
        0x08003ab4:    e002        ..      B        0x8003abc ; ecp_mod_p384 + 1172
        0x08003ab6:    4668        hF      MOV      r0,sp
        0x08003ab8:    f7fdfe81    ....    BL       add32 ; 0x80017be
        0x08003abc:    68a0        .h      LDR      r0,[r4,#8]
        0x08003abe:    aa01        ..      ADD      r2,sp,#4
        0x08003ac0:    6d81        .m      LDR      r1,[r0,#0x58]
        0x08003ac2:    4668        hF      MOV      r0,sp
        0x08003ac4:    f7fdfe7b    ..{.    BL       add32 ; 0x80017be
        0x08003ac8:    68a0        .h      LDR      r0,[r4,#8]
        0x08003aca:    aa01        ..      ADD      r2,sp,#4
        0x08003acc:    6cc1        .l      LDR      r1,[r0,#0x4c]
        0x08003ace:    4668        hF      MOV      r0,sp
        0x08003ad0:    f7fdfe75    ..u.    BL       add32 ; 0x80017be
        0x08003ad4:    68a0        .h      LDR      r0,[r4,#8]
        0x08003ad6:    aa01        ..      ADD      r2,sp,#4
        0x08003ad8:    6c81        .l      LDR      r1,[r0,#0x48]
        0x08003ada:    4668        hF      MOV      r0,sp
        0x08003adc:    f7fdfe6f    ..o.    BL       add32 ; 0x80017be
        0x08003ae0:    68a0        .h      LDR      r0,[r4,#8]
        0x08003ae2:    aa01        ..      ADD      r2,sp,#4
        0x08003ae4:    6d41        Am      LDR      r1,[r0,#0x54]
        0x08003ae6:    4668        hF      MOV      r0,sp
        0x08003ae8:    f003fd27    ..'.    BL       sub32 ; 0x800753a
        0x08003aec:    68a1        .h      LDR      r1,[r4,#8]
        0x08003aee:    9800        ..      LDR      r0,[sp,#0]
        0x08003af0:    aa01        ..      ADD      r2,sp,#4
        0x08003af2:    6288        .b      STR      r0,[r1,#0x28]
        0x08003af4:    68a0        .h      LDR      r0,[r4,#8]
        0x08003af6:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003afa:    6ac0        .j      LDR      r0,[r0,#0x2c]
        0x08003afc:    9000        ..      STR      r0,[sp,#0]
        0x08003afe:    f88d5004    ...P    STRB     r5,[sp,#4]
        0x08003b02:    2900        .)      CMP      r1,#0
        0x08003b04:    da04        ..      BGE      0x8003b10 ; ecp_mod_p384 + 1256
        0x08003b06:    4249        IB      RSBS     r1,r1,#0
        0x08003b08:    4668        hF      MOV      r0,sp
        0x08003b0a:    f003fd16    ....    BL       sub32 ; 0x800753a
        0x08003b0e:    e002        ..      B        0x8003b16 ; ecp_mod_p384 + 1262
        0x08003b10:    4668        hF      MOV      r0,sp
        0x08003b12:    f7fdfe54    ..T.    BL       add32 ; 0x80017be
        0x08003b16:    68a0        .h      LDR      r0,[r4,#8]
        0x08003b18:    aa01        ..      ADD      r2,sp,#4
        0x08003b1a:    6dc1        .m      LDR      r1,[r0,#0x5c]
        0x08003b1c:    4668        hF      MOV      r0,sp
        0x08003b1e:    f7fdfe4e    ..N.    BL       add32 ; 0x80017be
        0x08003b22:    68a0        .h      LDR      r0,[r4,#8]
        0x08003b24:    aa01        ..      ADD      r2,sp,#4
        0x08003b26:    6d01        .m      LDR      r1,[r0,#0x50]
        0x08003b28:    4668        hF      MOV      r0,sp
        0x08003b2a:    f7fdfe48    ..H.    BL       add32 ; 0x80017be
        0x08003b2e:    68a0        .h      LDR      r0,[r4,#8]
        0x08003b30:    aa01        ..      ADD      r2,sp,#4
        0x08003b32:    6cc1        .l      LDR      r1,[r0,#0x4c]
        0x08003b34:    4668        hF      MOV      r0,sp
        0x08003b36:    f7fdfe42    ..B.    BL       add32 ; 0x80017be
        0x08003b3a:    68a0        .h      LDR      r0,[r4,#8]
        0x08003b3c:    aa01        ..      ADD      r2,sp,#4
        0x08003b3e:    6d81        .m      LDR      r1,[r0,#0x58]
        0x08003b40:    4668        hF      MOV      r0,sp
        0x08003b42:    f003fcfa    ....    BL       sub32 ; 0x800753a
        0x08003b46:    68a1        .h      LDR      r1,[r4,#8]
        0x08003b48:    9800        ..      LDR      r0,[sp,#0]
        0x08003b4a:    62c8        .b      STR      r0,[r1,#0x2c]
        0x08003b4c:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003b50:    200c        .       MOVS     r0,#0xc
        0x08003b52:    2900        .)      CMP      r1,#0
        0x08003b54:    dc00        ..      BGT      0x8003b58 ; ecp_mod_p384 + 1328
        0x08003b56:    2100        .!      MOVS     r1,#0
        0x08003b58:    68a2        .h      LDR      r2,[r4,#8]
        0x08003b5a:    6311        .c      STR      r1,[r2,#0x30]
        0x08003b5c:    9500        ..      STR      r5,[sp,#0]
        0x08003b5e:    e003        ..      B        0x8003b68 ; ecp_mod_p384 + 1344
        0x08003b60:    68a2        .h      LDR      r2,[r4,#8]
        0x08003b62:    9900        ..      LDR      r1,[sp,#0]
        0x08003b64:    f8421020    B. .    STR      r1,[r2,r0,LSL #2]
        0x08003b68:    6861        ah      LDR      r1,[r4,#4]
        0x08003b6a:    1c40        @.      ADDS     r0,r0,#1
        0x08003b6c:    4288        .B      CMP      r0,r1
        0x08003b6e:    d3f7        ..      BCC      0x8003b60 ; ecp_mod_p384 + 1336
        0x08003b70:    f99d1004    ....    LDRSB    r1,[sp,#4]
        0x08003b74:    2900        .)      CMP      r1,#0
        0x08003b76:    da04        ..      BGE      0x8003b82 ; ecp_mod_p384 + 1370
        0x08003b78:    463b        ;F      MOV      r3,r7
        0x08003b7a:    aa03        ..      ADD      r2,sp,#0xc
        0x08003b7c:    4620         F      MOV      r0,r4
        0x08003b7e:    f000febb    ....    BL       fix_negative ; 0x80048f8
        0x08003b82:    b015        ..      ADD      sp,sp,#0x54
        0x08003b84:    4630        0F      MOV      r0,r6
        0x08003b86:    bdf0        ..      POP      {r4-r7,pc}
    i.ecp_mod_p448
    ecp_mod_p448
        0x08003b88:    b570        p.      PUSH     {r4-r6,lr}
        0x08003b8a:    4604        .F      MOV      r4,r0
        0x08003b8c:    6840        @h      LDR      r0,[r0,#4]
        0x08003b8e:    b0a6        ..      SUB      sp,sp,#0x98
        0x08003b90:    280e        .(      CMP      r0,#0xe
        0x08003b92:    d802        ..      BHI      0x8003b9a ; ecp_mod_p448 + 18
        0x08003b94:    2000        .       MOVS     r0,#0
        0x08003b96:    b026        &.      ADD      sp,sp,#0x98
        0x08003b98:    bd70        p.      POP      {r4-r6,pc}
        0x08003b9a:    2001        .       MOVS     r0,#1
        0x08003b9c:    9002        ..      STR      r0,[sp,#8]
        0x08003b9e:    6860        `h      LDR      r0,[r4,#4]
        0x08003ba0:    380e        .8      SUBS     r0,r0,#0xe
        0x08003ba2:    9003        ..      STR      r0,[sp,#0xc]
        0x08003ba4:    280e        .(      CMP      r0,#0xe
        0x08003ba6:    d901        ..      BLS      0x8003bac ; ecp_mod_p448 + 36
        0x08003ba8:    482a        *H      LDR      r0,[pc,#168] ; [0x8003c54] = 0xffffb080
        0x08003baa:    e7f4        ..      B        0x8003b96 ; ecp_mod_p448 + 14
        0x08003bac:    ae05        ..      ADD      r6,sp,#0x14
