openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08003bae:    213c        <!      MOVS     r1,#0x3c
        0x08003bb0:    a805        ..      ADD      r0,sp,#0x14
        0x08003bb2:    9604        ..      STR      r6,[sp,#0x10]
        0x08003bb4:    f7fcfcd2    ....    BL       __aeabi_memclr4 ; 0x800055c
        0x08003bb8:    9803        ..      LDR      r0,[sp,#0xc]
        0x08003bba:    68a1        .h      LDR      r1,[r4,#8]
        0x08003bbc:    0082        ..      LSLS     r2,r0,#2
        0x08003bbe:    a805        ..      ADD      r0,sp,#0x14
        0x08003bc0:    3138        81      ADDS     r1,r1,#0x38
        0x08003bc2:    f7fcfc6c    ..l.    BL       __aeabi_memcpy4 ; 0x800049e
        0x08003bc6:    200e        .       MOVS     r0,#0xe
        0x08003bc8:    2500        .%      MOVS     r5,#0
        0x08003bca:    e003        ..      B        0x8003bd4 ; ecp_mod_p448 + 76
        0x08003bcc:    68a1        .h      LDR      r1,[r4,#8]
        0x08003bce:    f8415020    A. P    STR      r5,[r1,r0,LSL #2]
        0x08003bd2:    1c40        @.      ADDS     r0,r0,#1
        0x08003bd4:    6861        ah      LDR      r1,[r4,#4]
        0x08003bd6:    4281        .B      CMP      r1,r0
        0x08003bd8:    d8f8        ..      BHI      0x8003bcc ; ecp_mod_p448 + 68
        0x08003bda:    4621        !F      MOV      r1,r4
        0x08003bdc:    aa02        ..      ADD      r2,sp,#8
        0x08003bde:    4608        .F      MOV      r0,r1
        0x08003be0:    f002f83a    ..:.    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08003be4:    2800        .(      CMP      r0,#0
        0x08003be6:    d1d6        ..      BNE      0x8003b96 ; ecp_mod_p448 + 14
        0x08003be8:    e9dd0102    ....    LDRD     r0,r1,[sp,#8]
        0x08003bec:    e9cd0114    ....    STRD     r0,r1,[sp,#0x50]
        0x08003bf0:    a817        ..      ADD      r0,sp,#0x5c
        0x08003bf2:    2238        8"      MOVS     r2,#0x38
        0x08003bf4:    a905        ..      ADD      r1,sp,#0x14
        0x08003bf6:    9016        ..      STR      r0,[sp,#0x58]
        0x08003bf8:    f7fcfc51    ..Q.    BL       __aeabi_memcpy4 ; 0x800049e
        0x08003bfc:    21e0        .!      MOVS     r1,#0xe0
        0x08003bfe:    a814        ..      ADD      r0,sp,#0x50
        0x08003c00:    f002ffb0    ....    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x08003c04:    2800        .(      CMP      r0,#0
        0x08003c06:    d1c6        ..      BNE      0x8003b96 ; ecp_mod_p448 + 14
        0x08003c08:    4621        !F      MOV      r1,r4
        0x08003c0a:    aa14        ..      ADD      r2,sp,#0x50
        0x08003c0c:    4608        .F      MOV      r0,r1
        0x08003c0e:    f002f823    ..#.    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08003c12:    2800        .(      CMP      r0,#0
        0x08003c14:    d1bf        ..      BNE      0x8003b96 ; ecp_mod_p448 + 14
        0x08003c16:    2007        .       MOVS     r0,#7
        0x08003c18:    e003        ..      B        0x8003c22 ; ecp_mod_p448 + 154
        0x08003c1a:    bf00        ..      NOP      
        0x08003c1c:    f8465020    F. P    STR      r5,[r6,r0,LSL #2]
        0x08003c20:    1c40        @.      ADDS     r0,r0,#1
        0x08003c22:    9903        ..      LDR      r1,[sp,#0xc]
        0x08003c24:    4281        .B      CMP      r1,r0
        0x08003c26:    d8f9        ..      BHI      0x8003c1c ; ecp_mod_p448 + 148
        0x08003c28:    a902        ..      ADD      r1,sp,#8
        0x08003c2a:    aa14        ..      ADD      r2,sp,#0x50
        0x08003c2c:    4608        .F      MOV      r0,r1
        0x08003c2e:    f002f813    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08003c32:    2800        .(      CMP      r0,#0
        0x08003c34:    d1af        ..      BNE      0x8003b96 ; ecp_mod_p448 + 14
        0x08003c36:    200f        .       MOVS     r0,#0xf
        0x08003c38:    9003        ..      STR      r0,[sp,#0xc]
        0x08003c3a:    21e0        .!      MOVS     r1,#0xe0
        0x08003c3c:    a802        ..      ADD      r0,sp,#8
        0x08003c3e:    f002ff41    ..A.    BL       mbedtls_mpi_shift_l ; 0x8006ac4
        0x08003c42:    2800        .(      CMP      r0,#0
        0x08003c44:    d1a7        ..      BNE      0x8003b96 ; ecp_mod_p448 + 14
        0x08003c46:    4621        !F      MOV      r1,r4
        0x08003c48:    aa02        ..      ADD      r2,sp,#8
        0x08003c4a:    4608        .F      MOV      r0,r1
        0x08003c4c:    f002f804    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08003c50:    e7a1        ..      B        0x8003b96 ; ecp_mod_p448 + 14
    $d
        0x08003c52:    0000        ..      DCW    0
        0x08003c54:    ffffb080    ....    DCD    4294946944
    $t
    i.ecp_mod_p521
    ecp_mod_p521
        0x08003c58:    b510        ..      PUSH     {r4,lr}
        0x08003c5a:    4604        .F      MOV      r4,r0
        0x08003c5c:    6840        @h      LDR      r0,[r0,#4]
        0x08003c5e:    b096        ..      SUB      sp,sp,#0x58
        0x08003c60:    2811        .(      CMP      r0,#0x11
        0x08003c62:    d202        ..      BCS      0x8003c6a ; ecp_mod_p521 + 18
        0x08003c64:    2000        .       MOVS     r0,#0
        0x08003c66:    b016        ..      ADD      sp,sp,#0x58
        0x08003c68:    bd10        ..      POP      {r4,pc}
        0x08003c6a:    2001        .       MOVS     r0,#1
        0x08003c6c:    9012        ..      STR      r0,[sp,#0x48]
        0x08003c6e:    6860        `h      LDR      r0,[r4,#4]
        0x08003c70:    3810        .8      SUBS     r0,r0,#0x10
        0x08003c72:    9013        ..      STR      r0,[sp,#0x4c]
        0x08003c74:    2812        .(      CMP      r0,#0x12
        0x08003c76:    d901        ..      BLS      0x8003c7c ; ecp_mod_p521 + 36
        0x08003c78:    2012        .       MOVS     r0,#0x12
        0x08003c7a:    9013        ..      STR      r0,[sp,#0x4c]
        0x08003c7c:    f8cdd050    ..P.    STR      sp,[sp,#0x50]
        0x08003c80:    9813        ..      LDR      r0,[sp,#0x4c]
        0x08003c82:    68a1        .h      LDR      r1,[r4,#8]
        0x08003c84:    0082        ..      LSLS     r2,r0,#2
        0x08003c86:    4668        hF      MOV      r0,sp
        0x08003c88:    3140        @1      ADDS     r1,r1,#0x40
        0x08003c8a:    f7fcfc08    ....    BL       __aeabi_memcpy4 ; 0x800049e
        0x08003c8e:    2109        .!      MOVS     r1,#9
        0x08003c90:    a812        ..      ADD      r0,sp,#0x48
        0x08003c92:    f002ff67    ..g.    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x08003c96:    2800        .(      CMP      r0,#0
        0x08003c98:    d1e5        ..      BNE      0x8003c66 ; ecp_mod_p521 + 14
        0x08003c9a:    68a0        .h      LDR      r0,[r4,#8]
        0x08003c9c:    f8b01040    ..@.    LDRH     r1,[r0,#0x40]
        0x08003ca0:    f3c10108    ....    UBFX     r1,r1,#0,#9
        0x08003ca4:    6401        .d      STR      r1,[r0,#0x40]
        0x08003ca6:    2011        .       MOVS     r0,#0x11
        0x08003ca8:    2100        .!      MOVS     r1,#0
        0x08003caa:    e003        ..      B        0x8003cb4 ; ecp_mod_p521 + 92
        0x08003cac:    68a2        .h      LDR      r2,[r4,#8]
        0x08003cae:    f8421020    B. .    STR      r1,[r2,r0,LSL #2]
        0x08003cb2:    1c40        @.      ADDS     r0,r0,#1
        0x08003cb4:    6862        bh      LDR      r2,[r4,#4]
        0x08003cb6:    4282        .B      CMP      r2,r0
        0x08003cb8:    d8f8        ..      BHI      0x8003cac ; ecp_mod_p521 + 84
        0x08003cba:    4621        !F      MOV      r1,r4
        0x08003cbc:    aa12        ..      ADD      r2,sp,#0x48
        0x08003cbe:    4608        .F      MOV      r0,r1
        0x08003cc0:    f001ff56    ..V.    BL       mbedtls_mpi_add_abs ; 0x8005b70
        0x08003cc4:    e7cf        ..      B        0x8003c66 ; ecp_mod_p521 + 14
        0x08003cc6:    0000        ..      MOVS     r0,r0
    i.ecp_modp
    ecp_modp
        0x08003cc8:    b570        p.      PUSH     {r4-r6,lr}
        0x08003cca:    4605        .F      MOV      r5,r0
        0x08003ccc:    6e48        Hn      LDR      r0,[r1,#0x64]
        0x08003cce:    460c        .F      MOV      r4,r1
        0x08003cd0:    b140        @.      CBZ      r0,0x8003ce4 ; ecp_modp + 28
        0x08003cd2:    6828        (h      LDR      r0,[r5,#0]
        0x08003cd4:    2800        .(      CMP      r0,#0
        0x08003cd6:    da0c        ..      BGE      0x8003cf2 ; ecp_modp + 42
        0x08003cd8:    2100        .!      MOVS     r1,#0
        0x08003cda:    4628        (F      MOV      r0,r5
        0x08003cdc:    f002f834    ..4.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08003ce0:    b970        p.      CBNZ     r0,0x8003d00 ; ecp_modp + 56
        0x08003ce2:    e006        ..      B        0x8003cf2 ; ecp_modp + 42
        0x08003ce4:    4629        )F      MOV      r1,r5
        0x08003ce6:    1d22        ".      ADDS     r2,r4,#4
        0x08003ce8:    e8bd4070    ..p@    POP      {r4-r6,lr}
        0x08003cec:    4608        .F      MOV      r0,r1
        0x08003cee:    f002bcb2    ....    B.W      mbedtls_mpi_mod_mpi ; 0x8006656
        0x08003cf2:    4628        (F      MOV      r0,r5
        0x08003cf4:    f001ffd7    ....    BL       mbedtls_mpi_bitlen ; 0x8005ca6
        0x08003cf8:    6da1        .m      LDR      r1,[r4,#0x58]
        0x08003cfa:    ebb00f41    ..A.    CMP      r0,r1,LSL #1
        0x08003cfe:    d901        ..      BLS      0x8003d04 ; ecp_modp + 60
        0x08003d00:    4812        .H      LDR      r0,[pc,#72] ; [0x8003d4c] = 0xffffb080
        0x08003d02:    bd70        p.      POP      {r4-r6,pc}
        0x08003d04:    6e61        an      LDR      r1,[r4,#0x64]
        0x08003d06:    4628        (F      MOV      r0,r5
        0x08003d08:    4788        .G      BLX      r1
        0x08003d0a:    e004        ..      B        0x8003d16 ; ecp_modp + 78
        0x08003d0c:    4629        )F      MOV      r1,r5
        0x08003d0e:    1d22        ".      ADDS     r2,r4,#4
        0x08003d10:    4608        .F      MOV      r0,r1
        0x08003d12:    f001ffa1    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08003d16:    0006        ..      MOVS     r6,r0
        0x08003d18:    d116        ..      BNE      0x8003d48 ; ecp_modp + 128
        0x08003d1a:    6828        (h      LDR      r0,[r5,#0]
        0x08003d1c:    2800        .(      CMP      r0,#0
        0x08003d1e:    da0d        ..      BGE      0x8003d3c ; ecp_modp + 116
        0x08003d20:    2100        .!      MOVS     r1,#0
        0x08003d22:    4628        (F      MOV      r0,r5
        0x08003d24:    f002f810    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08003d28:    2800        .(      CMP      r0,#0
        0x08003d2a:    d1ef        ..      BNE      0x8003d0c ; ecp_modp + 68
        0x08003d2c:    e006        ..      B        0x8003d3c ; ecp_modp + 116
        0x08003d2e:    4629        )F      MOV      r1,r5
        0x08003d30:    1d22        ".      ADDS     r2,r4,#4
        0x08003d32:    4608        .F      MOV      r0,r1
        0x08003d34:    f002ff93    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08003d38:    0006        ..      MOVS     r6,r0
        0x08003d3a:    d105        ..      BNE      0x8003d48 ; ecp_modp + 128
        0x08003d3c:    1d21        !.      ADDS     r1,r4,#4
        0x08003d3e:    4628        (F      MOV      r0,r5
        0x08003d40:    f002f81a    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08003d44:    2800        .(      CMP      r0,#0
        0x08003d46:    daf2        ..      BGE      0x8003d2e ; ecp_modp + 102
        0x08003d48:    4630        0F      MOV      r0,r6
        0x08003d4a:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x08003d4c:    ffffb080    ....    DCD    4294946944
    $t
    i.ecp_mul_comb
    ecp_mul_comb
        0x08003d50:    e92d4fff    -..O    PUSH     {r0-r11,lr}
        0x08003d54:    b0c9        ..      SUB      sp,sp,#0x124
        0x08003d56:    4605        .F      MOV      r5,r0
        0x08003d58:    f1000134    ..4.    ADD      r1,r0,#0x34
        0x08003d5c:    984c        L.      LDR      r0,[sp,#0x130]
        0x08003d5e:    f8ddb160    ..`.    LDR      r11,[sp,#0x160]
        0x08003d62:    300c        .0      ADDS     r0,r0,#0xc
        0x08003d64:    f002f808    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08003d68:    b928        (.      CBNZ     r0,0x8003d76 ; ecp_mul_comb + 38
        0x08003d6a:    f1050128    ..(.    ADD      r1,r5,#0x28
        0x08003d6e:    984c        L.      LDR      r0,[sp,#0x130]
        0x08003d70:    f002f802    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08003d74:    b138        8.      CBZ      r0,0x8003d86 ; ecp_mul_comb + 54
        0x08003d76:    2100        .!      MOVS     r1,#0
        0x08003d78:    6dea        .m      LDR      r2,[r5,#0x5c]
        0x08003d7a:    4689        .F      MOV      r9,r1
        0x08003d7c:    f5b27fc0    ....    CMP      r2,#0x180
        0x08003d80:    d303        ..      BCC      0x8003d8a ; ecp_mul_comb + 58
        0x08003d82:    2005        .       MOVS     r0,#5
        0x08003d84:    e002        ..      B        0x8003d8c ; ecp_mul_comb + 60
        0x08003d86:    2101        .!      MOVS     r1,#1
        0x08003d88:    e7f6        ..      B        0x8003d78 ; ecp_mul_comb + 40
        0x08003d8a:    2004        .       MOVS     r0,#4
        0x08003d8c:    f1b90f00    ....    CMP      r9,#0
        0x08003d90:    d000        ..      BEQ      0x8003d94 ; ecp_mul_comb + 68
        0x08003d92:    1c40        @.      ADDS     r0,r0,#1
        0x08003d94:    2806        .(      CMP      r0,#6
        0x08003d96:    d900        ..      BLS      0x8003d9a ; ecp_mul_comb + 74
        0x08003d98:    2006        .       MOVS     r0,#6
        0x08003d9a:    4282        .B      CMP      r2,r0
        0x08003d9c:    d800        ..      BHI      0x8003da0 ; ecp_mul_comb + 80
        0x08003d9e:    2002        .       MOVS     r0,#2
        0x08003da0:    4680        .F      MOV      r8,r0
        0x08003da2:    1e40        @.      SUBS     r0,r0,#1
        0x08003da4:    2101        .!      MOVS     r1,#1
        0x08003da6:    4081        .@      LSLS     r1,r1,r0
        0x08003da8:    b2ce        ..      UXTB     r6,r1
        0x08003daa:    1811        ..      ADDS     r1,r2,r0
        0x08003dac:    fbb1faf8    ....    UDIV     r10,r1,r8
        0x08003db0:    f1b90f00    ....    CMP      r9,#0
        0x08003db4:    d001        ..      BEQ      0x8003dba ; ecp_mul_comb + 106
        0x08003db6:    6f6c        lo      LDR      r4,[r5,#0x74]
        0x08003db8:    bb1c        ..      CBNZ     r4,0x8003e02 ; ecp_mul_comb + 178
        0x08003dba:    2124        $!      MOVS     r1,#0x24
        0x08003dbc:    4630        0F      MOV      r0,r6
        0x08003dbe:    f7fcfa29    ..).    BL       calloc ; 0x8000214
        0x08003dc2:    0004        ..      MOVS     r4,r0
        0x08003dc4:    d001        ..      BEQ      0x8003dca ; ecp_mul_comb + 122
        0x08003dc6:    2700        .'      MOVS     r7,#0
        0x08003dc8:    e00a        ..      B        0x8003de0 ; ecp_mul_comb + 144
        0x08003dca:    4f31        1O      LDR      r7,[pc,#196] ; [0x8003e90] = 0xffffb280
        0x08003dcc:    e043        C.      B        0x8003e56 ; ecp_mul_comb + 262
        0x08003dce:    bf00        ..      NOP      
        0x08003dd0:    eb0700c7    ....    ADD      r0,r7,r7,LSL #3
        0x08003dd4:    eb040080    ....    ADD      r0,r4,r0,LSL #2
        0x08003dd8:    f001f9de    ....    BL       mbedtls_ecp_point_init ; 0x8005198
        0x08003ddc:    1c7f        ..      ADDS     r7,r7,#1
        0x08003dde:    b2ff        ..      UXTB     r7,r7
        0x08003de0:    42b7        .B      CMP      r7,r6
        0x08003de2:    d3f5        ..      BCC      0x8003dd0 ; ecp_mul_comb + 128
        0x08003de4:    e9cdab00    ....    STRD     r10,r11,[sp,#0]
        0x08003de8:    4643        CF      MOV      r3,r8
        0x08003dea:    4621        !F      MOV      r1,r4
        0x08003dec:    4628        (F      MOV      r0,r5
        0x08003dee:    9a4c        L.      LDR      r2,[sp,#0x130]
        0x08003df0:    f000fa8a    ....    BL       ecp_precompute_comb ; 0x8004308
        0x08003df4:    0007        ..      MOVS     r7,r0
        0x08003df6:    d12e        ..      BNE      0x8003e56 ; ecp_mul_comb + 262
        0x08003df8:    f1b90f00    ....    CMP      r9,#0
        0x08003dfc:    d001        ..      BEQ      0x8003e02 ; ecp_mul_comb + 178
        0x08003dfe:    e9c5461d    ...F    STRD     r4,r6,[r5,#0x74]
        0x08003e02:    4642        BF      MOV      r2,r8
        0x08003e04:    46d8        .F      MOV      r8,r11
        0x08003e06:    e9ddb14a    ..J.    LDRD     r11,r1,[sp,#0x128]
        0x08003e0a:    a847        G.      ADD      r0,sp,#0x11c
        0x08003e0c:    f8dd9158    ..X.    LDR      r9,[sp,#0x158]
        0x08003e10:    e9cd2000    ...     STRD     r2,r0,[sp,#0]
        0x08003e14:    4653        SF      MOV      r3,r10
        0x08003e16:    9f57        W.      LDR      r7,[sp,#0x15c]
        0x08003e18:    aa05        ..      ADD      r2,sp,#0x14
        0x08003e1a:    4628        (F      MOV      r0,r5
        0x08003e1c:    f7fefba2    ....    BL       ecp_comb_recode_scalar ; 0x8002564
        0x08003e20:    b9c0        ..      CBNZ     r0,0x8003e54 ; ecp_mul_comb + 260
        0x08003e22:    a805        ..      ADD      r0,sp,#0x14
        0x08003e24:    e9cd0a00    ....    STRD     r0,r10,[sp,#0]
        0x08003e28:    f8cd9008    ....    STR      r9,[sp,#8]
        0x08003e2c:    e9cd7803    ...x    STRD     r7,r8,[sp,#0xc]
        0x08003e30:    4633        3F      MOV      r3,r6
        0x08003e32:    4622        "F      MOV      r2,r4
        0x08003e34:    4659        YF      MOV      r1,r11
        0x08003e36:    4628        (F      MOV      r0,r5
        0x08003e38:    f000f82c    ..,.    BL       ecp_mul_comb_core ; 0x8003e94
        0x08003e3c:    b950        P.      CBNZ     r0,0x8003e54 ; ecp_mul_comb + 260
        0x08003e3e:    f89d211c    ...!    LDRB     r2,[sp,#0x11c]
        0x08003e42:    4659        YF      MOV      r1,r11
        0x08003e44:    4628        (F      MOV      r0,r5
        0x08003e46:    f000fbb5    ....    BL       ecp_safe_invert_jac ; 0x80045b4
        0x08003e4a:    b918        ..      CBNZ     r0,0x8003e54 ; ecp_mul_comb + 260
        0x08003e4c:    4659        YF      MOV      r1,r11
        0x08003e4e:    4628        (F      MOV      r0,r5
        0x08003e50:    f000f907    ....    BL       ecp_normalize_jac ; 0x8004062
        0x08003e54:    4607        .F      MOV      r7,r0
        0x08003e56:    6f68        ho      LDR      r0,[r5,#0x74]
        0x08003e58:    42a0        .B      CMP      r0,r4
        0x08003e5a:    d010        ..      BEQ      0x8003e7e ; ecp_mul_comb + 302
        0x08003e5c:    b17c        |.      CBZ      r4,0x8003e7e ; ecp_mul_comb + 302
        0x08003e5e:    2500        .%      MOVS     r5,#0
        0x08003e60:    e008        ..      B        0x8003e74 ; ecp_mul_comb + 292
        0x08003e62:    bf00        ..      NOP      
        0x08003e64:    eb0500c5    ....    ADD      r0,r5,r5,LSL #3
        0x08003e68:    eb040080    ....    ADD      r0,r4,r0,LSL #2
        0x08003e6c:    f001f984    ....    BL       mbedtls_ecp_point_free ; 0x8005178
        0x08003e70:    1c6d        m.      ADDS     r5,r5,#1
        0x08003e72:    b2ed        ..      UXTB     r5,r5
        0x08003e74:    42b5        .B      CMP      r5,r6
        0x08003e76:    d3f5        ..      BCC      0x8003e64 ; ecp_mul_comb + 276
        0x08003e78:    4620         F      MOV      r0,r4
        0x08003e7a:    f7fcfa0e    ....    BL       free ; 0x800029a
        0x08003e7e:    b117        ..      CBZ      r7,0x8003e86 ; ecp_mul_comb + 310
        0x08003e80:    984a        J.      LDR      r0,[sp,#0x128]
        0x08003e82:    f001f979    ..y.    BL       mbedtls_ecp_point_free ; 0x8005178
        0x08003e86:    b04d        M.      ADD      sp,sp,#0x134
        0x08003e88:    4638        8F      MOV      r0,r7
        0x08003e8a:    e8bd8ff0    ....    POP      {r4-r11,pc}
    $d
        0x08003e8e:    0000        ..      DCW    0
        0x08003e90:    ffffb280    ....    DCD    4294947456
    $t
    i.ecp_mul_comb_core
    ecp_mul_comb_core
        0x08003e94:    e92d4fff    -..O    PUSH     {r0-r11,lr}
        0x08003e98:    b08b        ..      SUB      sp,sp,#0x2c
        0x08003e9a:    460e        .F      MOV      r6,r1
        0x08003e9c:    a919        ..      ADD      r1,sp,#0x64
        0x08003e9e:    469a        .F      MOV      r10,r3
        0x08003ea0:    e8910310    ....    LDM      r1,{r4,r8,r9}
        0x08003ea4:    4693        .F      MOV      r11,r2
        0x08003ea6:    a801        ..      ADD      r0,sp,#4
        0x08003ea8:    9f18        ..      LDR      r7,[sp,#0x60]
        0x08003eaa:    f001f975    ..u.    BL       mbedtls_ecp_point_init ; 0x8005198
        0x08003eae:    5d38        8]      LDRB     r0,[r7,r4]
        0x08003eb0:    9000        ..      STR      r0,[sp,#0]
        0x08003eb2:    4653        SF      MOV      r3,r10
        0x08003eb4:    465a        ZF      MOV      r2,r11
        0x08003eb6:    4631        1F      MOV      r1,r6
        0x08003eb8:    980b        ..      LDR      r0,[sp,#0x2c]
        0x08003eba:    f000fb9d    ....    BL       ecp_select_comb ; 0x80045f8
        0x08003ebe:    0005        ..      MOVS     r5,r0
        0x08003ec0:    d12c        ,.      BNE      0x8003f1c ; ecp_mul_comb_core + 136
        0x08003ec2:    2101        .!      MOVS     r1,#1
        0x08003ec4:    f1060018    ....    ADD      r0,r6,#0x18
        0x08003ec8:    f002fba8    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x08003ecc:    0005        ..      MOVS     r5,r0
        0x08003ece:    d125        %.      BNE      0x8003f1c ; ecp_mul_comb_core + 136
        0x08003ed0:    f1b80000    ....    SUBS     r0,r8,#0
        0x08003ed4:    d020         .      BEQ      0x8003f18 ; ecp_mul_comb_core + 132
        0x08003ed6:    4602        .F      MOV      r2,r0
        0x08003ed8:    464b        KF      MOV      r3,r9
        0x08003eda:    4631        1F      MOV      r1,r6
        0x08003edc:    980b        ..      LDR      r0,[sp,#0x2c]
        0x08003ede:    f000fa97    ....    BL       ecp_randomize_jac ; 0x8004410
        0x08003ee2:    e017        ..      B        0x8003f14 ; ecp_mul_comb_core + 128
        0x08003ee4:    4632        2F      MOV      r2,r6
        0x08003ee6:    4611        .F      MOV      r1,r2
        0x08003ee8:    1e64        d.      SUBS     r4,r4,#1
        0x08003eea:    980b        ..      LDR      r0,[sp,#0x2c]
        0x08003eec:    f7fefcf2    ....    BL       ecp_double_jac ; 0x80028d4
        0x08003ef0:    0005        ..      MOVS     r5,r0
        0x08003ef2:    d113        ..      BNE      0x8003f1c ; ecp_mul_comb_core + 136
        0x08003ef4:    5d38        8]      LDRB     r0,[r7,r4]
        0x08003ef6:    9000        ..      STR      r0,[sp,#0]
        0x08003ef8:    4653        SF      MOV      r3,r10
        0x08003efa:    465a        ZF      MOV      r2,r11
        0x08003efc:    a901        ..      ADD      r1,sp,#4
        0x08003efe:    980b        ..      LDR      r0,[sp,#0x2c]
