openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08003f00:    f000fb7a    ..z.    BL       ecp_select_comb ; 0x80045f8
        0x08003f04:    0005        ..      MOVS     r5,r0
        0x08003f06:    d109        ..      BNE      0x8003f1c ; ecp_mul_comb_core + 136
        0x08003f08:    4632        2F      MOV      r2,r6
        0x08003f0a:    ab01        ..      ADD      r3,sp,#4
        0x08003f0c:    4611        .F      MOV      r1,r2
        0x08003f0e:    980b        ..      LDR      r0,[sp,#0x2c]
        0x08003f10:    f7fef8dc    ....    BL       ecp_add_mixed ; 0x80020cc
        0x08003f14:    0005        ..      MOVS     r5,r0
        0x08003f16:    d101        ..      BNE      0x8003f1c ; ecp_mul_comb_core + 136
        0x08003f18:    2c00        .,      CMP      r4,#0
        0x08003f1a:    d1e3        ..      BNE      0x8003ee4 ; ecp_mul_comb_core + 80
        0x08003f1c:    a801        ..      ADD      r0,sp,#4
        0x08003f1e:    f001f92b    ..+.    BL       mbedtls_ecp_point_free ; 0x8005178
        0x08003f22:    b00f        ..      ADD      sp,sp,#0x3c
        0x08003f24:    4628        (F      MOV      r0,r5
        0x08003f26:    e8bd8ff0    ....    POP      {r4-r11,pc}
    i.ecp_mul_mxz
    ecp_mul_mxz
        0x08003f2a:    e92d4ff0    -..O    PUSH     {r4-r11,lr}
        0x08003f2e:    b08f        ..      SUB      sp,sp,#0x3c
        0x08003f30:    4605        .F      MOV      r5,r0
        0x08003f32:    e9dd7918    ...y    LDRD     r7,r9,[sp,#0x60]
        0x08003f36:    4698        .F      MOV      r8,r3
        0x08003f38:    4692        .F      MOV      r10,r2
        0x08003f3a:    460e        .F      MOV      r6,r1
        0x08003f3c:    a802        ..      ADD      r0,sp,#8
        0x08003f3e:    f001f92b    ..+.    BL       mbedtls_ecp_point_init ; 0x8005198
        0x08003f42:    a80b        ..      ADD      r0,sp,#0x2c
        0x08003f44:    f002fa18    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08003f48:    4641        AF      MOV      r1,r8
        0x08003f4a:    a80b        ..      ADD      r0,sp,#0x2c
        0x08003f4c:    f001ff5a    ..Z.    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08003f50:    0004        ..      MOVS     r4,r0
        0x08003f52:    d17c        |.      BNE      0x800404e ; ecp_mul_mxz + 292
        0x08003f54:    4641        AF      MOV      r1,r8
        0x08003f56:    a802        ..      ADD      r0,sp,#8
        0x08003f58:    f000fe76    ..v.    BL       mbedtls_ecp_copy ; 0x8004c48
        0x08003f5c:    0004        ..      MOVS     r4,r0
        0x08003f5e:    d176        v.      BNE      0x800404e ; ecp_mul_mxz + 292
        0x08003f60:    2101        .!      MOVS     r1,#1
        0x08003f62:    4630        0F      MOV      r0,r6
        0x08003f64:    f002fb5a    ..Z.    BL       mbedtls_mpi_lset ; 0x800661c
        0x08003f68:    0004        ..      MOVS     r4,r0
        0x08003f6a:    d170        p.      BNE      0x800404e ; ecp_mul_mxz + 292
        0x08003f6c:    f1060018    ....    ADD      r0,r6,#0x18
        0x08003f70:    2100        .!      MOVS     r1,#0
        0x08003f72:    4683        .F      MOV      r11,r0
        0x08003f74:    f002fb52    ..R.    BL       mbedtls_mpi_lset ; 0x800661c
        0x08003f78:    0004        ..      MOVS     r4,r0
        0x08003f7a:    d168        h.      BNE      0x800404e ; ecp_mul_mxz + 292
        0x08003f7c:    f106000c    ....    ADD      r0,r6,#0xc
        0x08003f80:    f002f931    ..1.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08003f84:    e006        ..      B        0x8003f94 ; ecp_mul_mxz + 106
        0x08003f86:    a902        ..      ADD      r1,sp,#8
        0x08003f88:    1d2a        *.      ADDS     r2,r5,#4
        0x08003f8a:    4608        .F      MOV      r0,r1
        0x08003f8c:    f002fe67    ..g.    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08003f90:    0004        ..      MOVS     r4,r0
        0x08003f92:    d15c        \.      BNE      0x800404e ; ecp_mul_mxz + 292
        0x08003f94:    1d29        ).      ADDS     r1,r5,#4
        0x08003f96:    a802        ..      ADD      r0,sp,#8
        0x08003f98:    f001feee    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08003f9c:    2800        .(      CMP      r0,#0
        0x08003f9e:    daf2        ..      BGE      0x8003f86 ; ecp_mul_mxz + 92
        0x08003fa0:    b13f        ?.      CBZ      r7,0x8003fb2 ; ecp_mul_mxz + 136
        0x08003fa2:    464b        KF      MOV      r3,r9
        0x08003fa4:    463a        :F      MOV      r2,r7
        0x08003fa6:    a902        ..      ADD      r1,sp,#8
        0x08003fa8:    4628        (F      MOV      r0,r5
        0x08003faa:    f000fab3    ....    BL       ecp_randomize_mxz ; 0x8004514
        0x08003fae:    0004        ..      MOVS     r4,r0
        0x08003fb0:    d14d        M.      BNE      0x800404e ; ecp_mul_mxz + 292
        0x08003fb2:    4650        PF      MOV      r0,r10
        0x08003fb4:    f001fe77    ..w.    BL       mbedtls_mpi_bitlen ; 0x8005ca6
        0x08003fb8:    4607        .F      MOV      r7,r0
        0x08003fba:    f10d0820    .. .    ADD      r8,sp,#0x20
        0x08003fbe:    e02d        -.      B        0x800401c ; ecp_mul_mxz + 242
        0x08003fc0:    4639        9F      MOV      r1,r7
        0x08003fc2:    4650        PF      MOV      r0,r10
        0x08003fc4:    f002f9a0    ....    BL       mbedtls_mpi_get_bit ; 0x8006308
        0x08003fc8:    b2c0        ..      UXTB     r0,r0
        0x08003fca:    4681        .F      MOV      r9,r0
        0x08003fcc:    4602        .F      MOV      r2,r0
        0x08003fce:    a902        ..      ADD      r1,sp,#8
        0x08003fd0:    4630        0F      MOV      r0,r6
        0x08003fd2:    f002fd07    ....    BL       mbedtls_mpi_safe_cond_swap ; 0x80069e4
        0x08003fd6:    0004        ..      MOVS     r4,r0
        0x08003fd8:    d139        9.      BNE      0x800404e ; ecp_mul_mxz + 292
        0x08003fda:    464a        JF      MOV      r2,r9
        0x08003fdc:    4641        AF      MOV      r1,r8
        0x08003fde:    4658        XF      MOV      r0,r11
        0x08003fe0:    f002fd00    ....    BL       mbedtls_mpi_safe_cond_swap ; 0x80069e4
        0x08003fe4:    0004        ..      MOVS     r4,r0
        0x08003fe6:    d132        2.      BNE      0x800404e ; ecp_mul_mxz + 292
        0x08003fe8:    a90b        ..      ADD      r1,sp,#0x2c
        0x08003fea:    a802        ..      ADD      r0,sp,#8
        0x08003fec:    e9cd0100    ....    STRD     r0,r1,[sp,#0]
        0x08003ff0:    4633        3F      MOV      r3,r6
        0x08003ff2:    aa02        ..      ADD      r2,sp,#8
        0x08003ff4:    4619        .F      MOV      r1,r3
        0x08003ff6:    4628        (F      MOV      r0,r5
        0x08003ff8:    f7fefafe    ....    BL       ecp_double_add_mxz ; 0x80025f8
        0x08003ffc:    0004        ..      MOVS     r4,r0
        0x08003ffe:    d126        &.      BNE      0x800404e ; ecp_mul_mxz + 292
        0x08004000:    464a        JF      MOV      r2,r9
        0x08004002:    a902        ..      ADD      r1,sp,#8
        0x08004004:    4630        0F      MOV      r0,r6
        0x08004006:    f002fced    ....    BL       mbedtls_mpi_safe_cond_swap ; 0x80069e4
        0x0800400a:    0004        ..      MOVS     r4,r0
        0x0800400c:    d11f        ..      BNE      0x800404e ; ecp_mul_mxz + 292
        0x0800400e:    464a        JF      MOV      r2,r9
        0x08004010:    4641        AF      MOV      r1,r8
        0x08004012:    4658        XF      MOV      r0,r11
        0x08004014:    f002fce6    ....    BL       mbedtls_mpi_safe_cond_swap ; 0x80069e4
        0x08004018:    0004        ..      MOVS     r4,r0
        0x0800401a:    d118        ..      BNE      0x800404e ; ecp_mul_mxz + 292
        0x0800401c:    1e7f        ..      SUBS     r7,r7,#1
        0x0800401e:    d2cf        ..      BCS      0x8003fc0 ; ecp_mul_mxz + 150
        0x08004020:    465c        \F      MOV      r4,r11
        0x08004022:    1d2a        *.      ADDS     r2,r5,#4
        0x08004024:    4659        YF      MOV      r1,r11
        0x08004026:    4620         F      MOV      r0,r4
        0x08004028:    f002f9ac    ....    BL       mbedtls_mpi_inv_mod ; 0x8006384
        0x0800402c:    b970        p.      CBNZ     r0,0x800404c ; ecp_mul_mxz + 290
        0x0800402e:    4631        1F      MOV      r1,r6
        0x08004030:    4622        "F      MOV      r2,r4
        0x08004032:    4608        .F      MOV      r0,r1
        0x08004034:    f002fb4c    ..L.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08004038:    b940        @.      CBNZ     r0,0x800404c ; ecp_mul_mxz + 290
        0x0800403a:    4629        )F      MOV      r1,r5
        0x0800403c:    4630        0F      MOV      r0,r6
        0x0800403e:    f7fffe43    ..C.    BL       ecp_modp ; 0x8003cc8
        0x08004042:    b918        ..      CBNZ     r0,0x800404c ; ecp_mul_mxz + 290
        0x08004044:    2101        .!      MOVS     r1,#1
        0x08004046:    4620         F      MOV      r0,r4
        0x08004048:    f002fae8    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x0800404c:    4604        .F      MOV      r4,r0
        0x0800404e:    a802        ..      ADD      r0,sp,#8
        0x08004050:    f001f892    ....    BL       mbedtls_ecp_point_free ; 0x8005178
        0x08004054:    a80b        ..      ADD      r0,sp,#0x2c
        0x08004056:    f002f8c6    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x0800405a:    b00f        ..      ADD      sp,sp,#0x3c
        0x0800405c:    4620         F      MOV      r0,r4
        0x0800405e:    e8bd8ff0    ....    POP      {r4-r11,pc}
    i.ecp_normalize_jac
    ecp_normalize_jac
        0x08004062:    b5f0        ..      PUSH     {r4-r7,lr}
        0x08004064:    460d        .F      MOV      r5,r1
        0x08004066:    4606        .F      MOV      r6,r0
        0x08004068:    f1050018    ....    ADD      r0,r5,#0x18
        0x0800406c:    b087        ..      SUB      sp,sp,#0x1c
        0x0800406e:    2100        .!      MOVS     r1,#0
        0x08004070:    4607        .F      MOV      r7,r0
        0x08004072:    f001fe69    ..i.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08004076:    2800        .(      CMP      r0,#0
        0x08004078:    d04e        N.      BEQ      0x8004118 ; ecp_normalize_jac + 182
        0x0800407a:    4668        hF      MOV      r0,sp
        0x0800407c:    f002f97c    ..|.    BL       mbedtls_mpi_init ; 0x8006378
        0x08004080:    a803        ..      ADD      r0,sp,#0xc
        0x08004082:    f002f979    ..y.    BL       mbedtls_mpi_init ; 0x8006378
        0x08004086:    1d32        2.      ADDS     r2,r6,#4
        0x08004088:    4639        9F      MOV      r1,r7
        0x0800408a:    4668        hF      MOV      r0,sp
        0x0800408c:    f002f97a    ..z.    BL       mbedtls_mpi_inv_mod ; 0x8006384
        0x08004090:    0004        ..      MOVS     r4,r0
        0x08004092:    d13a        :.      BNE      0x800410a ; ecp_normalize_jac + 168
        0x08004094:    466a        jF      MOV      r2,sp
        0x08004096:    4611        .F      MOV      r1,r2
        0x08004098:    a803        ..      ADD      r0,sp,#0xc
        0x0800409a:    f002fb19    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x0800409e:    0004        ..      MOVS     r4,r0
        0x080040a0:    d133        3.      BNE      0x800410a ; ecp_normalize_jac + 168
        0x080040a2:    4631        1F      MOV      r1,r6
        0x080040a4:    a803        ..      ADD      r0,sp,#0xc
        0x080040a6:    f7fffe0f    ....    BL       ecp_modp ; 0x8003cc8
        0x080040aa:    0004        ..      MOVS     r4,r0
        0x080040ac:    d12d        -.      BNE      0x800410a ; ecp_normalize_jac + 168
        0x080040ae:    4629        )F      MOV      r1,r5
        0x080040b0:    aa03        ..      ADD      r2,sp,#0xc
        0x080040b2:    4608        .F      MOV      r0,r1
        0x080040b4:    f002fb0c    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x080040b8:    0004        ..      MOVS     r4,r0
        0x080040ba:    d126        &.      BNE      0x800410a ; ecp_normalize_jac + 168
        0x080040bc:    4631        1F      MOV      r1,r6
        0x080040be:    4628        (F      MOV      r0,r5
        0x080040c0:    f7fffe02    ....    BL       ecp_modp ; 0x8003cc8
        0x080040c4:    0004        ..      MOVS     r4,r0
        0x080040c6:    d120         .      BNE      0x800410a ; ecp_normalize_jac + 168
        0x080040c8:    f105010c    ....    ADD      r1,r5,#0xc
        0x080040cc:    aa03        ..      ADD      r2,sp,#0xc
        0x080040ce:    460d        .F      MOV      r5,r1
        0x080040d0:    4608        .F      MOV      r0,r1
        0x080040d2:    f002fafd    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x080040d6:    0004        ..      MOVS     r4,r0
        0x080040d8:    d117        ..      BNE      0x800410a ; ecp_normalize_jac + 168
        0x080040da:    4631        1F      MOV      r1,r6
        0x080040dc:    4628        (F      MOV      r0,r5
        0x080040de:    f7fffdf3    ....    BL       ecp_modp ; 0x8003cc8
        0x080040e2:    0004        ..      MOVS     r4,r0
        0x080040e4:    d111        ..      BNE      0x800410a ; ecp_normalize_jac + 168
        0x080040e6:    4629        )F      MOV      r1,r5
        0x080040e8:    466a        jF      MOV      r2,sp
        0x080040ea:    4608        .F      MOV      r0,r1
        0x080040ec:    f002faf0    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x080040f0:    0004        ..      MOVS     r4,r0
        0x080040f2:    d10a        ..      BNE      0x800410a ; ecp_normalize_jac + 168
        0x080040f4:    4631        1F      MOV      r1,r6
        0x080040f6:    4628        (F      MOV      r0,r5
        0x080040f8:    f7fffde6    ....    BL       ecp_modp ; 0x8003cc8
        0x080040fc:    0004        ..      MOVS     r4,r0
        0x080040fe:    d104        ..      BNE      0x800410a ; ecp_normalize_jac + 168
        0x08004100:    2101        .!      MOVS     r1,#1
        0x08004102:    4638        8F      MOV      r0,r7
        0x08004104:    f002fa8a    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x08004108:    4604        .F      MOV      r4,r0
        0x0800410a:    4668        hF      MOV      r0,sp
        0x0800410c:    f002f86b    ..k.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08004110:    a803        ..      ADD      r0,sp,#0xc
        0x08004112:    f002f868    ..h.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08004116:    4620         F      MOV      r0,r4
        0x08004118:    b007        ..      ADD      sp,sp,#0x1c
        0x0800411a:    bdf0        ..      POP      {r4-r7,pc}
    i.ecp_normalize_jac_many
    ecp_normalize_jac_many
        0x0800411c:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x08004120:    b08e        ..      SUB      sp,sp,#0x38
        0x08004122:    4688        .F      MOV      r8,r1
        0x08004124:    4681        .F      MOV      r9,r0
        0x08004126:    4616        .F      MOV      r6,r2
        0x08004128:    2a02        .*      CMP      r2,#2
        0x0800412a:    d207        ..      BCS      0x800413c ; ecp_normalize_jac_many + 32
        0x0800412c:    4648        HF      MOV      r0,r9
        0x0800412e:    f8d81000    ....    LDR      r1,[r8,#0]
        0x08004132:    f7ffff96    ....    BL       ecp_normalize_jac ; 0x8004062
        0x08004136:    b00e        ..      ADD      sp,sp,#0x38
        0x08004138:    e8bd87f0    ....    POP      {r4-r10,pc}
        0x0800413c:    210c        .!      MOVS     r1,#0xc
        0x0800413e:    4610        .F      MOV      r0,r2
        0x08004140:    f7fcf868    ..h.    BL       calloc ; 0x8000214
        0x08004144:    0007        ..      MOVS     r7,r0
        0x08004146:    d001        ..      BEQ      0x800414c ; ecp_normalize_jac_many + 48
        0x08004148:    2400        .$      MOVS     r4,#0
        0x0800414a:    e008        ..      B        0x800415e ; ecp_normalize_jac_many + 66
        0x0800414c:    486d        mH      LDR      r0,[pc,#436] ; [0x8004304] = 0xffffb280
        0x0800414e:    e7f2        ..      B        0x8004136 ; ecp_normalize_jac_many + 26
        0x08004150:    eb040044    ..D.    ADD      r0,r4,r4,LSL #1
        0x08004154:    eb070080    ....    ADD      r0,r7,r0,LSL #2
        0x08004158:    f002f90e    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x0800415c:    1c64        d.      ADDS     r4,r4,#1
        0x0800415e:    42b4        .B      CMP      r4,r6
        0x08004160:    d3f6        ..      BCC      0x8004150 ; ecp_normalize_jac_many + 52
        0x08004162:    a802        ..      ADD      r0,sp,#8
        0x08004164:    f002f908    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08004168:    a809        ..      ADD      r0,sp,#0x24
        0x0800416a:    f002f905    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x0800416e:    a805        ..      ADD      r0,sp,#0x14
        0x08004170:    f002f902    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08004174:    f8d81000    ....    LDR      r1,[r8,#0]
        0x08004178:    4638        8F      MOV      r0,r7
        0x0800417a:    3118        .1      ADDS     r1,r1,#0x18
        0x0800417c:    f001fe42    ..B.    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08004180:    0004        ..      MOVS     r4,r0
        0x08004182:    d17d        }.      BNE      0x8004280 ; ecp_normalize_jac_many + 356
        0x08004184:    2501        .%      MOVS     r5,#1
        0x08004186:    e014        ..      B        0x80041b2 ; ecp_normalize_jac_many + 150
        0x08004188:    eb050045    ..E.    ADD      r0,r5,r5,LSL #1
        0x0800418c:    f8582025    X.%     LDR      r2,[r8,r5,LSL #2]
        0x08004190:    eb070080    ....    ADD      r0,r7,r0,LSL #2
        0x08004194:    4682        .F      MOV      r10,r0
        0x08004196:    f1a0010c    ....    SUB      r1,r0,#0xc
        0x0800419a:    3218        .2      ADDS     r2,r2,#0x18
        0x0800419c:    f002fa98    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x080041a0:    0004        ..      MOVS     r4,r0
        0x080041a2:    d16d        m.      BNE      0x8004280 ; ecp_normalize_jac_many + 356
        0x080041a4:    4650        PF      MOV      r0,r10
        0x080041a6:    4649        IF      MOV      r1,r9
        0x080041a8:    f7fffd8e    ....    BL       ecp_modp ; 0x8003cc8
        0x080041ac:    0004        ..      MOVS     r4,r0
        0x080041ae:    d167        g.      BNE      0x8004280 ; ecp_normalize_jac_many + 356
        0x080041b0:    1c6d        m.      ADDS     r5,r5,#1
        0x080041b2:    42b5        .B      CMP      r5,r6
        0x080041b4:    d3e8        ..      BCC      0x8004188 ; ecp_normalize_jac_many + 108
        0x080041b6:    eb060046    ..F.    ADD      r0,r6,r6,LSL #1
        0x080041ba:    eb070180    ....    ADD      r1,r7,r0,LSL #2
        0x080041be:    f1090204    ....    ADD      r2,r9,#4
        0x080041c2:    a802        ..      ADD      r0,sp,#8
        0x080041c4:    390c        .9      SUBS     r1,r1,#0xc
        0x080041c6:    f002f8dd    ....    BL       mbedtls_mpi_inv_mod ; 0x8006384
        0x080041ca:    0004        ..      MOVS     r4,r0
        0x080041cc:    d158        X.      BNE      0x8004280 ; ecp_normalize_jac_many + 356
        0x080041ce:    1e75        u.      SUBS     r5,r6,#1
        0x080041d0:    b15d        ].      CBZ      r5,0x80041ea ; ecp_normalize_jac_many + 206
        0x080041d2:    eb050045    ..E.    ADD      r0,r5,r5,LSL #1
        0x080041d6:    eb070280    ....    ADD      r2,r7,r0,LSL #2
        0x080041da:    a902        ..      ADD      r1,sp,#8
        0x080041dc:    a809        ..      ADD      r0,sp,#0x24
        0x080041de:    3a0c        .:      SUBS     r2,r2,#0xc
        0x080041e0:    f002fa76    ..v.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x080041e4:    0004        ..      MOVS     r4,r0
        0x080041e6:    d173        s.      BNE      0x80042d0 ; ecp_normalize_jac_many + 436
        0x080041e8:    e004        ..      B        0x80041f4 ; ecp_normalize_jac_many + 216
        0x080041ea:    a902        ..      ADD      r1,sp,#8
        0x080041ec:    a809        ..      ADD      r0,sp,#0x24
        0x080041ee:    f001fe09    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x080041f2:    e012        ..      B        0x800421a ; ecp_normalize_jac_many + 254
        0x080041f4:    4649        IF      MOV      r1,r9
        0x080041f6:    a809        ..      ADD      r0,sp,#0x24
        0x080041f8:    f7fffd66    ..f.    BL       ecp_modp ; 0x8003cc8
        0x080041fc:    0004        ..      MOVS     r4,r0
        0x080041fe:    d167        g.      BNE      0x80042d0 ; ecp_normalize_jac_many + 436
        0x08004200:    f8582025    X.%     LDR      r2,[r8,r5,LSL #2]
        0x08004204:    a902        ..      ADD      r1,sp,#8
        0x08004206:    4608        .F      MOV      r0,r1
        0x08004208:    3218        .2      ADDS     r2,r2,#0x18
        0x0800420a:    f002fa61    ..a.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x0800420e:    0004        ..      MOVS     r4,r0
        0x08004210:    d15e        ^.      BNE      0x80042d0 ; ecp_normalize_jac_many + 436
        0x08004212:    4649        IF      MOV      r1,r9
        0x08004214:    a802        ..      ADD      r0,sp,#8
        0x08004216:    f7fffd57    ..W.    BL       ecp_modp ; 0x8003cc8
        0x0800421a:    0004        ..      MOVS     r4,r0
        0x0800421c:    d158        X.      BNE      0x80042d0 ; ecp_normalize_jac_many + 436
        0x0800421e:    aa09        ..      ADD      r2,sp,#0x24
        0x08004220:    4611        .F      MOV      r1,r2
        0x08004222:    a805        ..      ADD      r0,sp,#0x14
        0x08004224:    f002fa54    ..T.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08004228:    0004        ..      MOVS     r4,r0
        0x0800422a:    d151        Q.      BNE      0x80042d0 ; ecp_normalize_jac_many + 436
        0x0800422c:    4649        IF      MOV      r1,r9
        0x0800422e:    a805        ..      ADD      r0,sp,#0x14
        0x08004230:    f7fffd4a    ..J.    BL       ecp_modp ; 0x8003cc8
        0x08004234:    0004        ..      MOVS     r4,r0
        0x08004236:    d14b        K.      BNE      0x80042d0 ; ecp_normalize_jac_many + 436
        0x08004238:    f8580025    X.%.    LDR      r0,[r8,r5,LSL #2]
        0x0800423c:    aa05        ..      ADD      r2,sp,#0x14
        0x0800423e:    4601        .F      MOV      r1,r0
        0x08004240:    f002fa46    ..F.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08004244:    0004        ..      MOVS     r4,r0
        0x08004246:    d143        C.      BNE      0x80042d0 ; ecp_normalize_jac_many + 436
        0x08004248:    f8580025    X.%.    LDR      r0,[r8,r5,LSL #2]
        0x0800424c:    4649        IF      MOV      r1,r9
        0x0800424e:    f7fffd3b    ..;.    BL       ecp_modp ; 0x8003cc8
        0x08004252:    0004        ..      MOVS     r4,r0
        0x08004254:    d13c        <.      BNE      0x80042d0 ; ecp_normalize_jac_many + 436
        0x08004256:    f8580025    X.%.    LDR      r0,[r8,r5,LSL #2]
        0x0800425a:    aa05        ..      ADD      r2,sp,#0x14
        0x0800425c:    300c        .0      ADDS     r0,r0,#0xc
        0x0800425e:    4601        .F      MOV      r1,r0
