openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08004260:    f002fa36    ..6.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08004264:    0004        ..      MOVS     r4,r0
        0x08004266:    d133        3.      BNE      0x80042d0 ; ecp_normalize_jac_many + 436
        0x08004268:    f8580025    X.%.    LDR      r0,[r8,r5,LSL #2]
        0x0800426c:    4649        IF      MOV      r1,r9
        0x0800426e:    300c        .0      ADDS     r0,r0,#0xc
        0x08004270:    f7fffd2a    ..*.    BL       ecp_modp ; 0x8003cc8
        0x08004274:    0004        ..      MOVS     r4,r0
        0x08004276:    d12b        +.      BNE      0x80042d0 ; ecp_normalize_jac_many + 436
        0x08004278:    f8580025    X.%.    LDR      r0,[r8,r5,LSL #2]
        0x0800427c:    300c        .0      ADDS     r0,r0,#0xc
        0x0800427e:    e000        ..      B        0x8004282 ; ecp_normalize_jac_many + 358
        0x08004280:    e026        &.      B        0x80042d0 ; ecp_normalize_jac_many + 436
        0x08004282:    4601        .F      MOV      r1,r0
        0x08004284:    aa09        ..      ADD      r2,sp,#0x24
        0x08004286:    f002fa23    ..#.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x0800428a:    0004        ..      MOVS     r4,r0
        0x0800428c:    d120         .      BNE      0x80042d0 ; ecp_normalize_jac_many + 436
        0x0800428e:    f8580025    X.%.    LDR      r0,[r8,r5,LSL #2]
        0x08004292:    4649        IF      MOV      r1,r9
        0x08004294:    300c        .0      ADDS     r0,r0,#0xc
        0x08004296:    f7fffd17    ....    BL       ecp_modp ; 0x8003cc8
        0x0800429a:    0004        ..      MOVS     r4,r0
        0x0800429c:    d118        ..      BNE      0x80042d0 ; ecp_normalize_jac_many + 436
        0x0800429e:    f8580025    X.%.    LDR      r0,[r8,r5,LSL #2]
        0x080042a2:    f8d91008    ....    LDR      r1,[r9,#8]
        0x080042a6:    f002fc9e    ....    BL       mbedtls_mpi_shrink ; 0x8006be6
        0x080042aa:    0004        ..      MOVS     r4,r0
        0x080042ac:    d110        ..      BNE      0x80042d0 ; ecp_normalize_jac_many + 436
        0x080042ae:    f8580025    X.%.    LDR      r0,[r8,r5,LSL #2]
        0x080042b2:    f8d91008    ....    LDR      r1,[r9,#8]
        0x080042b6:    300c        .0      ADDS     r0,r0,#0xc
        0x080042b8:    f002fc95    ....    BL       mbedtls_mpi_shrink ; 0x8006be6
        0x080042bc:    0004        ..      MOVS     r4,r0
        0x080042be:    d107        ..      BNE      0x80042d0 ; ecp_normalize_jac_many + 436
        0x080042c0:    f8580025    X.%.    LDR      r0,[r8,r5,LSL #2]
        0x080042c4:    3018        .0      ADDS     r0,r0,#0x18
        0x080042c6:    f001ff8e    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080042ca:    b10d        ..      CBZ      r5,0x80042d0 ; ecp_normalize_jac_many + 436
        0x080042cc:    1e6d        m.      SUBS     r5,r5,#1
        0x080042ce:    e77f        ..      B        0x80041d0 ; ecp_normalize_jac_many + 180
        0x080042d0:    a802        ..      ADD      r0,sp,#8
        0x080042d2:    f001ff88    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080042d6:    a809        ..      ADD      r0,sp,#0x24
        0x080042d8:    f001ff85    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080042dc:    a805        ..      ADD      r0,sp,#0x14
        0x080042de:    f001ff82    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080042e2:    2500        .%      MOVS     r5,#0
        0x080042e4:    e007        ..      B        0x80042f6 ; ecp_normalize_jac_many + 474
        0x080042e6:    bf00        ..      NOP      
        0x080042e8:    eb050045    ..E.    ADD      r0,r5,r5,LSL #1
        0x080042ec:    eb070080    ....    ADD      r0,r7,r0,LSL #2
        0x080042f0:    f001ff79    ..y.    BL       mbedtls_mpi_free ; 0x80061e6
        0x080042f4:    1c6d        m.      ADDS     r5,r5,#1
        0x080042f6:    42b5        .B      CMP      r5,r6
        0x080042f8:    d3f6        ..      BCC      0x80042e8 ; ecp_normalize_jac_many + 460
        0x080042fa:    4638        8F      MOV      r0,r7
        0x080042fc:    f7fbffcd    ....    BL       free ; 0x800029a
        0x08004300:    4620         F      MOV      r0,r4
        0x08004302:    e718        ..      B        0x8004136 ; ecp_normalize_jac_many + 26
    $d
        0x08004304:    ffffb280    ....    DCD    4294947456
    $t
    i.ecp_precompute_comb
    ecp_precompute_comb
        0x08004308:    e92d4ff0    -..O    PUSH     {r4-r11,lr}
        0x0800430c:    4683        .F      MOV      r11,r0
        0x0800430e:    f1a30801    ....    SUB      r8,r3,#1
        0x08004312:    f04f0901    O...    MOV      r9,#1
        0x08004316:    b09f        ..      SUB      sp,sp,#0x7c
        0x08004318:    460c        .F      MOV      r4,r1
        0x0800431a:    fa09f008    ....    LSL      r0,r9,r8
        0x0800431e:    b2c7        ..      UXTB     r7,r0
        0x08004320:    2500        .%      MOVS     r5,#0
        0x08004322:    4611        .F      MOV      r1,r2
        0x08004324:    4620         F      MOV      r0,r4
        0x08004326:    9e28        (.      LDR      r6,[sp,#0xa0]
        0x08004328:    f000fc8e    ....    BL       mbedtls_ecp_copy ; 0x8004c48
        0x0800432c:    2800        .(      CMP      r0,#0
        0x0800432e:    d16c        l.      BNE      0x800440a ; ecp_precompute_comb + 258
        0x08004330:    fb08f806    ....    MUL      r8,r8,r6
        0x08004334:    e020         .      B        0x8004378 ; ecp_precompute_comb + 112
        0x08004336:    bf00        ..      NOP      
        0x08004338:    fbb5f1f6    ....    UDIV     r1,r5,r6
        0x0800433c:    fa09f001    ....    LSL      r0,r9,r1
        0x08004340:    b2c0        ..      UXTB     r0,r0
        0x08004342:    eb0001c0    ....    ADD      r1,r0,r0,LSL #3
        0x08004346:    eb040a81    ....    ADD      r10,r4,r1,LSL #2
        0x0800434a:    fbb5f1f6    ....    UDIV     r1,r5,r6
        0x0800434e:    fb065111    ...Q    MLS      r1,r6,r1,r5
        0x08004352:    b949        I.      CBNZ     r1,0x8004368 ; ecp_precompute_comb + 96
        0x08004354:    0840        @.      LSRS     r0,r0,#1
        0x08004356:    eb0000c0    ....    ADD      r0,r0,r0,LSL #3
        0x0800435a:    eb040180    ....    ADD      r1,r4,r0,LSL #2
        0x0800435e:    4650        PF      MOV      r0,r10
        0x08004360:    f000fc72    ..r.    BL       mbedtls_ecp_copy ; 0x8004c48
        0x08004364:    2800        .(      CMP      r0,#0
        0x08004366:    d150        P.      BNE      0x800440a ; ecp_precompute_comb + 258
        0x08004368:    4652        RF      MOV      r2,r10
        0x0800436a:    4611        .F      MOV      r1,r2
        0x0800436c:    4658        XF      MOV      r0,r11
        0x0800436e:    f7fefab1    ....    BL       ecp_double_jac ; 0x80028d4
        0x08004372:    2800        .(      CMP      r0,#0
        0x08004374:    d149        I.      BNE      0x800440a ; ecp_precompute_comb + 258
        0x08004376:    1c6d        m.      ADDS     r5,r5,#1
        0x08004378:    45a8        .E      CMP      r8,r5
        0x0800437a:    d8dd        ..      BHI      0x8004338 ; ecp_precompute_comb + 48
        0x0800437c:    2200        ."      MOVS     r2,#0
        0x0800437e:    4669        iF      MOV      r1,sp
        0x08004380:    2001        .       MOVS     r0,#1
        0x08004382:    4689        .F      MOV      r9,r1
        0x08004384:    e00a        ..      B        0x800439c ; ecp_precompute_comb + 148
        0x08004386:    bf00        ..      NOP      
        0x08004388:    eb0001c0    ....    ADD      r1,r0,r0,LSL #3
        0x0800438c:    eb040381    ....    ADD      r3,r4,r1,LSL #2
        0x08004390:    0640        @.      LSLS     r0,r0,#25
        0x08004392:    f8493022    I."0    STR      r3,[r9,r2,LSL #2]
        0x08004396:    0e00        ..      LSRS     r0,r0,#24
        0x08004398:    4649        IF      MOV      r1,r9
        0x0800439a:    1c52        R.      ADDS     r2,r2,#1
        0x0800439c:    42b8        .B      CMP      r0,r7
        0x0800439e:    d3f3        ..      BCC      0x8004388 ; ecp_precompute_comb + 128
        0x080043a0:    4658        XF      MOV      r0,r11
        0x080043a2:    f7fffebb    ....    BL       ecp_normalize_jac_many ; 0x800411c
        0x080043a6:    2800        .(      CMP      r0,#0
        0x080043a8:    d12f        /.      BNE      0x800440a ; ecp_precompute_comb + 258
        0x080043aa:    2601        .&      MOVS     r6,#1
        0x080043ac:    e018        ..      B        0x80043e0 ; ecp_precompute_comb + 216
        0x080043ae:    eb0600c6    ....    ADD      r0,r6,r6,LSL #3
        0x080043b2:    4635        5F      MOV      r5,r6
        0x080043b4:    eb040880    ....    ADD      r8,r4,r0,LSL #2
        0x080043b8:    e00e        ..      B        0x80043d8 ; ecp_precompute_comb + 208
        0x080043ba:    eb0500c5    ....    ADD      r0,r5,r5,LSL #3
        0x080043be:    eb040280    ....    ADD      r2,r4,r0,LSL #2
        0x080043c2:    1970        p.      ADDS     r0,r6,r5
        0x080043c4:    eb0000c0    ....    ADD      r0,r0,r0,LSL #3
        0x080043c8:    eb040180    ....    ADD      r1,r4,r0,LSL #2
        0x080043cc:    4643        CF      MOV      r3,r8
        0x080043ce:    4658        XF      MOV      r0,r11
        0x080043d0:    f7fdfe7c    ..|.    BL       ecp_add_mixed ; 0x80020cc
        0x080043d4:    2800        .(      CMP      r0,#0
        0x080043d6:    d118        ..      BNE      0x800440a ; ecp_precompute_comb + 258
        0x080043d8:    1e6d        m.      SUBS     r5,r5,#1
        0x080043da:    d2ee        ..      BCS      0x80043ba ; ecp_precompute_comb + 178
        0x080043dc:    0670        p.      LSLS     r0,r6,#25
        0x080043de:    0e06        ..      LSRS     r6,r0,#24
        0x080043e0:    42be        .B      CMP      r6,r7
        0x080043e2:    d3e4        ..      BCC      0x80043ae ; ecp_precompute_comb + 166
        0x080043e4:    2200        ."      MOVS     r2,#0
        0x080043e6:    4648        HF      MOV      r0,r9
        0x080043e8:    e008        ..      B        0x80043fc ; ecp_precompute_comb + 244
        0x080043ea:    bf00        ..      NOP      
        0x080043ec:    eb0201c2    ....    ADD      r1,r2,r2,LSL #3
        0x080043f0:    eb040181    ....    ADD      r1,r4,r1,LSL #2
        0x080043f4:    3124        $1      ADDS     r1,r1,#0x24
        0x080043f6:    f8401022    @.".    STR      r1,[r0,r2,LSL #2]
        0x080043fa:    1c52        R.      ADDS     r2,r2,#1
        0x080043fc:    1c51        Q.      ADDS     r1,r2,#1
        0x080043fe:    42b9        .B      CMP      r1,r7
        0x08004400:    d3f4        ..      BCC      0x80043ec ; ecp_precompute_comb + 228
        0x08004402:    4669        iF      MOV      r1,sp
        0x08004404:    4658        XF      MOV      r0,r11
        0x08004406:    f7fffe89    ....    BL       ecp_normalize_jac_many ; 0x800411c
        0x0800440a:    b01f        ..      ADD      sp,sp,#0x7c
        0x0800440c:    e8bd8ff0    ....    POP      {r4-r11,pc}
    i.ecp_randomize_jac
    ecp_randomize_jac
        0x08004410:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x08004414:    4605        .F      MOV      r5,r0
        0x08004416:    6d80        .m      LDR      r0,[r0,#0x58]
        0x08004418:    b086        ..      SUB      sp,sp,#0x18
        0x0800441a:    1dc0        ..      ADDS     r0,r0,#7
        0x0800441c:    ea4f08d0    O...    LSR      r8,r0,#3
        0x08004420:    4699        .F      MOV      r9,r3
        0x08004422:    4692        .F      MOV      r10,r2
        0x08004424:    460f        .F      MOV      r7,r1
        0x08004426:    2600        .&      MOVS     r6,#0
        0x08004428:    4668        hF      MOV      r0,sp
        0x0800442a:    f001ffa5    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x0800442e:    a803        ..      ADD      r0,sp,#0xc
        0x08004430:    f001ffa2    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08004434:    464b        KF      MOV      r3,r9
        0x08004436:    4652        RF      MOV      r2,r10
        0x08004438:    4641        AF      MOV      r1,r8
        0x0800443a:    4668        hF      MOV      r0,sp
        0x0800443c:    f001fea3    ....    BL       mbedtls_mpi_fill_random ; 0x8006186
        0x08004440:    e003        ..      B        0x800444a ; ecp_randomize_jac + 58
        0x08004442:    2101        .!      MOVS     r1,#1
        0x08004444:    4668        hF      MOV      r0,sp
        0x08004446:    f002fb8d    ....    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x0800444a:    0004        ..      MOVS     r4,r0
        0x0800444c:    d157        W.      BNE      0x80044fe ; ecp_randomize_jac + 238
        0x0800444e:    1d29        ).      ADDS     r1,r5,#4
        0x08004450:    4668        hF      MOV      r0,sp
        0x08004452:    f001fc91    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08004456:    2800        .(      CMP      r0,#0
        0x08004458:    daf3        ..      BGE      0x8004442 ; ecp_randomize_jac + 50
        0x0800445a:    4630        0F      MOV      r0,r6
        0x0800445c:    1c76        v.      ADDS     r6,r6,#1
        0x0800445e:    280a        .(      CMP      r0,#0xa
        0x08004460:    dd03        ..      BLE      0x800446a ; ecp_randomize_jac + 90
        0x08004462:    482b        +H      LDR      r0,[pc,#172] ; [0x8004510] = 0xffffb300
        0x08004464:    b006        ..      ADD      sp,sp,#0x18
        0x08004466:    e8bd87f0    ....    POP      {r4-r10,pc}
        0x0800446a:    2101        .!      MOVS     r1,#1
        0x0800446c:    4668        hF      MOV      r0,sp
        0x0800446e:    f001fc6b    ..k.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08004472:    2800        .(      CMP      r0,#0
        0x08004474:    ddde        ..      BLE      0x8004434 ; ecp_randomize_jac + 36
        0x08004476:    f1070118    ....    ADD      r1,r7,#0x18
        0x0800447a:    466a        jF      MOV      r2,sp
        0x0800447c:    460e        .F      MOV      r6,r1
        0x0800447e:    4608        .F      MOV      r0,r1
        0x08004480:    f002f926    ..&.    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08004484:    0004        ..      MOVS     r4,r0
        0x08004486:    d13a        :.      BNE      0x80044fe ; ecp_randomize_jac + 238
        0x08004488:    4629        )F      MOV      r1,r5
        0x0800448a:    4630        0F      MOV      r0,r6
        0x0800448c:    f7fffc1c    ....    BL       ecp_modp ; 0x8003cc8
        0x08004490:    0004        ..      MOVS     r4,r0
        0x08004492:    d134        4.      BNE      0x80044fe ; ecp_randomize_jac + 238
        0x08004494:    466a        jF      MOV      r2,sp
        0x08004496:    4611        .F      MOV      r1,r2
        0x08004498:    a803        ..      ADD      r0,sp,#0xc
        0x0800449a:    f002f919    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x0800449e:    0004        ..      MOVS     r4,r0
        0x080044a0:    d12d        -.      BNE      0x80044fe ; ecp_randomize_jac + 238
        0x080044a2:    4629        )F      MOV      r1,r5
        0x080044a4:    a803        ..      ADD      r0,sp,#0xc
        0x080044a6:    f7fffc0f    ....    BL       ecp_modp ; 0x8003cc8
        0x080044aa:    0004        ..      MOVS     r4,r0
        0x080044ac:    d127        '.      BNE      0x80044fe ; ecp_randomize_jac + 238
        0x080044ae:    4639        9F      MOV      r1,r7
        0x080044b0:    aa03        ..      ADD      r2,sp,#0xc
        0x080044b2:    4608        .F      MOV      r0,r1
        0x080044b4:    f002f90c    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x080044b8:    0004        ..      MOVS     r4,r0
        0x080044ba:    d120         .      BNE      0x80044fe ; ecp_randomize_jac + 238
        0x080044bc:    4629        )F      MOV      r1,r5
        0x080044be:    4638        8F      MOV      r0,r7
        0x080044c0:    f7fffc02    ....    BL       ecp_modp ; 0x8003cc8
        0x080044c4:    0004        ..      MOVS     r4,r0
        0x080044c6:    d11a        ..      BNE      0x80044fe ; ecp_randomize_jac + 238
        0x080044c8:    a903        ..      ADD      r1,sp,#0xc
        0x080044ca:    466a        jF      MOV      r2,sp
        0x080044cc:    4608        .F      MOV      r0,r1
        0x080044ce:    f002f8ff    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x080044d2:    0004        ..      MOVS     r4,r0
        0x080044d4:    d113        ..      BNE      0x80044fe ; ecp_randomize_jac + 238
        0x080044d6:    4629        )F      MOV      r1,r5
        0x080044d8:    a803        ..      ADD      r0,sp,#0xc
        0x080044da:    f7fffbf5    ....    BL       ecp_modp ; 0x8003cc8
        0x080044de:    0004        ..      MOVS     r4,r0
        0x080044e0:    d10d        ..      BNE      0x80044fe ; ecp_randomize_jac + 238
        0x080044e2:    f107010c    ....    ADD      r1,r7,#0xc
        0x080044e6:    aa03        ..      ADD      r2,sp,#0xc
        0x080044e8:    460e        .F      MOV      r6,r1
        0x080044ea:    4608        .F      MOV      r0,r1
        0x080044ec:    f002f8f0    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x080044f0:    0004        ..      MOVS     r4,r0
        0x080044f2:    d104        ..      BNE      0x80044fe ; ecp_randomize_jac + 238
        0x080044f4:    4629        )F      MOV      r1,r5
        0x080044f6:    4630        0F      MOV      r0,r6
        0x080044f8:    f7fffbe6    ....    BL       ecp_modp ; 0x8003cc8
        0x080044fc:    4604        .F      MOV      r4,r0
        0x080044fe:    4668        hF      MOV      r0,sp
        0x08004500:    f001fe71    ..q.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08004504:    a803        ..      ADD      r0,sp,#0xc
        0x08004506:    f001fe6e    ..n.    BL       mbedtls_mpi_free ; 0x80061e6
        0x0800450a:    4620         F      MOV      r0,r4
        0x0800450c:    e7aa        ..      B        0x8004464 ; ecp_randomize_jac + 84
    $d
        0x0800450e:    0000        ..      DCW    0
        0x08004510:    ffffb300    ....    DCD    4294947584
    $t
    i.ecp_randomize_mxz
    ecp_randomize_mxz
        0x08004514:    e92d4ffe    -..O    PUSH     {r1-r11,lr}
        0x08004518:    4605        .F      MOV      r5,r0
        0x0800451a:    6d80        .m      LDR      r0,[r0,#0x58]
        0x0800451c:    4699        .F      MOV      r9,r3
        0x0800451e:    1dc0        ..      ADDS     r0,r0,#7
        0x08004520:    ea4f08d0    O...    LSR      r8,r0,#3
        0x08004524:    4692        .F      MOV      r10,r2
        0x08004526:    460f        .F      MOV      r7,r1
        0x08004528:    2600        .&      MOVS     r6,#0
        0x0800452a:    4668        hF      MOV      r0,sp
        0x0800452c:    f001ff24    ..$.    BL       mbedtls_mpi_init ; 0x8006378
        0x08004530:    464b        KF      MOV      r3,r9
        0x08004532:    4652        RF      MOV      r2,r10
        0x08004534:    4641        AF      MOV      r1,r8
        0x08004536:    4668        hF      MOV      r0,sp
        0x08004538:    f001fe25    ..%.    BL       mbedtls_mpi_fill_random ; 0x8006186
        0x0800453c:    e003        ..      B        0x8004546 ; ecp_randomize_mxz + 50
        0x0800453e:    2101        .!      MOVS     r1,#1
        0x08004540:    4668        hF      MOV      r0,sp
        0x08004542:    f002fb0f    ....    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x08004546:    0004        ..      MOVS     r4,r0
        0x08004548:    d12d        -.      BNE      0x80045a6 ; ecp_randomize_mxz + 146
        0x0800454a:    1d29        ).      ADDS     r1,r5,#4
        0x0800454c:    4668        hF      MOV      r0,sp
        0x0800454e:    f001fc13    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08004552:    2800        .(      CMP      r0,#0
        0x08004554:    daf3        ..      BGE      0x800453e ; ecp_randomize_mxz + 42
        0x08004556:    4630        0F      MOV      r0,r6
        0x08004558:    1c76        v.      ADDS     r6,r6,#1
        0x0800455a:    280a        .(      CMP      r0,#0xa
        0x0800455c:    dd02        ..      BLE      0x8004564 ; ecp_randomize_mxz + 80
        0x0800455e:    4814        .H      LDR      r0,[pc,#80] ; [0x80045b0] = 0xffffb300
        0x08004560:    e8bd8ffe    ....    POP      {r1-r11,pc}
        0x08004564:    2101        .!      MOVS     r1,#1
        0x08004566:    4668        hF      MOV      r0,sp
        0x08004568:    f001fbee    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x0800456c:    2800        .(      CMP      r0,#0
        0x0800456e:    dddf        ..      BLE      0x8004530 ; ecp_randomize_mxz + 28
        0x08004570:    4639        9F      MOV      r1,r7
        0x08004572:    466a        jF      MOV      r2,sp
        0x08004574:    4608        .F      MOV      r0,r1
        0x08004576:    f002f8ab    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x0800457a:    0004        ..      MOVS     r4,r0
        0x0800457c:    d113        ..      BNE      0x80045a6 ; ecp_randomize_mxz + 146
        0x0800457e:    4629        )F      MOV      r1,r5
        0x08004580:    4638        8F      MOV      r0,r7
        0x08004582:    f7fffba1    ....    BL       ecp_modp ; 0x8003cc8
        0x08004586:    0004        ..      MOVS     r4,r0
        0x08004588:    d10d        ..      BNE      0x80045a6 ; ecp_randomize_mxz + 146
        0x0800458a:    f1070118    ....    ADD      r1,r7,#0x18
        0x0800458e:    466a        jF      MOV      r2,sp
        0x08004590:    460e        .F      MOV      r6,r1
        0x08004592:    4608        .F      MOV      r0,r1
        0x08004594:    f002f89c    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x08004598:    0004        ..      MOVS     r4,r0
        0x0800459a:    d104        ..      BNE      0x80045a6 ; ecp_randomize_mxz + 146
        0x0800459c:    4629        )F      MOV      r1,r5
        0x0800459e:    4630        0F      MOV      r0,r6
        0x080045a0:    f7fffb92    ....    BL       ecp_modp ; 0x8003cc8
        0x080045a4:    4604        .F      MOV      r4,r0
        0x080045a6:    4668        hF      MOV      r0,sp
        0x080045a8:    f001fe1d    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080045ac:    4620         F      MOV      r0,r4
        0x080045ae:    e7d7        ..      B        0x8004560 ; ecp_randomize_mxz + 76
    $d
        0x080045b0:    ffffb300    ....    DCD    4294947584
    $t
    i.ecp_safe_invert_jac
    ecp_safe_invert_jac
        0x080045b4:    b5fe        ..      PUSH     {r1-r7,lr}
        0x080045b6:    4604        .F      MOV      r4,r0
        0x080045b8:    4616        .F      MOV      r6,r2
        0x080045ba:    460d        .F      MOV      r5,r1
        0x080045bc:    4668        hF      MOV      r0,sp
        0x080045be:    f001fedb    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x080045c2:    f105020c    ....    ADD      r2,r5,#0xc
        0x080045c6:    4615        .F      MOV      r5,r2
        0x080045c8:    1d21        !.      ADDS     r1,r4,#4
        0x080045ca:    4668        hF      MOV      r0,sp
        0x080045cc:    f002fb96    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x080045d0:    0004        ..      MOVS     r4,r0
