openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x080045d2:    d10c        ..      BNE      0x80045ee ; ecp_safe_invert_jac + 58
        0x080045d4:    2100        .!      MOVS     r1,#0
        0x080045d6:    4628        (F      MOV      r0,r5
        0x080045d8:    f001fbb6    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080045dc:    b100        ..      CBZ      r0,0x80045e0 ; ecp_safe_invert_jac + 44
        0x080045de:    2001        .       MOVS     r0,#1
        0x080045e0:    ea060200    ....    AND      r2,r6,r0
        0x080045e4:    4669        iF      MOV      r1,sp
        0x080045e6:    4628        (F      MOV      r0,r5
        0x080045e8:    f002f9c6    ....    BL       mbedtls_mpi_safe_cond_assign ; 0x8006978
        0x080045ec:    4604        .F      MOV      r4,r0
        0x080045ee:    4668        hF      MOV      r0,sp
        0x080045f0:    f001fdf9    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080045f4:    4620         F      MOV      r0,r4
        0x080045f6:    bdfe        ..      POP      {r1-r7,pc}
    i.ecp_select_comb
    ecp_select_comb
        0x080045f8:    e92d5ff0    -.._    PUSH     {r4-r12,lr}
        0x080045fc:    461f        .F      MOV      r7,r3
        0x080045fe:    9e0a        ..      LDR      r6,[sp,#0x28]
        0x08004600:    4691        .F      MOV      r9,r2
        0x08004602:    468a        .F      MOV      r10,r1
        0x08004604:    4683        .F      MOV      r11,r0
        0x08004606:    f3c60545    ..E.    UBFX     r5,r6,#1,#6
        0x0800460a:    2400        .$      MOVS     r4,#0
        0x0800460c:    e01d        ..      B        0x800464a ; ecp_select_comb + 82
        0x0800460e:    42ac        .B      CMP      r4,r5
        0x08004610:    d101        ..      BNE      0x8004616 ; ecp_select_comb + 30
        0x08004612:    2201        ."      MOVS     r2,#1
        0x08004614:    e000        ..      B        0x8004618 ; ecp_select_comb + 32
        0x08004616:    2200        ."      MOVS     r2,#0
        0x08004618:    eb0401c4    ....    ADD      r1,r4,r4,LSL #3
        0x0800461c:    eb090181    ....    ADD      r1,r9,r1,LSL #2
        0x08004620:    4688        .F      MOV      r8,r1
        0x08004622:    4650        PF      MOV      r0,r10
        0x08004624:    f002f9a8    ....    BL       mbedtls_mpi_safe_cond_assign ; 0x8006978
        0x08004628:    2800        .(      CMP      r0,#0
        0x0800462a:    d117        ..      BNE      0x800465c ; ecp_select_comb + 100
        0x0800462c:    42ac        .B      CMP      r4,r5
        0x0800462e:    d101        ..      BNE      0x8004634 ; ecp_select_comb + 60
        0x08004630:    2201        ."      MOVS     r2,#1
        0x08004632:    e000        ..      B        0x8004636 ; ecp_select_comb + 62
        0x08004634:    2200        ."      MOVS     r2,#0
        0x08004636:    f108010c    ....    ADD      r1,r8,#0xc
        0x0800463a:    f10a000c    ....    ADD      r0,r10,#0xc
        0x0800463e:    f002f99b    ....    BL       mbedtls_mpi_safe_cond_assign ; 0x8006978
        0x08004642:    2800        .(      CMP      r0,#0
        0x08004644:    d10a        ..      BNE      0x800465c ; ecp_select_comb + 100
        0x08004646:    1c64        d.      ADDS     r4,r4,#1
        0x08004648:    b2e4        ..      UXTB     r4,r4
        0x0800464a:    42bc        .B      CMP      r4,r7
        0x0800464c:    d3df        ..      BCC      0x800460e ; ecp_select_comb + 22
        0x0800464e:    09f2        ..      LSRS     r2,r6,#7
        0x08004650:    4651        QF      MOV      r1,r10
        0x08004652:    4658        XF      MOV      r0,r11
        0x08004654:    e8bd5ff0    ..._    POP      {r4-r12,lr}
        0x08004658:    f7ffbfac    ....    B.W      ecp_safe_invert_jac ; 0x80045b4
        0x0800465c:    e8bd9ff0    ....    POP      {r4-r12,pc}
    i.ecp_use_curve25519
    ecp_use_curve25519
        0x08004660:    b570        p.      PUSH     {r4-r6,lr}
        0x08004662:    4604        .F      MOV      r4,r0
        0x08004664:    a223        #.      ADR      r2,{pc}+0x90 ; 0x80046f4
        0x08004666:    2110        .!      MOVS     r1,#0x10
        0x08004668:    3010        .0      ADDS     r0,r0,#0x10
        0x0800466a:    f002f8f9    ....    BL       mbedtls_mpi_read_string ; 0x8006860
        0x0800466e:    0005        ..      MOVS     r5,r0
        0x08004670:    d134        4.      BNE      0x80046dc ; ecp_use_curve25519 + 124
        0x08004672:    2101        .!      MOVS     r1,#1
        0x08004674:    1d20         .      ADDS     r0,r4,#4
        0x08004676:    f001ffd1    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x0800467a:    0005        ..      MOVS     r5,r0
        0x0800467c:    d12e        ..      BNE      0x80046dc ; ecp_use_curve25519 + 124
        0x0800467e:    21ff        .!      MOVS     r1,#0xff
        0x08004680:    1d20         .      ADDS     r0,r4,#4
        0x08004682:    f002fa1f    ....    BL       mbedtls_mpi_shift_l ; 0x8006ac4
        0x08004686:    0005        ..      MOVS     r5,r0
        0x08004688:    d128        (.      BNE      0x80046dc ; ecp_use_curve25519 + 124
        0x0800468a:    2213        ."      MOVS     r2,#0x13
        0x0800468c:    1d21        !.      ADDS     r1,r4,#4
        0x0800468e:    1d20         .      ADDS     r0,r4,#4
        0x08004690:    f002fb1c    ....    BL       mbedtls_mpi_sub_int ; 0x8006ccc
        0x08004694:    0005        ..      MOVS     r5,r0
        0x08004696:    d121        !.      BNE      0x80046dc ; ecp_use_curve25519 + 124
        0x08004698:    1d20         .      ADDS     r0,r4,#4
        0x0800469a:    f001fb04    ....    BL       mbedtls_mpi_bitlen ; 0x8005ca6
        0x0800469e:    65a0        .e      STR      r0,[r4,#0x58]
        0x080046a0:    f104004c    ..L.    ADD      r0,r4,#0x4c
        0x080046a4:    a215        ..      ADR      r2,{pc}+0x58 ; 0x80046fc
        0x080046a6:    2110        .!      MOVS     r1,#0x10
        0x080046a8:    4606        .F      MOV      r6,r0
        0x080046aa:    f002f8d9    ....    BL       mbedtls_mpi_read_string ; 0x8006860
        0x080046ae:    0005        ..      MOVS     r5,r0
        0x080046b0:    d114        ..      BNE      0x80046dc ; ecp_use_curve25519 + 124
        0x080046b2:    2201        ."      MOVS     r2,#1
        0x080046b4:    21fc        .!      MOVS     r1,#0xfc
        0x080046b6:    4630        0F      MOV      r0,r6
        0x080046b8:    f002f9d9    ....    BL       mbedtls_mpi_set_bit ; 0x8006a6e
        0x080046bc:    0005        ..      MOVS     r5,r0
        0x080046be:    d10d        ..      BNE      0x80046dc ; ecp_use_curve25519 + 124
        0x080046c0:    2109        .!      MOVS     r1,#9
        0x080046c2:    f1040028    ..(.    ADD      r0,r4,#0x28
        0x080046c6:    f001ffa9    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x080046ca:    0005        ..      MOVS     r5,r0
        0x080046cc:    d106        ..      BNE      0x80046dc ; ecp_use_curve25519 + 124
        0x080046ce:    2101        .!      MOVS     r1,#1
        0x080046d0:    f1040040    ..@.    ADD      r0,r4,#0x40
        0x080046d4:    f001ffa2    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x080046d8:    0005        ..      MOVS     r5,r0
        0x080046da:    d004        ..      BEQ      0x80046e6 ; ecp_use_curve25519 + 134
        0x080046dc:    4620         F      MOV      r0,r4
        0x080046de:    f000fae3    ....    BL       mbedtls_ecp_group_free ; 0x8004ca8
        0x080046e2:    4628        (F      MOV      r0,r5
        0x080046e4:    bd70        p.      POP      {r4-r6,pc}
        0x080046e6:    f1040034    ..4.    ADD      r0,r4,#0x34
        0x080046ea:    f001fd7c    ..|.    BL       mbedtls_mpi_free ; 0x80061e6
        0x080046ee:    20fe        .       MOVS     r0,#0xfe
        0x080046f0:    65e0        .e      STR      r0,[r4,#0x5c]
        0x080046f2:    e7f6        ..      B        0x80046e2 ; ecp_use_curve25519 + 130
    $d
        0x080046f4:    42443130    01DB    DCD    1111765296
        0x080046f8:    00003234    42..    DCD    12852
        0x080046fc:    45443431    14DE    DCD    1162097713
        0x08004700:    45443946    F9DE    DCD    1162099014
        0x08004704:    37463241    A2F7    DCD    927347265
        0x08004708:    36444339    9CD6    DCD    910443321
        0x0800470c:    32313835    5812    DCD    842086453
        0x08004710:    41313336    631A    DCD    1093743414
        0x08004714:    35464335    5CF5    DCD    893797173
        0x08004718:    44453344    D3ED    DCD    1145385796
        0x0800471c:    00000000    ....    DCD    0
    $t
    i.ecp_use_curve448
    ecp_use_curve448
        0x08004720:    b5fe        ..      PUSH     {r1-r7,lr}
        0x08004722:    4604        .F      MOV      r4,r0
        0x08004724:    4668        hF      MOV      r0,sp
        0x08004726:    f001fe27    ..'.    BL       mbedtls_mpi_init ; 0x8006378
        0x0800472a:    a231        1.      ADR      r2,{pc}+0xc6 ; 0x80047f0
        0x0800472c:    2110        .!      MOVS     r1,#0x10
        0x0800472e:    f1040010    ....    ADD      r0,r4,#0x10
        0x08004732:    f002f895    ....    BL       mbedtls_mpi_read_string ; 0x8006860
        0x08004736:    0005        ..      MOVS     r5,r0
        0x08004738:    d150        P.      BNE      0x80047dc ; ecp_use_curve448 + 188
        0x0800473a:    2101        .!      MOVS     r1,#1
        0x0800473c:    1d20         .      ADDS     r0,r4,#4
        0x0800473e:    f001ff6d    ..m.    BL       mbedtls_mpi_lset ; 0x800661c
        0x08004742:    0005        ..      MOVS     r5,r0
        0x08004744:    d14a        J.      BNE      0x80047dc ; ecp_use_curve448 + 188
        0x08004746:    21e0        .!      MOVS     r1,#0xe0
        0x08004748:    1d20         .      ADDS     r0,r4,#4
        0x0800474a:    f002f9bb    ....    BL       mbedtls_mpi_shift_l ; 0x8006ac4
        0x0800474e:    0005        ..      MOVS     r5,r0
        0x08004750:    d144        D.      BNE      0x80047dc ; ecp_use_curve448 + 188
        0x08004752:    2201        ."      MOVS     r2,#1
        0x08004754:    1d21        !.      ADDS     r1,r4,#4
        0x08004756:    1d20         .      ADDS     r0,r4,#4
        0x08004758:    f002fab8    ....    BL       mbedtls_mpi_sub_int ; 0x8006ccc
        0x0800475c:    0005        ..      MOVS     r5,r0
        0x0800475e:    d13d        =.      BNE      0x80047dc ; ecp_use_curve448 + 188
        0x08004760:    21e0        .!      MOVS     r1,#0xe0
        0x08004762:    1d20         .      ADDS     r0,r4,#4
        0x08004764:    f002f9ae    ....    BL       mbedtls_mpi_shift_l ; 0x8006ac4
        0x08004768:    0005        ..      MOVS     r5,r0
        0x0800476a:    d137        7.      BNE      0x80047dc ; ecp_use_curve448 + 188
        0x0800476c:    2201        ."      MOVS     r2,#1
        0x0800476e:    1d21        !.      ADDS     r1,r4,#4
        0x08004770:    1d20         .      ADDS     r0,r4,#4
        0x08004772:    f002faab    ....    BL       mbedtls_mpi_sub_int ; 0x8006ccc
        0x08004776:    0005        ..      MOVS     r5,r0
        0x08004778:    d130        0.      BNE      0x80047dc ; ecp_use_curve448 + 188
        0x0800477a:    1d20         .      ADDS     r0,r4,#4
        0x0800477c:    f001fa93    ....    BL       mbedtls_mpi_bitlen ; 0x8005ca6
        0x08004780:    65a0        .e      STR      r0,[r4,#0x58]
        0x08004782:    2105        .!      MOVS     r1,#5
        0x08004784:    f1040028    ..(.    ADD      r0,r4,#0x28
        0x08004788:    f001ff48    ..H.    BL       mbedtls_mpi_lset ; 0x800661c
        0x0800478c:    0005        ..      MOVS     r5,r0
        0x0800478e:    d125        %.      BNE      0x80047dc ; ecp_use_curve448 + 188
        0x08004790:    2101        .!      MOVS     r1,#1
        0x08004792:    f1040040    ..@.    ADD      r0,r4,#0x40
        0x08004796:    f001ff41    ..A.    BL       mbedtls_mpi_lset ; 0x800661c
        0x0800479a:    0005        ..      MOVS     r5,r0
        0x0800479c:    d11e        ..      BNE      0x80047dc ; ecp_use_curve448 + 188
        0x0800479e:    f1040034    ..4.    ADD      r0,r4,#0x34
        0x080047a2:    f001fd20    .. .    BL       mbedtls_mpi_free ; 0x80061e6
        0x080047a6:    f104004c    ..L.    ADD      r0,r4,#0x4c
        0x080047aa:    2201        ."      MOVS     r2,#1
        0x080047ac:    f44f71df    O..q    MOV      r1,#0x1be
        0x080047b0:    4606        .F      MOV      r6,r0
        0x080047b2:    f002f95c    ..\.    BL       mbedtls_mpi_set_bit ; 0x8006a6e
        0x080047b6:    0005        ..      MOVS     r5,r0
        0x080047b8:    d110        ..      BNE      0x80047dc ; ecp_use_curve448 + 188
        0x080047ba:    a20f        ..      ADR      r2,{pc}+0x3e ; 0x80047f8
        0x080047bc:    2110        .!      MOVS     r1,#0x10
        0x080047be:    4668        hF      MOV      r0,sp
        0x080047c0:    f002f84e    ..N.    BL       mbedtls_mpi_read_string ; 0x8006860
        0x080047c4:    0005        ..      MOVS     r5,r0
        0x080047c6:    d109        ..      BNE      0x80047dc ; ecp_use_curve448 + 188
        0x080047c8:    4631        1F      MOV      r1,r6
        0x080047ca:    466a        jF      MOV      r2,sp
        0x080047cc:    4608        .F      MOV      r0,r1
        0x080047ce:    f002fa95    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x080047d2:    0005        ..      MOVS     r5,r0
        0x080047d4:    d102        ..      BNE      0x80047dc ; ecp_use_curve448 + 188
        0x080047d6:    f24010bf    @...    MOV      r0,#0x1bf
        0x080047da:    65e0        .e      STR      r0,[r4,#0x5c]
        0x080047dc:    4668        hF      MOV      r0,sp
        0x080047de:    f001fd02    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080047e2:    b115        ..      CBZ      r5,0x80047ea ; ecp_use_curve448 + 202
        0x080047e4:    4620         F      MOV      r0,r4
        0x080047e6:    f000fa5f    .._.    BL       mbedtls_ecp_group_free ; 0x8004ca8
        0x080047ea:    4628        (F      MOV      r0,r5
        0x080047ec:    bdfe        ..      POP      {r1-r7,pc}
    $d
        0x080047ee:    0000        ..      DCW    0
        0x080047f0:    41413839    98AA    DCD    1094793273
        0x080047f4:    00000000    ....    DCD    0
        0x080047f8:    35333338    8335    DCD    892547896
        0x080047fc:    36314344    DC16    DCD    909198148
        0x08004800:    31424233    3BB1    DCD    826425907
        0x08004804:    36423432    24B6    DCD    910308402
        0x08004808:    39323135    5129    DCD    959590709
        0x0800480c:    46363943    C96F    DCD    1177958723
        0x08004810:    33394544    DE93    DCD    859391300
        0x08004814:    44384433    3D8D    DCD    1144538163
        0x08004818:    41333237    723A    DCD    1093874231
        0x0800481c:    41413037    70AA    DCD    1094791223
        0x08004820:    37384344    DC87    DCD    926434116
        0x08004824:    44364433    3D6D    DCD    1144407091
        0x08004828:    37413435    54A7    DCD    927020085
        0x0800482c:    44304242    BB0D    DCD    1144013378
        0x08004830:    00000000    ....    DCD    0
    $t
    i.encrypt_g
    encrypt_g
        0x08004834:    b5f7        ..      PUSH     {r0-r2,r4-r7,lr}
        0x08004836:    0688        ..      LSLS     r0,r1,#26
        0x08004838:    0e04        ..      LSRS     r4,r0,#24
        0x0800483a:    f89d5000    ...P    LDRB     r5,[sp,#0]
        0x0800483e:    4617        .F      MOV      r7,r2
        0x08004840:    4621        !F      MOV      r1,r4
        0x08004842:    4628        (F      MOV      r0,r5
        0x08004844:    f000f84c    ..L.    BL       encrypt_sub_g ; 0x80048e0
        0x08004848:    f89d1001    ....    LDRB     r1,[sp,#1]
        0x0800484c:    463a        :F      MOV      r2,r7
        0x0800484e:    4048        H@      EORS     r0,r0,r1
        0x08004850:    b2c6        ..      UXTB     r6,r0
        0x08004852:    1c60        `.      ADDS     r0,r4,#1
        0x08004854:    b2c1        ..      UXTB     r1,r0
        0x08004856:    4630        0F      MOV      r0,r6
        0x08004858:    f000f842    ..B.    BL       encrypt_sub_g ; 0x80048e0
        0x0800485c:    4068        h@      EORS     r0,r0,r5
        0x0800485e:    b2c5        ..      UXTB     r5,r0
        0x08004860:    1ca0        ..      ADDS     r0,r4,#2
        0x08004862:    b2c1        ..      UXTB     r1,r0
        0x08004864:    463a        :F      MOV      r2,r7
        0x08004866:    4628        (F      MOV      r0,r5
        0x08004868:    f000f83a    ..:.    BL       encrypt_sub_g ; 0x80048e0
        0x0800486c:    4070        p@      EORS     r0,r0,r6
        0x0800486e:    b2c0        ..      UXTB     r0,r0
        0x08004870:    1ce4        ..      ADDS     r4,r4,#3
        0x08004872:    f88d0001    ....    STRB     r0,[sp,#1]
        0x08004876:    b2e1        ..      UXTB     r1,r4
        0x08004878:    463a        :F      MOV      r2,r7
        0x0800487a:    f000f831    ..1.    BL       encrypt_sub_g ; 0x80048e0
        0x0800487e:    4068        h@      EORS     r0,r0,r5
        0x08004880:    f88d0000    ....    STRB     r0,[sp,#0]
        0x08004884:    f8bd0000    ....    LDRH     r0,[sp,#0]
        0x08004888:    bdfe        ..      POP      {r1-r7,pc}
    i.encrypt_g_inv
    encrypt_g_inv
        0x0800488a:    b5f7        ..      PUSH     {r0-r2,r4-r7,lr}
        0x0800488c:    0688        ..      LSLS     r0,r1,#26
        0x0800488e:    0e04        ..      LSRS     r4,r0,#24
        0x08004890:    1ce0        ..      ADDS     r0,r4,#3
        0x08004892:    f89d5001    ...P    LDRB     r5,[sp,#1]
        0x08004896:    b2c1        ..      UXTB     r1,r0
        0x08004898:    4617        .F      MOV      r7,r2
        0x0800489a:    4628        (F      MOV      r0,r5
        0x0800489c:    f000f820    .. .    BL       encrypt_sub_g ; 0x80048e0
        0x080048a0:    f89d1000    ....    LDRB     r1,[sp,#0]
        0x080048a4:    463a        :F      MOV      r2,r7
        0x080048a6:    4048        H@      EORS     r0,r0,r1
        0x080048a8:    b2c6        ..      UXTB     r6,r0
        0x080048aa:    1ca0        ..      ADDS     r0,r4,#2
        0x080048ac:    b2c1        ..      UXTB     r1,r0
        0x080048ae:    4630        0F      MOV      r0,r6
        0x080048b0:    f000f816    ....    BL       encrypt_sub_g ; 0x80048e0
        0x080048b4:    4068        h@      EORS     r0,r0,r5
        0x080048b6:    b2c5        ..      UXTB     r5,r0
        0x080048b8:    1c60        `.      ADDS     r0,r4,#1
        0x080048ba:    b2c1        ..      UXTB     r1,r0
        0x080048bc:    463a        :F      MOV      r2,r7
        0x080048be:    4628        (F      MOV      r0,r5
        0x080048c0:    f000f80e    ....    BL       encrypt_sub_g ; 0x80048e0
        0x080048c4:    4070        p@      EORS     r0,r0,r6
        0x080048c6:    b2c0        ..      UXTB     r0,r0
        0x080048c8:    f88d0000    ....    STRB     r0,[sp,#0]
        0x080048cc:    463a        :F      MOV      r2,r7
        0x080048ce:    4621        !F      MOV      r1,r4
        0x080048d0:    f000f806    ....    BL       encrypt_sub_g ; 0x80048e0
        0x080048d4:    4068        h@      EORS     r0,r0,r5
        0x080048d6:    f88d0001    ....    STRB     r0,[sp,#1]
        0x080048da:    f8bd0000    ....    LDRH     r0,[sp,#0]
        0x080048de:    bdfe        ..      POP      {r1-r7,pc}
    i.encrypt_sub_g
    encrypt_sub_g
        0x080048e0:    f0010107    ....    AND      r1,r1,#7
        0x080048e4:    f1c10107    ....    RSB      r1,r1,#7
        0x080048e8:    5c51        Q\      LDRB     r1,[r2,r1]
        0x080048ea:    4041        A@      EORS     r1,r1,r0
        0x080048ec:    4801        .H      LDR      r0,[pc,#4] ; [0x80048f4] = 0x8008000
        0x080048ee:    5c40        @\      LDRB     r0,[r0,r1]
        0x080048f0:    4770        pG      BX       lr
    $d
        0x080048f2:    0000        ..      DCW    0
        0x080048f4:    08008000    ....    DCD    134250496
    $t
    i.fix_negative
    fix_negative
        0x080048f8:    b570        p.      PUSH     {r4-r6,lr}
        0x080048fa:    4613        .F      MOV      r3,r2
        0x080048fc:    4604        .F      MOV      r4,r0
        0x080048fe:    4248        HB      RSBS     r0,r1,#0
        0x08004900:    e9d32101    ...!    LDRD     r2,r1,[r3,#4]
        0x08004904:    f06f0503    o...    MVN      r5,#3
        0x08004908:    eb050282    ....    ADD      r2,r5,r2,LSL #2
        0x0800490c:    5088        .P      STR      r0,[r1,r2]
        0x0800490e:    4622        "F      MOV      r2,r4
        0x08004910:    4619        .F      MOV      r1,r3
        0x08004912:    4610        .F      MOV      r0,r2
        0x08004914:    f002f9a3    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08004918:    2800        .(      CMP      r0,#0
        0x0800491a:    d101        ..      BNE      0x8004920 ; fix_negative + 40
        0x0800491c:    1e41        A.      SUBS     r1,r0,#1
        0x0800491e:    6021        !`      STR      r1,[r4,#0]
        0x08004920:    bd70        p.      POP      {r4-r6,pc}
        0x08004922:    0000        ..      MOVS     r0,r0
    i.main
    main
        0x08004924:    b086        ..      SUB      sp,sp,#0x18
        0x08004926:    f7fcfafb    ....    BL       HAL_Init ; 0x8000f20
        0x0800492a:    f7fcfe83    ....    BL       SystemClock_Config ; 0x8001634
        0x0800492e:    2400        .$      MOVS     r4,#0
        0x08004930:    4821        !H      LDR      r0,[pc,#132] ; [0x80049b8] = 0x40021000
        0x08004932:    9400        ..      STR      r4,[sp,#0]
        0x08004934:    9401        ..      STR      r4,[sp,#4]
        0x08004936:    9402        ..      STR      r4,[sp,#8]
        0x08004938:    9403        ..      STR      r4,[sp,#0xc]
        0x0800493a:    6981        .i      LDR      r1,[r0,#0x18]
        0x0800493c:    f0410110    A...    ORR      r1,r1,#0x10
        0x08004940:    6181        .a      STR      r1,[r0,#0x18]
        0x08004942:    6981        .i      LDR      r1,[r0,#0x18]
        0x08004944:    f0010110    ....    AND      r1,r1,#0x10
        0x08004948:    9104        ..      STR      r1,[sp,#0x10]
        0x0800494a:    6981        .i      LDR      r1,[r0,#0x18]
        0x0800494c:    f0410104    A...    ORR      r1,r1,#4
        0x08004950:    6181        .a      STR      r1,[r0,#0x18]
        0x08004952:    6980        .i      LDR      r0,[r0,#0x18]
        0x08004954:    2201        ."      MOVS     r2,#1
        0x08004956:    f0000004    ....    AND      r0,r0,#4
        0x0800495a:    4e18        .N      LDR      r6,[pc,#96] ; [0x80049bc] = 0x40011000
        0x0800495c:    0355        U.      LSLS     r5,r2,#13
        0x0800495e:    9004        ..      STR      r0,[sp,#0x10]
        0x08004960:    4629        )F      MOV      r1,r5
        0x08004962:    4630        0F      MOV      r0,r6
        0x08004964:    f7fcfac8    ....    BL       HAL_GPIO_WritePin ; 0x8000ef8
        0x08004968:    2001        .       MOVS     r0,#1
        0x0800496a:    9500        ..      STR      r5,[sp,#0]
        0x0800496c:    e9cd0401    ....    STRD     r0,r4,[sp,#4]
        0x08004970:    2002        .       MOVS     r0,#2
        0x08004972:    9003        ..      STR      r0,[sp,#0xc]
        0x08004974:    4669        iF      MOV      r1,sp
