openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08004976:    4630        0F      MOV      r0,r6
        0x08004978:    f7fcf9c2    ....    BL       HAL_GPIO_Init ; 0x8000d00
        0x0800497c:    4911        .I      LDR      r1,[pc,#68] ; [0x80049c4] = 0x20000004
        0x0800497e:    4810        .H      LDR      r0,[pc,#64] ; [0x80049c0] = 0x40023000
        0x08004980:    6008        .`      STR      r0,[r1,#0]
        0x08004982:    4608        .F      MOV      r0,r1
        0x08004984:    f7fcf8ae    ....    BL       HAL_CRC_Init ; 0x8000ae4
        0x08004988:    b108        ..      CBZ      r0,0x800498e ; main + 106
        0x0800498a:    b672        r.      CPSID    i
        0x0800498c:    e7fe        ..      B        0x800498c ; main + 104
        0x0800498e:    480f        .H      LDR      r0,[pc,#60] ; [0x80049cc] = 0x20000070
        0x08004990:    490d        .I      LDR      r1,[pc,#52] ; [0x80049c8] = 0x40013800
        0x08004992:    6001        .`      STR      r1,[r0,#0]
        0x08004994:    f44f31e1    O..1    MOV      r1,#0x1c200
        0x08004998:    e9c01401    ....    STRD     r1,r4,[r0,#4]
        0x0800499c:    210c        .!      MOVS     r1,#0xc
        0x0800499e:    60c4        .`      STR      r4,[r0,#0xc]
        0x080049a0:    e9c04104    ...A    STRD     r4,r1,[r0,#0x10]
        0x080049a4:    6184        .a      STR      r4,[r0,#0x18]
        0x080049a6:    61c4        .a      STR      r4,[r0,#0x1c]
        0x080049a8:    f7fcfdda    ....    BL       HAL_UART_Init ; 0x8001560
        0x080049ac:    b108        ..      CBZ      r0,0x80049b2 ; main + 142
        0x080049ae:    b672        r.      CPSID    i
        0x080049b0:    e7fe        ..      B        0x80049b0 ; main + 140
        0x080049b2:    f7fdf979    ..y.    BL       advance_software_protect_samples ; 0x8001ca8
        0x080049b6:    e7fc        ..      B        0x80049b2 ; main + 142
    $d
        0x080049b8:    40021000    ...@    DCD    1073876992
        0x080049bc:    40011000    ...@    DCD    1073811456
        0x080049c0:    40023000    .0.@    DCD    1073885184
        0x080049c4:    20000004    ...     DCD    536870916
        0x080049c8:    40013800    .8.@    DCD    1073821696
        0x080049cc:    20000070    p..     DCD    536871024
    $t
    i.mbedtls_asn1_get_len
    mbedtls_asn1_get_len
        0x080049d0:    b5f0        ..      PUSH     {r4-r7,lr}
        0x080049d2:    6803        .h      LDR      r3,[r0,#0]
        0x080049d4:    f06f065f    o._.    MVN      r6,#0x5f
        0x080049d8:    1acc        ..      SUBS     r4,r1,r3
        0x080049da:    2c01        .,      CMP      r4,#1
        0x080049dc:    db43        C.      BLT      0x8004a66 ; mbedtls_asn1_get_len + 150
        0x080049de:    781d        .x      LDRB     r5,[r3,#0]
        0x080049e0:    062f        /.      LSLS     r7,r5,#24
        0x080049e2:    d404        ..      BMI      0x80049ee ; mbedtls_asn1_get_len + 30
        0x080049e4:    1c5c        \.      ADDS     r4,r3,#1
        0x080049e6:    6004        .`      STR      r4,[r0,#0]
        0x080049e8:    781b        .x      LDRB     r3,[r3,#0]
        0x080049ea:    6013        .`      STR      r3,[r2,#0]
        0x080049ec:    e036        6.      B        0x8004a5c ; mbedtls_asn1_get_len + 140
        0x080049ee:    f005057f    ....    AND      r5,r5,#0x7f
        0x080049f2:    2d01        .-      CMP      r5,#1
        0x080049f4:    d008        ..      BEQ      0x8004a08 ; mbedtls_asn1_get_len + 56
        0x080049f6:    2d02        .-      CMP      r5,#2
        0x080049f8:    d00d        ..      BEQ      0x8004a16 ; mbedtls_asn1_get_len + 70
        0x080049fa:    2d03        .-      CMP      r5,#3
        0x080049fc:    d014        ..      BEQ      0x8004a28 ; mbedtls_asn1_get_len + 88
        0x080049fe:    2d04        .-      CMP      r5,#4
        0x08004a00:    d01f        ..      BEQ      0x8004a42 ; mbedtls_asn1_get_len + 114
        0x08004a02:    f06f0063    o.c.    MVN      r0,#0x63
        0x08004a06:    bdf0        ..      POP      {r4-r7,pc}
        0x08004a08:    2c02        .,      CMP      r4,#2
        0x08004a0a:    db2c        ,.      BLT      0x8004a66 ; mbedtls_asn1_get_len + 150
        0x08004a0c:    785b        [x      LDRB     r3,[r3,#1]
        0x08004a0e:    6013        .`      STR      r3,[r2,#0]
        0x08004a10:    6803        .h      LDR      r3,[r0,#0]
        0x08004a12:    1c9b        ..      ADDS     r3,r3,#2
        0x08004a14:    e021        !.      B        0x8004a5a ; mbedtls_asn1_get_len + 138
        0x08004a16:    2c03        .,      CMP      r4,#3
        0x08004a18:    db25        %.      BLT      0x8004a66 ; mbedtls_asn1_get_len + 150
        0x08004a1a:    f8b33001    ...0    LDRH     r3,[r3,#1]
        0x08004a1e:    ba5b        [.      REV16    r3,r3
        0x08004a20:    6013        .`      STR      r3,[r2,#0]
        0x08004a22:    6803        .h      LDR      r3,[r0,#0]
        0x08004a24:    1cdb        ..      ADDS     r3,r3,#3
        0x08004a26:    e018        ..      B        0x8004a5a ; mbedtls_asn1_get_len + 138
        0x08004a28:    2c04        .,      CMP      r4,#4
        0x08004a2a:    db1c        ..      BLT      0x8004a66 ; mbedtls_asn1_get_len + 150
        0x08004a2c:    785c        \x      LDRB     r4,[r3,#1]
        0x08004a2e:    789d        .x      LDRB     r5,[r3,#2]
        0x08004a30:    0424        $.      LSLS     r4,r4,#16
        0x08004a32:    78db        .x      LDRB     r3,[r3,#3]
        0x08004a34:    ea442405    D..$    ORR      r4,r4,r5,LSL #8
        0x08004a38:    431c        .C      ORRS     r4,r4,r3
        0x08004a3a:    6014        .`      STR      r4,[r2,#0]
        0x08004a3c:    6803        .h      LDR      r3,[r0,#0]
        0x08004a3e:    1d1b        ..      ADDS     r3,r3,#4
        0x08004a40:    e00b        ..      B        0x8004a5a ; mbedtls_asn1_get_len + 138
        0x08004a42:    2c05        .,      CMP      r4,#5
        0x08004a44:    db0f        ..      BLT      0x8004a66 ; mbedtls_asn1_get_len + 150
        0x08004a46:    f8d34001    ...@    LDR      r4,[r3,#1]
        0x08004a4a:    791b        .y      LDRB     r3,[r3,#4]
        0x08004a4c:    ba24        $.      REV      r4,r4
        0x08004a4e:    f02404ff    $...    BIC      r4,r4,#0xff
        0x08004a52:    431c        .C      ORRS     r4,r4,r3
        0x08004a54:    6014        .`      STR      r4,[r2,#0]
        0x08004a56:    6803        .h      LDR      r3,[r0,#0]
        0x08004a58:    1d5b        [.      ADDS     r3,r3,#5
        0x08004a5a:    6003        .`      STR      r3,[r0,#0]
        0x08004a5c:    6800        .h      LDR      r0,[r0,#0]
        0x08004a5e:    6812        .h      LDR      r2,[r2,#0]
        0x08004a60:    1a08        ..      SUBS     r0,r1,r0
        0x08004a62:    4282        .B      CMP      r2,r0
        0x08004a64:    d901        ..      BLS      0x8004a6a ; mbedtls_asn1_get_len + 154
        0x08004a66:    4630        0F      MOV      r0,r6
        0x08004a68:    bdf0        ..      POP      {r4-r7,pc}
        0x08004a6a:    2000        .       MOVS     r0,#0
        0x08004a6c:    bdf0        ..      POP      {r4-r7,pc}
    i.mbedtls_asn1_get_mpi
    mbedtls_asn1_get_mpi
        0x08004a6e:    b538        8.      PUSH     {r3-r5,lr}
        0x08004a70:    4615        .F      MOV      r5,r2
        0x08004a72:    4604        .F      MOV      r4,r0
        0x08004a74:    2302        .#      MOVS     r3,#2
        0x08004a76:    466a        jF      MOV      r2,sp
        0x08004a78:    f000f80c    ....    BL       mbedtls_asn1_get_tag ; 0x8004a94
        0x08004a7c:    2800        .(      CMP      r0,#0
        0x08004a7e:    d108        ..      BNE      0x8004a92 ; mbedtls_asn1_get_mpi + 36
        0x08004a80:    6821        !h      LDR      r1,[r4,#0]
        0x08004a82:    4628        (F      MOV      r0,r5
        0x08004a84:    9a00        ..      LDR      r2,[sp,#0]
        0x08004a86:    f001fe84    ....    BL       mbedtls_mpi_read_binary ; 0x8006792
        0x08004a8a:    6821        !h      LDR      r1,[r4,#0]
        0x08004a8c:    9a00        ..      LDR      r2,[sp,#0]
        0x08004a8e:    4411        .D      ADD      r1,r1,r2
        0x08004a90:    6021        !`      STR      r1,[r4,#0]
        0x08004a92:    bd38        8.      POP      {r3-r5,pc}
    i.mbedtls_asn1_get_tag
    mbedtls_asn1_get_tag
        0x08004a94:    b430        0.      PUSH     {r4,r5}
        0x08004a96:    6804        .h      LDR      r4,[r0,#0]
        0x08004a98:    1b0d        ..      SUBS     r5,r1,r4
        0x08004a9a:    2d01        .-      CMP      r5,#1
        0x08004a9c:    da03        ..      BGE      0x8004aa6 ; mbedtls_asn1_get_tag + 18
        0x08004a9e:    f06f005f    o._.    MVN      r0,#0x5f
        0x08004aa2:    bc30        0.      POP      {r4,r5}
        0x08004aa4:    4770        pG      BX       lr
        0x08004aa6:    7825        %x      LDRB     r5,[r4,#0]
        0x08004aa8:    429d        .B      CMP      r5,r3
        0x08004aaa:    d002        ..      BEQ      0x8004ab2 ; mbedtls_asn1_get_tag + 30
        0x08004aac:    f06f0061    o.a.    MVN      r0,#0x61
        0x08004ab0:    e7f7        ..      B        0x8004aa2 ; mbedtls_asn1_get_tag + 14
        0x08004ab2:    1c64        d.      ADDS     r4,r4,#1
        0x08004ab4:    6004        .`      STR      r4,[r0,#0]
        0x08004ab6:    bc30        0.      POP      {r4,r5}
        0x08004ab8:    f7ffbf8a    ....    B.W      mbedtls_asn1_get_len ; 0x80049d0
    i.mbedtls_ecdsa_free
    mbedtls_ecdsa_free
        0x08004abc:    2800        .(      CMP      r0,#0
        0x08004abe:    d001        ..      BEQ      0x8004ac4 ; mbedtls_ecdsa_free + 8
        0x08004ac0:    f000ba8c    ....    B.W      mbedtls_ecp_keypair_free ; 0x8004fdc
        0x08004ac4:    4770        pG      BX       lr
    i.mbedtls_ecdsa_read_signature
    mbedtls_ecdsa_read_signature
        0x08004ac6:    b57c        |.      PUSH     {r2-r6,lr}
        0x08004ac8:    2500        .%      MOVS     r5,#0
        0x08004aca:    9c06        ..      LDR      r4,[sp,#0x18]
        0x08004acc:    e9cd4500    ...E    STRD     r4,r5,[sp,#0]
        0x08004ad0:    f000f802    ....    BL       mbedtls_ecdsa_read_signature_restartable ; 0x8004ad8
        0x08004ad4:    bd7c        |.      POP      {r2-r6,pc}
        0x08004ad6:    0000        ..      MOVS     r0,r0
    i.mbedtls_ecdsa_read_signature_restartable
    mbedtls_ecdsa_read_signature_restartable
        0x08004ad8:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08004adc:    b08c        ..      SUB      sp,sp,#0x30
        0x08004ade:    4606        .F      MOV      r6,r0
        0x08004ae0:    e9dd0712    ....    LDRD     r0,r7,[sp,#0x48]
        0x08004ae4:    181d        ..      ADDS     r5,r3,r0
        0x08004ae6:    4690        .F      MOV      r8,r2
        0x08004ae8:    460c        .F      MOV      r4,r1
        0x08004aea:    a805        ..      ADD      r0,sp,#0x14
        0x08004aec:    9303        ..      STR      r3,[sp,#0xc]
        0x08004aee:    f001fc43    ..C.    BL       mbedtls_mpi_init ; 0x8006378
        0x08004af2:    a808        ..      ADD      r0,sp,#0x20
        0x08004af4:    f001fc40    ..@.    BL       mbedtls_mpi_init ; 0x8006378
        0x08004af8:    2330        0#      MOVS     r3,#0x30
        0x08004afa:    aa04        ..      ADD      r2,sp,#0x10
        0x08004afc:    4629        )F      MOV      r1,r5
        0x08004afe:    a803        ..      ADD      r0,sp,#0xc
        0x08004b00:    f7ffffc8    ....    BL       mbedtls_asn1_get_tag ; 0x8004a94
        0x08004b04:    b990        ..      CBNZ     r0,0x8004b2c ; mbedtls_ecdsa_read_signature_restartable + 84
        0x08004b06:    e9dd0103    ....    LDRD     r0,r1,[sp,#0xc]
        0x08004b0a:    4408        .D      ADD      r0,r0,r1
        0x08004b0c:    42a8        .B      CMP      r0,r5
        0x08004b0e:    d001        ..      BEQ      0x8004b14 ; mbedtls_ecdsa_read_signature_restartable + 60
        0x08004b10:    4c16        .L      LDR      r4,[pc,#88] ; [0x8004b6c] = 0xffffb01a
        0x08004b12:    e020         .      B        0x8004b56 ; mbedtls_ecdsa_read_signature_restartable + 126
        0x08004b14:    aa05        ..      ADD      r2,sp,#0x14
        0x08004b16:    4629        )F      MOV      r1,r5
        0x08004b18:    a803        ..      ADD      r0,sp,#0xc
        0x08004b1a:    f7ffffa8    ....    BL       mbedtls_asn1_get_mpi ; 0x8004a6e
        0x08004b1e:    b928        (.      CBNZ     r0,0x8004b2c ; mbedtls_ecdsa_read_signature_restartable + 84
        0x08004b20:    aa08        ..      ADD      r2,sp,#0x20
        0x08004b22:    4629        )F      MOV      r1,r5
        0x08004b24:    a803        ..      ADD      r0,sp,#0xc
        0x08004b26:    f7ffffa2    ....    BL       mbedtls_asn1_get_mpi ; 0x8004a6e
        0x08004b2a:    b110        ..      CBZ      r0,0x8004b32 ; mbedtls_ecdsa_read_signature_restartable + 90
        0x08004b2c:    f5a0449f    ...D    SUB      r4,r0,#0x4f80
        0x08004b30:    e011        ..      B        0x8004b56 ; mbedtls_ecdsa_read_signature_restartable + 126
        0x08004b32:    a808        ..      ADD      r0,sp,#0x20
        0x08004b34:    a905        ..      ADD      r1,sp,#0x14
        0x08004b36:    e9cd1000    ....    STRD     r1,r0,[sp,#0]
        0x08004b3a:    f1060388    ....    ADD      r3,r6,#0x88
        0x08004b3e:    4642        BF      MOV      r2,r8
        0x08004b40:    9702        ..      STR      r7,[sp,#8]
        0x08004b42:    4621        !F      MOV      r1,r4
        0x08004b44:    4630        0F      MOV      r0,r6
        0x08004b46:    f7fdf97d    ..}.    BL       ecdsa_verify_restartable ; 0x8001e44
        0x08004b4a:    0004        ..      MOVS     r4,r0
        0x08004b4c:    d103        ..      BNE      0x8004b56 ; mbedtls_ecdsa_read_signature_restartable + 126
        0x08004b4e:    9803        ..      LDR      r0,[sp,#0xc]
        0x08004b50:    42a8        .B      CMP      r0,r5
        0x08004b52:    d000        ..      BEQ      0x8004b56 ; mbedtls_ecdsa_read_signature_restartable + 126
        0x08004b54:    4c06        .L      LDR      r4,[pc,#24] ; [0x8004b70] = 0xffffb400
        0x08004b56:    a805        ..      ADD      r0,sp,#0x14
        0x08004b58:    f001fb45    ..E.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08004b5c:    a808        ..      ADD      r0,sp,#0x20
        0x08004b5e:    f001fb42    ..B.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08004b62:    b00c        ..      ADD      sp,sp,#0x30
        0x08004b64:    4620         F      MOV      r0,r4
        0x08004b66:    e8bd81f0    ....    POP      {r4-r8,pc}
    $d
        0x08004b6a:    0000        ..      DCW    0
        0x08004b6c:    ffffb01a    ....    DCD    4294946842
        0x08004b70:    ffffb400    ....    DCD    4294947840
    $t
    i.mbedtls_ecp_check_privkey
    mbedtls_ecp_check_privkey
        0x08004b74:    b570        p.      PUSH     {r4-r6,lr}
        0x08004b76:    460e        .F      MOV      r6,r1
        0x08004b78:    4604        .F      MOV      r4,r0
        0x08004b7a:    f000f88b    ....    BL       mbedtls_ecp_get_type ; 0x8004c94
        0x08004b7e:    4d1a        .M      LDR      r5,[pc,#104] ; [0x8004be8] = 0xffffb380
        0x08004b80:    2802        .(      CMP      r0,#2
        0x08004b82:    d006        ..      BEQ      0x8004b92 ; mbedtls_ecp_check_privkey + 30
        0x08004b84:    4620         F      MOV      r0,r4
        0x08004b86:    f000f885    ....    BL       mbedtls_ecp_get_type ; 0x8004c94
        0x08004b8a:    2801        .(      CMP      r0,#1
        0x08004b8c:    d01a        ..      BEQ      0x8004bc4 ; mbedtls_ecp_check_privkey + 80
        0x08004b8e:    4817        .H      LDR      r0,[pc,#92] ; [0x8004bec] = 0xffffb080
        0x08004b90:    bd70        p.      POP      {r4-r6,pc}
        0x08004b92:    2100        .!      MOVS     r1,#0
        0x08004b94:    4630        0F      MOV      r0,r6
        0x08004b96:    f001fbb7    ....    BL       mbedtls_mpi_get_bit ; 0x8006308
        0x08004b9a:    bb00        ..      CBNZ     r0,0x8004bde ; mbedtls_ecp_check_privkey + 106
        0x08004b9c:    2101        .!      MOVS     r1,#1
        0x08004b9e:    4630        0F      MOV      r0,r6
        0x08004ba0:    f001fbb2    ....    BL       mbedtls_mpi_get_bit ; 0x8006308
        0x08004ba4:    b9d8        ..      CBNZ     r0,0x8004bde ; mbedtls_ecp_check_privkey + 106
        0x08004ba6:    4630        0F      MOV      r0,r6
        0x08004ba8:    f001f87d    ..}.    BL       mbedtls_mpi_bitlen ; 0x8005ca6
        0x08004bac:    6de1        .m      LDR      r1,[r4,#0x5c]
        0x08004bae:    1e40        @.      SUBS     r0,r0,#1
        0x08004bb0:    4288        .B      CMP      r0,r1
        0x08004bb2:    d114        ..      BNE      0x8004bde ; mbedtls_ecp_check_privkey + 106
        0x08004bb4:    29fe        .)      CMP      r1,#0xfe
        0x08004bb6:    d114        ..      BNE      0x8004be2 ; mbedtls_ecp_check_privkey + 110
        0x08004bb8:    2102        .!      MOVS     r1,#2
        0x08004bba:    4630        0F      MOV      r0,r6
        0x08004bbc:    f001fba4    ....    BL       mbedtls_mpi_get_bit ; 0x8006308
        0x08004bc0:    b968        h.      CBNZ     r0,0x8004bde ; mbedtls_ecp_check_privkey + 106
        0x08004bc2:    e00e        ..      B        0x8004be2 ; mbedtls_ecp_check_privkey + 110
        0x08004bc4:    2101        .!      MOVS     r1,#1
        0x08004bc6:    4630        0F      MOV      r0,r6
        0x08004bc8:    f001f8be    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08004bcc:    2800        .(      CMP      r0,#0
        0x08004bce:    db06        ..      BLT      0x8004bde ; mbedtls_ecp_check_privkey + 106
        0x08004bd0:    f104014c    ..L.    ADD      r1,r4,#0x4c
        0x08004bd4:    4630        0F      MOV      r0,r6
        0x08004bd6:    f001f8cf    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08004bda:    2800        .(      CMP      r0,#0
        0x08004bdc:    db01        ..      BLT      0x8004be2 ; mbedtls_ecp_check_privkey + 110
        0x08004bde:    4628        (F      MOV      r0,r5
        0x08004be0:    bd70        p.      POP      {r4-r6,pc}
        0x08004be2:    2000        .       MOVS     r0,#0
        0x08004be4:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x08004be6:    0000        ..      DCW    0
        0x08004be8:    ffffb380    ....    DCD    4294947712
        0x08004bec:    ffffb080    ....    DCD    4294946944
    $t
    i.mbedtls_ecp_check_pubkey
    mbedtls_ecp_check_pubkey
        0x08004bf0:    b570        p.      PUSH     {r4-r6,lr}
        0x08004bf2:    460c        .F      MOV      r4,r1
        0x08004bf4:    4606        .F      MOV      r6,r0
        0x08004bf6:    2101        .!      MOVS     r1,#1
        0x08004bf8:    f1040018    ....    ADD      r0,r4,#0x18
        0x08004bfc:    f001f8a4    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08004c00:    4d0f        .M      LDR      r5,[pc,#60] ; [0x8004c40] = 0xffffb380
        0x08004c02:    b998        ..      CBNZ     r0,0x8004c2c ; mbedtls_ecp_check_pubkey + 60
        0x08004c04:    4630        0F      MOV      r0,r6
        0x08004c06:    f000f845    ..E.    BL       mbedtls_ecp_get_type ; 0x8004c94
        0x08004c0a:    2802        .(      CMP      r0,#2
        0x08004c0c:    d006        ..      BEQ      0x8004c1c ; mbedtls_ecp_check_pubkey + 44
        0x08004c0e:    4630        0F      MOV      r0,r6
        0x08004c10:    f000f840    ..@.    BL       mbedtls_ecp_get_type ; 0x8004c94
        0x08004c14:    2801        .(      CMP      r0,#1
        0x08004c16:    d00d        ..      BEQ      0x8004c34 ; mbedtls_ecp_check_pubkey + 68
        0x08004c18:    480a        .H      LDR      r0,[pc,#40] ; [0x8004c44] = 0xffffb080
        0x08004c1a:    bd70        p.      POP      {r4-r6,pc}
        0x08004c1c:    4620         F      MOV      r0,r4
        0x08004c1e:    f002f818    ....    BL       mbedtls_mpi_size ; 0x8006c52
        0x08004c22:    6df1        .m      LDR      r1,[r6,#0x5c]
        0x08004c24:    1dc9        ..      ADDS     r1,r1,#7
        0x08004c26:    ebb00fd1    ....    CMP      r0,r1,LSR #3
        0x08004c2a:    d901        ..      BLS      0x8004c30 ; mbedtls_ecp_check_pubkey + 64
        0x08004c2c:    4628        (F      MOV      r0,r5
        0x08004c2e:    bd70        p.      POP      {r4-r6,pc}
        0x08004c30:    2000        .       MOVS     r0,#0
        0x08004c32:    bd70        p.      POP      {r4-r6,pc}
        0x08004c34:    4621        !F      MOV      r1,r4
        0x08004c36:    4630        0F      MOV      r0,r6
        0x08004c38:    e8bd4070    ..p@    POP      {r4-r6,lr}
        0x08004c3c:    f7fdbbf2    ....    B        ecp_check_pubkey_sw ; 0x8002424
    $d
        0x08004c40:    ffffb380    ....    DCD    4294947712
        0x08004c44:    ffffb080    ....    DCD    4294946944
    $t
    i.mbedtls_ecp_copy
    mbedtls_ecp_copy
        0x08004c48:    b570        p.      PUSH     {r4-r6,lr}
        0x08004c4a:    460c        .F      MOV      r4,r1
        0x08004c4c:    4605        .F      MOV      r5,r0
        0x08004c4e:    f001f8d9    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08004c52:    2800        .(      CMP      r0,#0
        0x08004c54:    d10f        ..      BNE      0x8004c76 ; mbedtls_ecp_copy + 46
        0x08004c56:    f104010c    ....    ADD      r1,r4,#0xc
        0x08004c5a:    f105000c    ....    ADD      r0,r5,#0xc
        0x08004c5e:    f001f8d1    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08004c62:    2800        .(      CMP      r0,#0
        0x08004c64:    d107        ..      BNE      0x8004c76 ; mbedtls_ecp_copy + 46
        0x08004c66:    f1040118    ....    ADD      r1,r4,#0x18
        0x08004c6a:    f1050018    ....    ADD      r0,r5,#0x18
        0x08004c6e:    e8bd4070    ..p@    POP      {r4-r6,lr}
        0x08004c72:    f001b8c7    ....    B.W      mbedtls_mpi_copy ; 0x8005e04
        0x08004c76:    bd70        p.      POP      {r4-r6,pc}
    i.mbedtls_ecp_curve_info_from_tls_id
    mbedtls_ecp_curve_info_from_tls_id
        0x08004c78:    4601        .F      MOV      r1,r0
        0x08004c7a:    4805        .H      LDR      r0,[pc,#20] ; [0x8004c90] = 0x800757c
        0x08004c7c:    e003        ..      B        0x8004c86 ; mbedtls_ecp_curve_info_from_tls_id + 14
        0x08004c7e:    8842        B.      LDRH     r2,[r0,#2]
        0x08004c80:    428a        .B      CMP      r2,r1
        0x08004c82:    d004        ..      BEQ      0x8004c8e ; mbedtls_ecp_curve_info_from_tls_id + 22
        0x08004c84:    300c        .0      ADDS     r0,r0,#0xc
        0x08004c86:    7802        .x      LDRB     r2,[r0,#0]
        0x08004c88:    2a00        .*      CMP      r2,#0
        0x08004c8a:    d1f8        ..      BNE      0x8004c7e ; mbedtls_ecp_curve_info_from_tls_id + 6
        0x08004c8c:    2000        .       MOVS     r0,#0
        0x08004c8e:    4770        pG      BX       lr
    $d
        0x08004c90:    0800757c    |u..    DCD    134247804
    $t
    i.mbedtls_ecp_get_type
    mbedtls_ecp_get_type
        0x08004c94:    6b01        .k      LDR      r1,[r0,#0x30]
        0x08004c96:    b119        ..      CBZ      r1,0x8004ca0 ; mbedtls_ecp_get_type + 12
        0x08004c98:    6bc0        .k      LDR      r0,[r0,#0x3c]
        0x08004c9a:    b118        ..      CBZ      r0,0x8004ca4 ; mbedtls_ecp_get_type + 16
