openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08004c9c:    2001        .       MOVS     r0,#1
        0x08004c9e:    4770        pG      BX       lr
        0x08004ca0:    2000        .       MOVS     r0,#0
        0x08004ca2:    4770        pG      BX       lr
        0x08004ca4:    2002        .       MOVS     r0,#2
        0x08004ca6:    4770        pG      BX       lr
    i.mbedtls_ecp_group_free
    mbedtls_ecp_group_free
        0x08004ca8:    b570        p.      PUSH     {r4-r6,lr}
        0x08004caa:    0004        ..      MOVS     r4,r0
        0x08004cac:    d02d        -.      BEQ      0x8004d0a ; mbedtls_ecp_group_free + 98
        0x08004cae:    6e20         n      LDR      r0,[r4,#0x60]
        0x08004cb0:    2801        .(      CMP      r0,#1
        0x08004cb2:    d012        ..      BEQ      0x8004cda ; mbedtls_ecp_group_free + 50
        0x08004cb4:    1d20         .      ADDS     r0,r4,#4
        0x08004cb6:    f001fa96    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08004cba:    f1040010    ....    ADD      r0,r4,#0x10
        0x08004cbe:    f001fa92    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08004cc2:    f104001c    ....    ADD      r0,r4,#0x1c
        0x08004cc6:    f001fa8e    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08004cca:    f1040028    ..(.    ADD      r0,r4,#0x28
        0x08004cce:    f000fa53    ..S.    BL       mbedtls_ecp_point_free ; 0x8005178
        0x08004cd2:    f104004c    ..L.    ADD      r0,r4,#0x4c
        0x08004cd6:    f001fa86    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08004cda:    6f60        `o      LDR      r0,[r4,#0x74]
        0x08004cdc:    b178        x.      CBZ      r0,0x8004cfe ; mbedtls_ecp_group_free + 86
        0x08004cde:    2500        .%      MOVS     r5,#0
        0x08004ce0:    e007        ..      B        0x8004cf2 ; mbedtls_ecp_group_free + 74
        0x08004ce2:    bf00        ..      NOP      
        0x08004ce4:    eb0501c5    ....    ADD      r1,r5,r5,LSL #3
        0x08004ce8:    eb000081    ....    ADD      r0,r0,r1,LSL #2
        0x08004cec:    f000fa44    ..D.    BL       mbedtls_ecp_point_free ; 0x8005178
        0x08004cf0:    1c6d        m.      ADDS     r5,r5,#1
        0x08004cf2:    6fa0        .o      LDR      r0,[r4,#0x78]
        0x08004cf4:    42a8        .B      CMP      r0,r5
        0x08004cf6:    6f60        `o      LDR      r0,[r4,#0x74]
        0x08004cf8:    d8f4        ..      BHI      0x8004ce4 ; mbedtls_ecp_group_free + 60
        0x08004cfa:    f7fbface    ....    BL       free ; 0x800029a
        0x08004cfe:    4620         F      MOV      r0,r4
        0x08004d00:    e8bd4070    ..p@    POP      {r4-r6,lr}
        0x08004d04:    217c        |!      MOVS     r1,#0x7c
        0x08004d06:    f002b821    ..!.    B.W      mbedtls_platform_zeroize ; 0x8006d4c
        0x08004d0a:    bd70        p.      POP      {r4-r6,pc}
    i.mbedtls_ecp_group_init
    mbedtls_ecp_group_init
        0x08004d0c:    b570        p.      PUSH     {r4-r6,lr}
        0x08004d0e:    4604        .F      MOV      r4,r0
        0x08004d10:    2500        .%      MOVS     r5,#0
        0x08004d12:    f8005b04    ...[    STRB     r5,[r0],#4
        0x08004d16:    f001fb2f    ../.    BL       mbedtls_mpi_init ; 0x8006378
        0x08004d1a:    f1040010    ....    ADD      r0,r4,#0x10
        0x08004d1e:    f001fb2b    ..+.    BL       mbedtls_mpi_init ; 0x8006378
        0x08004d22:    f104001c    ....    ADD      r0,r4,#0x1c
        0x08004d26:    f001fb27    ..'.    BL       mbedtls_mpi_init ; 0x8006378
        0x08004d2a:    f1040028    ..(.    ADD      r0,r4,#0x28
        0x08004d2e:    f000fa33    ..3.    BL       mbedtls_ecp_point_init ; 0x8005198
        0x08004d32:    f104004c    ..L.    ADD      r0,r4,#0x4c
        0x08004d36:    f001fb1f    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08004d3a:    65a5        .e      STR      r5,[r4,#0x58]
        0x08004d3c:    65e5        .e      STR      r5,[r4,#0x5c]
        0x08004d3e:    6625        %f      STR      r5,[r4,#0x60]
        0x08004d40:    6665        ef      STR      r5,[r4,#0x64]
        0x08004d42:    66a5        .f      STR      r5,[r4,#0x68]
        0x08004d44:    66e5        .f      STR      r5,[r4,#0x6c]
        0x08004d46:    6725        %g      STR      r5,[r4,#0x70]
        0x08004d48:    6765        eg      STR      r5,[r4,#0x74]
        0x08004d4a:    67a5        .g      STR      r5,[r4,#0x78]
        0x08004d4c:    bd70        p.      POP      {r4-r6,pc}
        0x08004d4e:    0000        ..      MOVS     r0,r0
    i.mbedtls_ecp_group_load
    mbedtls_ecp_group_load
        0x08004d50:    b5f0        ..      PUSH     {r4-r7,lr}
        0x08004d52:    b089        ..      SUB      sp,sp,#0x24
        0x08004d54:    460d        .F      MOV      r5,r1
        0x08004d56:    4604        .F      MOV      r4,r0
        0x08004d58:    f7ffffa6    ....    BL       mbedtls_ecp_group_free ; 0x8004ca8
        0x08004d5c:    2700        .'      MOVS     r7,#0
        0x08004d5e:    2004        .       MOVS     r0,#4
        0x08004d60:    2118        .!      MOVS     r1,#0x18
        0x08004d62:    231c        .#      MOVS     r3,#0x1c
        0x08004d64:    2220         "      MOVS     r2,#0x20
        0x08004d66:    2630        0&      MOVS     r6,#0x30
        0x08004d68:    7025        %p      STRB     r5,[r4,#0]
        0x08004d6a:    2d0e        .-      CMP      r5,#0xe
        0x08004d6c:    d270        p.      BCS      0x8004e50 ; mbedtls_ecp_group_load + 256
        0x08004d6e:    e8dff005    ....    TBB      [pc,r5]
    $d
        0x08004d72:    076f        o.      DCW    1903
        0x08004d74:    5a45311c    .1EZ    DCD    1514483996
        0x08004d78:    f3d9c6b2    ....    DCD    4091135666
        0x08004d7c:    fb9d8770    p...    DCD    4221405040
    $t
        0x08004d80:    4880        .H      LDR      r0,[pc,#512] ; [0x8004f84] = 0x8002e6f
        0x08004d82:    6660        `f      STR      r0,[r4,#0x64]
        0x08004d84:    4880        .H      LDR      r0,[pc,#512] ; [0x8004f88] = 0x8007684
        0x08004d86:    9108        ..      STR      r1,[sp,#0x20]
        0x08004d88:    e9cd1006    ....    STRD     r1,r0,[sp,#0x18]
        0x08004d8c:    f1a00218    ....    SUB      r2,r0,#0x18
        0x08004d90:    3830        08      SUBS     r0,r0,#0x30
        0x08004d92:    9205        ..      STR      r2,[sp,#0x14]
        0x08004d94:    3a30        0:      SUBS     r2,r2,#0x30
        0x08004d96:    e9cd1002    ....    STRD     r1,r0,[sp,#8]
        0x08004d9a:    e9cd7200    ...r    STRD     r7,r2,[sp,#0]
        0x08004d9e:    2300        .#      MOVS     r3,#0
        0x08004da0:    9104        ..      STR      r1,[sp,#0x10]
        0x08004da2:    2218        ."      MOVS     r2,#0x18
        0x08004da4:    f1a00130    ..0.    SUB      r1,r0,#0x30
        0x08004da8:    e0cf        ..      B        0x8004f4a ; mbedtls_ecp_group_load + 506
        0x08004daa:    4878        xH      LDR      r0,[pc,#480] ; [0x8004f8c] = 0x8002f0b
        0x08004dac:    6660        `f      STR      r0,[r4,#0x64]
        0x08004dae:    4876        vH      LDR      r0,[pc,#472] ; [0x8004f88] = 0x8007684
        0x08004db0:    9308        ..      STR      r3,[sp,#0x20]
        0x08004db2:    308c        .0      ADDS     r0,r0,#0x8c
        0x08004db4:    f1a0011c    ....    SUB      r1,r0,#0x1c
        0x08004db8:    e9cd3006    ...0    STRD     r3,r0,[sp,#0x18]
        0x08004dbc:    9105        ..      STR      r1,[sp,#0x14]
        0x08004dbe:    3838        88      SUBS     r0,r0,#0x38
        0x08004dc0:    3938        89      SUBS     r1,r1,#0x38
        0x08004dc2:    e9cd3002    ...0    STRD     r3,r0,[sp,#8]
        0x08004dc6:    e9cd7100    ...q    STRD     r7,r1,[sp,#0]
        0x08004dca:    9304        ..      STR      r3,[sp,#0x10]
        0x08004dcc:    2300        .#      MOVS     r3,#0
        0x08004dce:    2220         "      MOVS     r2,#0x20
        0x08004dd0:    3920         9      SUBS     r1,r1,#0x20
        0x08004dd2:    e0ba        ..      B        0x8004f4a ; mbedtls_ecp_group_load + 506
        0x08004dd4:    486e        nH      LDR      r0,[pc,#440] ; [0x8004f90] = 0x80031dd
        0x08004dd6:    6660        `f      STR      r0,[r4,#0x64]
        0x08004dd8:    486e        nH      LDR      r0,[pc,#440] ; [0x8004f94] = 0x80077ac
        0x08004dda:    9208        ..      STR      r2,[sp,#0x20]
        0x08004ddc:    f1a00120    .. .    SUB      r1,r0,#0x20
        0x08004de0:    e9cd2006    ...     STRD     r2,r0,[sp,#0x18]
        0x08004de4:    9105        ..      STR      r1,[sp,#0x14]
        0x08004de6:    3840        @8      SUBS     r0,r0,#0x40
        0x08004de8:    3940        @9      SUBS     r1,r1,#0x40
        0x08004dea:    e9cd2002    ...     STRD     r2,r0,[sp,#8]
        0x08004dee:    e9cd7100    ...q    STRD     r7,r1,[sp,#0]
        0x08004df2:    9204        ..      STR      r2,[sp,#0x10]
        0x08004df4:    2300        .#      MOVS     r3,#0
        0x08004df6:    2220         "      MOVS     r2,#0x20
        0x08004df8:    3920         9      SUBS     r1,r1,#0x20
        0x08004dfa:    e0a6        ..      B        0x8004f4a ; mbedtls_ecp_group_load + 506
        0x08004dfc:    4866        fH      LDR      r0,[pc,#408] ; [0x8004f98] = 0x8003629
        0x08004dfe:    6660        `f      STR      r0,[r4,#0x64]
        0x08004e00:    4864        dH      LDR      r0,[pc,#400] ; [0x8004f94] = 0x80077ac
        0x08004e02:    9608        ..      STR      r6,[sp,#0x20]
        0x08004e04:    30e0        .0      ADDS     r0,r0,#0xe0
        0x08004e06:    f1a00130    ..0.    SUB      r1,r0,#0x30
        0x08004e0a:    e9cd6006    ...`    STRD     r6,r0,[sp,#0x18]
        0x08004e0e:    9105        ..      STR      r1,[sp,#0x14]
        0x08004e10:    3860        `8      SUBS     r0,r0,#0x60
        0x08004e12:    3960        `9      SUBS     r1,r1,#0x60
        0x08004e14:    e9cd7100    ...q    STRD     r7,r1,[sp,#0]
        0x08004e18:    e9cd6002    ...`    STRD     r6,r0,[sp,#8]
        0x08004e1c:    2300        .#      MOVS     r3,#0
        0x08004e1e:    2230        0"      MOVS     r2,#0x30
        0x08004e20:    9604        ..      STR      r6,[sp,#0x10]
        0x08004e22:    3930        09      SUBS     r1,r1,#0x30
        0x08004e24:    e091        ..      B        0x8004f4a ; mbedtls_ecp_group_load + 506
        0x08004e26:    485d        ]H      LDR      r0,[pc,#372] ; [0x8004f9c] = 0x8003c59
        0x08004e28:    6660        `f      STR      r0,[r4,#0x64]
        0x08004e2a:    495d        ]I      LDR      r1,[pc,#372] ; [0x8004fa0] = 0x80079cc
        0x08004e2c:    2044        D       MOVS     r0,#0x44
        0x08004e2e:    f1a10244    ..D.    SUB      r2,r1,#0x44
        0x08004e32:    e9cd0106    ....    STRD     r0,r1,[sp,#0x18]
        0x08004e36:    9205        ..      STR      r2,[sp,#0x14]
        0x08004e38:    3a88        .:      SUBS     r2,r2,#0x88
        0x08004e3a:    e9cd7200    ...r    STRD     r7,r2,[sp,#0]
        0x08004e3e:    3988        .9      SUBS     r1,r1,#0x88
        0x08004e40:    9008        ..      STR      r0,[sp,#0x20]
        0x08004e42:    e9cd0102    ....    STRD     r0,r1,[sp,#8]
        0x08004e46:    2300        .#      MOVS     r3,#0
        0x08004e48:    9004        ..      STR      r0,[sp,#0x10]
        0x08004e4a:    4602        .F      MOV      r2,r0
        0x08004e4c:    3988        .9      SUBS     r1,r1,#0x88
        0x08004e4e:    e07c        |.      B        0x8004f4a ; mbedtls_ecp_group_load + 506
        0x08004e50:    e092        ..      B        0x8004f78 ; mbedtls_ecp_group_load + 552
        0x08004e52:    4a54        TJ      LDR      r2,[pc,#336] ; [0x8004fa4] = 0x8002091
        0x08004e54:    6662        bf      STR      r2,[r4,#0x64]
        0x08004e56:    4a52        RJ      LDR      r2,[pc,#328] ; [0x8004fa0] = 0x80079cc
        0x08004e58:    9108        ..      STR      r1,[sp,#0x20]
        0x08004e5a:    328c        .2      ADDS     r2,r2,#0x8c
        0x08004e5c:    e9cd1206    ....    STRD     r1,r2,[sp,#0x18]
        0x08004e60:    f1a20318    ....    SUB      r3,r2,#0x18
        0x08004e64:    3a30        0:      SUBS     r2,r2,#0x30
        0x08004e66:    9305        ..      STR      r3,[sp,#0x14]
        0x08004e68:    f5a26383    ...c    SUB      r3,r2,#0x418
        0x08004e6c:    e9cd0300    ....    STRD     r0,r3,[sp,#0]
        0x08004e70:    e9cd0202    ....    STRD     r0,r2,[sp,#8]
        0x08004e74:    1f1b        ..      SUBS     r3,r3,#4
        0x08004e76:    9104        ..      STR      r1,[sp,#0x10]
        0x08004e78:    2218        ."      MOVS     r2,#0x18
        0x08004e7a:    f2034104    ...A    ADD      r1,r3,#0x404
        0x08004e7e:    e064        d.      B        0x8004f4a ; mbedtls_ecp_group_load + 506
        0x08004e80:    4949        II      LDR      r1,[pc,#292] ; [0x8004fa8] = 0x80020a9
        0x08004e82:    6661        af      STR      r1,[r4,#0x64]
        0x08004e84:    4946        FI      LDR      r1,[pc,#280] ; [0x8004fa0] = 0x80079cc
        0x08004e86:    31f8        .1      ADDS     r1,r1,#0xf8
        0x08004e88:    e9cd1207    ....    STRD     r1,r2,[sp,#0x1c]
        0x08004e8c:    f1a1051c    ....    SUB      r5,r1,#0x1c
        0x08004e90:    e9cd5305    ...S    STRD     r5,r3,[sp,#0x14]
        0x08004e94:    3938        89      SUBS     r1,r1,#0x38
        0x08004e96:    ad02        ..      ADD      r5,sp,#8
        0x08004e98:    f2a14274    ..tB    SUB      r2,r1,#0x474
        0x08004e9c:    e885000b    ....    STM      r5,{r0,r1,r3}
        0x08004ea0:    e9cd0200    ....    STRD     r0,r2,[sp,#0]
        0x08004ea4:    1f13        ..      SUBS     r3,r2,#4
        0x08004ea6:    221c        ."      MOVS     r2,#0x1c
        0x08004ea8:    391c        .9      SUBS     r1,r1,#0x1c
        0x08004eaa:    e04e        N.      B        0x8004f4a ; mbedtls_ecp_group_load + 506
        0x08004eac:    493f        ?I      LDR      r1,[pc,#252] ; [0x8004fac] = 0x8003611
        0x08004eae:    6661        af      STR      r1,[r4,#0x64]
        0x08004eb0:    493f        ?I      LDR      r1,[pc,#252] ; [0x8004fb0] = 0x8007b44
        0x08004eb2:    ad02        ..      ADD      r5,sp,#8
        0x08004eb4:    e9cd2106    ...!    STRD     r2,r1,[sp,#0x18]
        0x08004eb8:    f1a10320    .. .    SUB      r3,r1,#0x20
        0x08004ebc:    9305        ..      STR      r3,[sp,#0x14]
        0x08004ebe:    3940        @9      SUBS     r1,r1,#0x40
        0x08004ec0:    9208        ..      STR      r2,[sp,#0x20]
        0x08004ec2:    e8850007    ....    STM      r5,{r0-r2}
        0x08004ec6:    f2a143e4    ...C    SUB      r3,r1,#0x4e4
        0x08004eca:    e9cd0300    ....    STRD     r0,r3,[sp,#0]
        0x08004ece:    1f1b        ..      SUBS     r3,r3,#4
        0x08004ed0:    2220         "      MOVS     r2,#0x20
        0x08004ed2:    3920         9      SUBS     r1,r1,#0x20
        0x08004ed4:    e039        9.      B        0x8004f4a ; mbedtls_ecp_group_load + 506
        0x08004ed6:    4836        6H      LDR      r0,[pc,#216] ; [0x8004fb0] = 0x8007b44
        0x08004ed8:    9208        ..      STR      r2,[sp,#0x20]
        0x08004eda:    30c0        .0      ADDS     r0,r0,#0xc0
        0x08004edc:    f1a00120    .. .    SUB      r1,r0,#0x20
        0x08004ee0:    e9cd2006    ...     STRD     r2,r0,[sp,#0x18]
        0x08004ee4:    9105        ..      STR      r1,[sp,#0x14]
        0x08004ee6:    3840        @8      SUBS     r0,r0,#0x40
        0x08004ee8:    3940        @9      SUBS     r1,r1,#0x40
        0x08004eea:    e9cd2002    ...     STRD     r2,r0,[sp,#8]
        0x08004eee:    e9cd2100    ...!    STRD     r2,r1,[sp,#0]
        0x08004ef2:    9204        ..      STR      r2,[sp,#0x10]
        0x08004ef4:    2220         "      MOVS     r2,#0x20
        0x08004ef6:    f1a00340    ..@.    SUB      r3,r0,#0x40
        0x08004efa:    3940        @9      SUBS     r1,r1,#0x40
        0x08004efc:    e025        %.      B        0x8004f4a ; mbedtls_ecp_group_load + 506
        0x08004efe:    482d        -H      LDR      r0,[pc,#180] ; [0x8004fb4] = 0x8007d14
        0x08004f00:    9608        ..      STR      r6,[sp,#0x20]
        0x08004f02:    f1a00130    ..0.    SUB      r1,r0,#0x30
        0x08004f06:    e9cd6006    ...`    STRD     r6,r0,[sp,#0x18]
        0x08004f0a:    9105        ..      STR      r1,[sp,#0x14]
        0x08004f0c:    3860        `8      SUBS     r0,r0,#0x60
        0x08004f0e:    3960        `9      SUBS     r1,r1,#0x60
        0x08004f10:    e9cd6100    ...a    STRD     r6,r1,[sp,#0]
        0x08004f14:    e9cd6002    ...`    STRD     r6,r0,[sp,#8]
        0x08004f18:    2230        0"      MOVS     r2,#0x30
        0x08004f1a:    f1a00360    ..`.    SUB      r3,r0,#0x60
        0x08004f1e:    9604        ..      STR      r6,[sp,#0x10]
        0x08004f20:    3960        `9      SUBS     r1,r1,#0x60
        0x08004f22:    e012        ..      B        0x8004f4a ; mbedtls_ecp_group_load + 506
        0x08004f24:    4924        $I      LDR      r1,[pc,#144] ; [0x8004fb8] = 0x8007e84
        0x08004f26:    2040        @       MOVS     r0,#0x40
        0x08004f28:    f1a10240    ..@.    SUB      r2,r1,#0x40
        0x08004f2c:    e9cd0106    ....    STRD     r0,r1,[sp,#0x18]
        0x08004f30:    9205        ..      STR      r2,[sp,#0x14]
        0x08004f32:    3a80        .:      SUBS     r2,r2,#0x80
        0x08004f34:    3980        .9      SUBS     r1,r1,#0x80
        0x08004f36:    e9cd0200    ....    STRD     r0,r2,[sp,#0]
        0x08004f3a:    9008        ..      STR      r0,[sp,#0x20]
        0x08004f3c:    e9cd0102    ....    STRD     r0,r1,[sp,#8]
        0x08004f40:    f1a10380    ....    SUB      r3,r1,#0x80
        0x08004f44:    9004        ..      STR      r0,[sp,#0x10]
        0x08004f46:    4602        .F      MOV      r2,r0
        0x08004f48:    39c0        .9      SUBS     r1,r1,#0xc0
        0x08004f4a:    4620         F      MOV      r0,r4
        0x08004f4c:    f7fdfeaa    ....    BL       ecp_group_load ; 0x8002ca4
        0x08004f50:    b009        ..      ADD      sp,sp,#0x24
        0x08004f52:    bdf0        ..      POP      {r4-r7,pc}
        0x08004f54:    e008        ..      B        0x8004f68 ; mbedtls_ecp_group_load + 536
        0x08004f56:    e7ff        ..      B        0x8004f58 ; mbedtls_ecp_group_load + 520
        0x08004f58:    4818        .H      LDR      r0,[pc,#96] ; [0x8004fbc] = 0x800314d
        0x08004f5a:    6660        `f      STR      r0,[r4,#0x64]
        0x08004f5c:    b009        ..      ADD      sp,sp,#0x24
        0x08004f5e:    4620         F      MOV      r0,r4
        0x08004f60:    e8bd40f0    ...@    POP      {r4-r7,lr}
        0x08004f64:    f7ffbb7c    ..|.    B        ecp_use_curve25519 ; 0x8004660
        0x08004f68:    4815        .H      LDR      r0,[pc,#84] ; [0x8004fc0] = 0x8003b89
        0x08004f6a:    6660        `f      STR      r0,[r4,#0x64]
        0x08004f6c:    b009        ..      ADD      sp,sp,#0x24
        0x08004f6e:    4620         F      MOV      r0,r4
        0x08004f70:    e8bd40f0    ...@    POP      {r4-r7,lr}
        0x08004f74:    f7ffbbd4    ....    B        ecp_use_curve448 ; 0x8004720
        0x08004f78:    4620         F      MOV      r0,r4
        0x08004f7a:    f7fffe95    ....    BL       mbedtls_ecp_group_free ; 0x8004ca8
        0x08004f7e:    4811        .H      LDR      r0,[pc,#68] ; [0x8004fc4] = 0xffffb180
        0x08004f80:    e7e6        ..      B        0x8004f50 ; mbedtls_ecp_group_load + 512
    $d
        0x08004f82:    0000        ..      DCW    0
        0x08004f84:    08002e6f    o...    DCD    134229615
        0x08004f88:    08007684    .v..    DCD    134248068
        0x08004f8c:    08002f0b    ./..    DCD    134229771
        0x08004f90:    080031dd    .1..    DCD    134230493
        0x08004f94:    080077ac    .w..    DCD    134248364
        0x08004f98:    08003629    )6..    DCD    134231593
        0x08004f9c:    08003c59    Y<..    DCD    134233177
        0x08004fa0:    080079cc    .y..    DCD    134248908
        0x08004fa4:    08002091    . ..    DCD    134226065
        0x08004fa8:    080020a9    . ..    DCD    134226089
        0x08004fac:    08003611    .6..    DCD    134231569
        0x08004fb0:    08007b44    D{..    DCD    134249284
        0x08004fb4:    08007d14    .}..    DCD    134249748
        0x08004fb8:    08007e84    .~..    DCD    134250116
        0x08004fbc:    0800314d    M1..    DCD    134230349
        0x08004fc0:    08003b89    .;..    DCD    134232969
        0x08004fc4:    ffffb180    ....    DCD    4294947200
    $t
    i.mbedtls_ecp_is_zero
    mbedtls_ecp_is_zero
        0x08004fc8:    b510        ..      PUSH     {r4,lr}
        0x08004fca:    2100        .!      MOVS     r1,#0
        0x08004fcc:    3018        .0      ADDS     r0,r0,#0x18
        0x08004fce:    f000febb    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08004fd2:    b108        ..      CBZ      r0,0x8004fd8 ; mbedtls_ecp_is_zero + 16
        0x08004fd4:    2000        .       MOVS     r0,#0
        0x08004fd6:    bd10        ..      POP      {r4,pc}
        0x08004fd8:    2001        .       MOVS     r0,#1
        0x08004fda:    bd10        ..      POP      {r4,pc}
    i.mbedtls_ecp_keypair_free
    mbedtls_ecp_keypair_free
        0x08004fdc:    b510        ..      PUSH     {r4,lr}
        0x08004fde:    0004        ..      MOVS     r4,r0
        0x08004fe0:    d00b        ..      BEQ      0x8004ffa ; mbedtls_ecp_keypair_free + 30
        0x08004fe2:    f7fffe61    ..a.    BL       mbedtls_ecp_group_free ; 0x8004ca8
        0x08004fe6:    f104007c    ..|.    ADD      r0,r4,#0x7c
        0x08004fea:    f001f8fc    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08004fee:    f1040088    ....    ADD      r0,r4,#0x88
        0x08004ff2:    e8bd4010    ...@    POP      {r4,lr}
        0x08004ff6:    f000b8bf    ....    B.W      mbedtls_ecp_point_free ; 0x8005178
        0x08004ffa:    bd10        ..      POP      {r4,pc}
    i.mbedtls_ecp_keypair_init
    mbedtls_ecp_keypair_init
        0x08004ffc:    b510        ..      PUSH     {r4,lr}
        0x08004ffe:    4604        .F      MOV      r4,r0
        0x08005000:    f7fffe84    ....    BL       mbedtls_ecp_group_init ; 0x8004d0c
        0x08005004:    f104007c    ..|.    ADD      r0,r4,#0x7c
        0x08005008:    f001f9b6    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x0800500c:    f1040088    ....    ADD      r0,r4,#0x88
        0x08005010:    e8bd4010    ...@    POP      {r4,lr}
        0x08005014:    f000b8c0    ....    B.W      mbedtls_ecp_point_init ; 0x8005198
    i.mbedtls_ecp_mul_restartable
    mbedtls_ecp_mul_restartable
        0x08005018:    e92d4ffe    -..O    PUSH     {r1-r11,lr}
        0x0800501c:    468a        .F      MOV      r10,r1
        0x0800501e:    e9dd650c    ...e    LDRD     r6,r5,[sp,#0x30]
        0x08005022:    4698        .F      MOV      r8,r3
        0x08005024:    4691        .F      MOV      r9,r2
        0x08005026:    4683        .F      MOV      r11,r0
        0x08005028:    4c17        .L      LDR      r4,[pc,#92] ; [0x8005088] = 0xffffb080
        0x0800502a:    4611        .F      MOV      r1,r2
        0x0800502c:    9f0e        ..      LDR      r7,[sp,#0x38]
        0x0800502e:    f7fffda1    ....    BL       mbedtls_ecp_check_privkey ; 0x8004b74
        0x08005032:    0002        ..      MOVS     r2,r0
