openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08005034:    d124        $.      BNE      0x8005080 ; mbedtls_ecp_mul_restartable + 104
        0x08005036:    4641        AF      MOV      r1,r8
        0x08005038:    4658        XF      MOV      r0,r11
        0x0800503a:    f7fffdd9    ....    BL       mbedtls_ecp_check_pubkey ; 0x8004bf0
        0x0800503e:    0002        ..      MOVS     r2,r0
        0x08005040:    d11e        ..      BNE      0x8005080 ; mbedtls_ecp_mul_restartable + 104
        0x08005042:    4622        "F      MOV      r2,r4
        0x08005044:    4658        XF      MOV      r0,r11
        0x08005046:    f7fffe25    ..%.    BL       mbedtls_ecp_get_type ; 0x8004c94
        0x0800504a:    2802        .(      CMP      r0,#2
        0x0800504c:    d109        ..      BNE      0x8005062 ; mbedtls_ecp_mul_restartable + 74
        0x0800504e:    e9cd6500    ...e    STRD     r6,r5,[sp,#0]
        0x08005052:    4643        CF      MOV      r3,r8
        0x08005054:    464a        JF      MOV      r2,r9
        0x08005056:    4651        QF      MOV      r1,r10
        0x08005058:    4658        XF      MOV      r0,r11
        0x0800505a:    f7feff66    ..f.    BL       ecp_mul_mxz ; 0x8003f2a
        0x0800505e:    0002        ..      MOVS     r2,r0
        0x08005060:    d10e        ..      BNE      0x8005080 ; mbedtls_ecp_mul_restartable + 104
        0x08005062:    4658        XF      MOV      r0,r11
        0x08005064:    f7fffe16    ....    BL       mbedtls_ecp_get_type ; 0x8004c94
        0x08005068:    2801        .(      CMP      r0,#1
        0x0800506a:    d109        ..      BNE      0x8005080 ; mbedtls_ecp_mul_restartable + 104
        0x0800506c:    e9cd6500    ...e    STRD     r6,r5,[sp,#0]
        0x08005070:    4643        CF      MOV      r3,r8
        0x08005072:    464a        JF      MOV      r2,r9
        0x08005074:    4651        QF      MOV      r1,r10
        0x08005076:    4658        XF      MOV      r0,r11
        0x08005078:    9702        ..      STR      r7,[sp,#8]
        0x0800507a:    f7fefe69    ..i.    BL       ecp_mul_comb ; 0x8003d50
        0x0800507e:    4602        .F      MOV      r2,r0
        0x08005080:    4610        .F      MOV      r0,r2
        0x08005082:    e8bd8ffe    ....    POP      {r1-r11,pc}
    $d
        0x08005086:    0000        ..      DCW    0
        0x08005088:    ffffb080    ....    DCD    4294946944
    $t
    i.mbedtls_ecp_mul_shortcuts
    mbedtls_ecp_mul_shortcuts
        0x0800508c:    e92d43fe    -..C    PUSH     {r1-r9,lr}
        0x08005090:    460d        .F      MOV      r5,r1
        0x08005092:    4606        .F      MOV      r6,r0
        0x08005094:    461f        .F      MOV      r7,r3
        0x08005096:    4690        .F      MOV      r8,r2
        0x08005098:    2101        .!      MOVS     r1,#1
        0x0800509a:    4610        .F      MOV      r0,r2
        0x0800509c:    9c0a        ..      LDR      r4,[sp,#0x28]
        0x0800509e:    f000fe53    ..S.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080050a2:    b180        ..      CBZ      r0,0x80050c6 ; mbedtls_ecp_mul_shortcuts + 58
        0x080050a4:    f04f31ff    O..1    MOV      r1,#0xffffffff
        0x080050a8:    4640        @F      MOV      r0,r8
        0x080050aa:    f000fe4d    ..M.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080050ae:    b178        x.      CBZ      r0,0x80050d0 ; mbedtls_ecp_mul_shortcuts + 68
        0x080050b0:    2000        .       MOVS     r0,#0
        0x080050b2:    9000        ..      STR      r0,[sp,#0]
        0x080050b4:    e9cd0401    ....    STRD     r0,r4,[sp,#4]
        0x080050b8:    463b        ;F      MOV      r3,r7
        0x080050ba:    4642        BF      MOV      r2,r8
        0x080050bc:    4629        )F      MOV      r1,r5
        0x080050be:    4630        0F      MOV      r0,r6
        0x080050c0:    f7ffffaa    ....    BL       mbedtls_ecp_mul_restartable ; 0x8005018
        0x080050c4:    e016        ..      B        0x80050f4 ; mbedtls_ecp_mul_shortcuts + 104
        0x080050c6:    4639        9F      MOV      r1,r7
        0x080050c8:    4628        (F      MOV      r0,r5
        0x080050ca:    f7fffdbd    ....    BL       mbedtls_ecp_copy ; 0x8004c48
        0x080050ce:    e011        ..      B        0x80050f4 ; mbedtls_ecp_mul_shortcuts + 104
        0x080050d0:    4639        9F      MOV      r1,r7
        0x080050d2:    4628        (F      MOV      r0,r5
        0x080050d4:    f7fffdb8    ....    BL       mbedtls_ecp_copy ; 0x8004c48
        0x080050d8:    0004        ..      MOVS     r4,r0
        0x080050da:    d10c        ..      BNE      0x80050f6 ; mbedtls_ecp_mul_shortcuts + 106
        0x080050dc:    f105000c    ....    ADD      r0,r5,#0xc
        0x080050e0:    2100        .!      MOVS     r1,#0
        0x080050e2:    4605        .F      MOV      r5,r0
        0x080050e4:    f000fe30    ..0.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080050e8:    b128        (.      CBZ      r0,0x80050f6 ; mbedtls_ecp_mul_shortcuts + 106
        0x080050ea:    462a        *F      MOV      r2,r5
        0x080050ec:    1d31        1.      ADDS     r1,r6,#4
        0x080050ee:    4610        .F      MOV      r0,r2
        0x080050f0:    f001fe04    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x080050f4:    4604        .F      MOV      r4,r0
        0x080050f6:    4620         F      MOV      r0,r4
        0x080050f8:    e8bd83fe    ....    POP      {r1-r9,pc}
    i.mbedtls_ecp_muladd_restartable
    mbedtls_ecp_muladd_restartable
        0x080050fc:    e92d4ff0    -..O    PUSH     {r4-r11,lr}
        0x08005100:    b08b        ..      SUB      sp,sp,#0x2c
        0x08005102:    461c        .F      MOV      r4,r3
        0x08005104:    e9dd9715    ....    LDRD     r9,r7,[sp,#0x54]
        0x08005108:    4690        .F      MOV      r8,r2
        0x0800510a:    4683        .F      MOV      r11,r0
        0x0800510c:    ae01        ..      ADD      r6,sp,#4
        0x0800510e:    460d        .F      MOV      r5,r1
        0x08005110:    f8dda050    ..P.    LDR      r10,[sp,#0x50]
        0x08005114:    f7fffdbe    ....    BL       mbedtls_ecp_get_type ; 0x8004c94
        0x08005118:    2801        .(      CMP      r0,#1
        0x0800511a:    d003        ..      BEQ      0x8005124 ; mbedtls_ecp_muladd_restartable + 40
        0x0800511c:    4815        .H      LDR      r0,[pc,#84] ; [0x8005174] = 0xffffb180
        0x0800511e:    b00b        ..      ADD      sp,sp,#0x2c
        0x08005120:    e8bd8ff0    ....    POP      {r4-r11,pc}
        0x08005124:    a801        ..      ADD      r0,sp,#4
        0x08005126:    f000f837    ..7.    BL       mbedtls_ecp_point_init ; 0x8005198
        0x0800512a:    4623        #F      MOV      r3,r4
        0x0800512c:    4642        BF      MOV      r2,r8
        0x0800512e:    4631        1F      MOV      r1,r6
        0x08005130:    4658        XF      MOV      r0,r11
        0x08005132:    9700        ..      STR      r7,[sp,#0]
        0x08005134:    f7ffffaa    ....    BL       mbedtls_ecp_mul_shortcuts ; 0x800508c
        0x08005138:    0004        ..      MOVS     r4,r0
        0x0800513a:    d115        ..      BNE      0x8005168 ; mbedtls_ecp_muladd_restartable + 108
        0x0800513c:    464b        KF      MOV      r3,r9
        0x0800513e:    4652        RF      MOV      r2,r10
        0x08005140:    4629        )F      MOV      r1,r5
        0x08005142:    4658        XF      MOV      r0,r11
        0x08005144:    9700        ..      STR      r7,[sp,#0]
        0x08005146:    f7ffffa1    ....    BL       mbedtls_ecp_mul_shortcuts ; 0x800508c
        0x0800514a:    0004        ..      MOVS     r4,r0
        0x0800514c:    d10c        ..      BNE      0x8005168 ; mbedtls_ecp_muladd_restartable + 108
        0x0800514e:    462b        +F      MOV      r3,r5
        0x08005150:    4632        2F      MOV      r2,r6
        0x08005152:    4619        .F      MOV      r1,r3
        0x08005154:    4658        XF      MOV      r0,r11
        0x08005156:    f7fcffb9    ....    BL       ecp_add_mixed ; 0x80020cc
        0x0800515a:    0004        ..      MOVS     r4,r0
        0x0800515c:    d104        ..      BNE      0x8005168 ; mbedtls_ecp_muladd_restartable + 108
        0x0800515e:    4629        )F      MOV      r1,r5
        0x08005160:    4658        XF      MOV      r0,r11
        0x08005162:    f7feff7e    ..~.    BL       ecp_normalize_jac ; 0x8004062
        0x08005166:    4604        .F      MOV      r4,r0
        0x08005168:    a801        ..      ADD      r0,sp,#4
        0x0800516a:    f000f805    ....    BL       mbedtls_ecp_point_free ; 0x8005178
        0x0800516e:    4620         F      MOV      r0,r4
        0x08005170:    e7d5        ..      B        0x800511e ; mbedtls_ecp_muladd_restartable + 34
    $d
        0x08005172:    0000        ..      DCW    0
        0x08005174:    ffffb180    ....    DCD    4294947200
    $t
    i.mbedtls_ecp_point_free
    mbedtls_ecp_point_free
        0x08005178:    b510        ..      PUSH     {r4,lr}
        0x0800517a:    0004        ..      MOVS     r4,r0
        0x0800517c:    d00b        ..      BEQ      0x8005196 ; mbedtls_ecp_point_free + 30
        0x0800517e:    f001f832    ..2.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08005182:    f104000c    ....    ADD      r0,r4,#0xc
        0x08005186:    f001f82e    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x0800518a:    f1040018    ....    ADD      r0,r4,#0x18
        0x0800518e:    e8bd4010    ...@    POP      {r4,lr}
        0x08005192:    f001b828    ..(.    B.W      mbedtls_mpi_free ; 0x80061e6
        0x08005196:    bd10        ..      POP      {r4,pc}
    i.mbedtls_ecp_point_init
    mbedtls_ecp_point_init
        0x08005198:    b510        ..      PUSH     {r4,lr}
        0x0800519a:    4604        .F      MOV      r4,r0
        0x0800519c:    f001f8ec    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x080051a0:    f104000c    ....    ADD      r0,r4,#0xc
        0x080051a4:    f001f8e8    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x080051a8:    f1040018    ....    ADD      r0,r4,#0x18
        0x080051ac:    e8bd4010    ...@    POP      {r4,lr}
        0x080051b0:    f001b8e2    ....    B.W      mbedtls_mpi_init ; 0x8006378
    i.mbedtls_ecp_point_read_binary
    mbedtls_ecp_point_read_binary
        0x080051b4:    e92d5ffc    -.._    PUSH     {r2-r12,lr}
        0x080051b8:    f8df90dc    ....    LDR      r9,[pc,#220] ; [0x8005298] = 0xffffb180
        0x080051bc:    f8dfa0dc    ....    LDR      r10,[pc,#220] ; [0x800529c] = 0xffffb080
        0x080051c0:    001e        ..      MOVS     r6,r3
        0x080051c2:    4617        .F      MOV      r7,r2
        0x080051c4:    460c        .F      MOV      r4,r1
        0x080051c6:    4680        .F      MOV      r8,r0
        0x080051c8:    46cb        .F      MOV      r11,r9
        0x080051ca:    d04a        J.      BEQ      0x8005262 ; mbedtls_ecp_point_read_binary + 174
        0x080051cc:    f1080004    ....    ADD      r0,r8,#4
        0x080051d0:    f001fd3f    ..?.    BL       mbedtls_mpi_size ; 0x8006c52
        0x080051d4:    4605        .F      MOV      r5,r0
        0x080051d6:    4640        @F      MOV      r0,r8
        0x080051d8:    f7fffd5c    ..\.    BL       mbedtls_ecp_get_type ; 0x8004c94
        0x080051dc:    4601        .F      MOV      r1,r0
        0x080051de:    f104000c    ....    ADD      r0,r4,#0xc
        0x080051e2:    9001        ..      STR      r0,[sp,#4]
        0x080051e4:    300c        .0      ADDS     r0,r0,#0xc
        0x080051e6:    9000        ..      STR      r0,[sp,#0]
        0x080051e8:    2902        .)      CMP      r1,#2
        0x080051ea:    d122        ".      BNE      0x8005232 ; mbedtls_ecp_point_read_binary + 126
        0x080051ec:    42b5        .B      CMP      r5,r6
        0x080051ee:    d138        8.      BNE      0x8005262 ; mbedtls_ecp_point_read_binary + 174
        0x080051f0:    462a        *F      MOV      r2,r5
        0x080051f2:    4639        9F      MOV      r1,r7
        0x080051f4:    4620         F      MOV      r0,r4
        0x080051f6:    f001fafd    ....    BL       mbedtls_mpi_read_binary_le ; 0x80067f4
        0x080051fa:    ea5f0b00    _...    MOVS     r11,r0
        0x080051fe:    d148        H.      BNE      0x8005292 ; mbedtls_ecp_point_read_binary + 222
        0x08005200:    9801        ..      LDR      r0,[sp,#4]
        0x08005202:    f000fff0    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08005206:    f8980000    ....    LDRB     r0,[r8,#0]
        0x0800520a:    2809        .(      CMP      r0,#9
        0x0800520c:    d10a        ..      BNE      0x8005224 ; mbedtls_ecp_point_read_binary + 112
        0x0800520e:    f04f30ff    O..0    MOV      r0,#0xffffffff
        0x08005212:    eb0001c5    ....    ADD      r1,r0,r5,LSL #3
        0x08005216:    2200        ."      MOVS     r2,#0
        0x08005218:    4620         F      MOV      r0,r4
        0x0800521a:    f001fc28    ..(.    BL       mbedtls_mpi_set_bit ; 0x8006a6e
        0x0800521e:    ea5f0b00    _...    MOVS     r11,r0
        0x08005222:    d136        6.      BNE      0x8005292 ; mbedtls_ecp_point_read_binary + 222
        0x08005224:    2101        .!      MOVS     r1,#1
        0x08005226:    9800        ..      LDR      r0,[sp,#0]
        0x08005228:    f001f9f8    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x0800522c:    ea5f0b00    _...    MOVS     r11,r0
        0x08005230:    d12f        /.      BNE      0x8005292 ; mbedtls_ecp_point_read_binary + 222
        0x08005232:    4640        @F      MOV      r0,r8
        0x08005234:    f7fffd2e    ....    BL       mbedtls_ecp_get_type ; 0x8004c94
        0x08005238:    2801        .(      CMP      r0,#1
        0x0800523a:    d12a        *.      BNE      0x8005292 ; mbedtls_ecp_point_read_binary + 222
        0x0800523c:    7838        8x      LDRB     r0,[r7,#0]
        0x0800523e:    b120         .      CBZ      r0,0x800524a ; mbedtls_ecp_point_read_binary + 150
        0x08005240:    2804        .(      CMP      r0,#4
        0x08005242:    d009        ..      BEQ      0x8005258 ; mbedtls_ecp_point_read_binary + 164
        0x08005244:    4648        HF      MOV      r0,r9
        0x08005246:    e8bd9ffc    ....    POP      {r2-r12,pc}
        0x0800524a:    2e01        ..      CMP      r6,#1
        0x0800524c:    d109        ..      BNE      0x8005262 ; mbedtls_ecp_point_read_binary + 174
        0x0800524e:    4620         F      MOV      r0,r4
        0x08005250:    e8bd5ffc    ..._    POP      {r2-r12,lr}
        0x08005254:    f000b824    ..$.    B.W      mbedtls_ecp_set_zero ; 0x80052a0
        0x08005258:    2001        .       MOVS     r0,#1
        0x0800525a:    eb000045    ..E.    ADD      r0,r0,r5,LSL #1
        0x0800525e:    42b0        .B      CMP      r0,r6
        0x08005260:    d001        ..      BEQ      0x8005266 ; mbedtls_ecp_point_read_binary + 178
        0x08005262:    4650        PF      MOV      r0,r10
        0x08005264:    e7ef        ..      B        0x8005246 ; mbedtls_ecp_point_read_binary + 146
        0x08005266:    462a        *F      MOV      r2,r5
        0x08005268:    1c79        y.      ADDS     r1,r7,#1
        0x0800526a:    4620         F      MOV      r0,r4
        0x0800526c:    f001fa91    ....    BL       mbedtls_mpi_read_binary ; 0x8006792
        0x08005270:    ea5f0b00    _...    MOVS     r11,r0
        0x08005274:    d10d        ..      BNE      0x8005292 ; mbedtls_ecp_point_read_binary + 222
        0x08005276:    1979        y.      ADDS     r1,r7,r5
        0x08005278:    462a        *F      MOV      r2,r5
        0x0800527a:    1c49        I.      ADDS     r1,r1,#1
        0x0800527c:    9801        ..      LDR      r0,[sp,#4]
        0x0800527e:    f001fa88    ....    BL       mbedtls_mpi_read_binary ; 0x8006792
        0x08005282:    ea5f0b00    _...    MOVS     r11,r0
        0x08005286:    d104        ..      BNE      0x8005292 ; mbedtls_ecp_point_read_binary + 222
        0x08005288:    2101        .!      MOVS     r1,#1
        0x0800528a:    9800        ..      LDR      r0,[sp,#0]
        0x0800528c:    f001f9c6    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x08005290:    4683        .F      MOV      r11,r0
        0x08005292:    4658        XF      MOV      r0,r11
        0x08005294:    e7d7        ..      B        0x8005246 ; mbedtls_ecp_point_read_binary + 146
    $d
        0x08005296:    0000        ..      DCW    0
        0x08005298:    ffffb180    ....    DCD    4294947200
        0x0800529c:    ffffb080    ....    DCD    4294946944
    $t
    i.mbedtls_ecp_set_zero
    mbedtls_ecp_set_zero
        0x080052a0:    b510        ..      PUSH     {r4,lr}
        0x080052a2:    4604        .F      MOV      r4,r0
        0x080052a4:    2101        .!      MOVS     r1,#1
        0x080052a6:    f001f9b9    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x080052aa:    2800        .(      CMP      r0,#0
        0x080052ac:    d10d        ..      BNE      0x80052ca ; mbedtls_ecp_set_zero + 42
        0x080052ae:    2101        .!      MOVS     r1,#1
        0x080052b0:    f104000c    ....    ADD      r0,r4,#0xc
        0x080052b4:    f001f9b2    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x080052b8:    2800        .(      CMP      r0,#0
        0x080052ba:    d106        ..      BNE      0x80052ca ; mbedtls_ecp_set_zero + 42
        0x080052bc:    f1040018    ....    ADD      r0,r4,#0x18
        0x080052c0:    e8bd4010    ...@    POP      {r4,lr}
        0x080052c4:    2100        .!      MOVS     r1,#0
        0x080052c6:    f001b9a9    ....    B.W      mbedtls_mpi_lset ; 0x800661c
        0x080052ca:    bd10        ..      POP      {r4,pc}
    i.mbedtls_ecp_tls_read_group
    mbedtls_ecp_tls_read_group
        0x080052cc:    b538        8.      PUSH     {r3-r5,lr}
        0x080052ce:    4604        .F      MOV      r4,r0
        0x080052d0:    4668        hF      MOV      r0,sp
        0x080052d2:    f000f809    ....    BL       mbedtls_ecp_tls_read_group_id ; 0x80052e8
        0x080052d6:    2800        .(      CMP      r0,#0
        0x080052d8:    d104        ..      BNE      0x80052e4 ; mbedtls_ecp_tls_read_group + 24
        0x080052da:    f89d1000    ....    LDRB     r1,[sp,#0]
        0x080052de:    4620         F      MOV      r0,r4
        0x080052e0:    f7fffd36    ..6.    BL       mbedtls_ecp_group_load ; 0x8004d50
        0x080052e4:    bd38        8.      POP      {r3-r5,pc}
        0x080052e6:    0000        ..      MOVS     r0,r0
    i.mbedtls_ecp_tls_read_group_id
    mbedtls_ecp_tls_read_group_id
        0x080052e8:    b530        0.      PUSH     {r4,r5,lr}
        0x080052ea:    4d10        .M      LDR      r5,[pc,#64] ; [0x800532c] = 0xffffb080
        0x080052ec:    4604        .F      MOV      r4,r0
        0x080052ee:    2a03        .*      CMP      r2,#3
        0x080052f0:    d305        ..      BCC      0x80052fe ; mbedtls_ecp_tls_read_group_id + 22
        0x080052f2:    6808        .h      LDR      r0,[r1,#0]
        0x080052f4:    1c43        C.      ADDS     r3,r0,#1
        0x080052f6:    600b        .`      STR      r3,[r1,#0]
        0x080052f8:    7800        .x      LDRB     r0,[r0,#0]
        0x080052fa:    2803        .(      CMP      r0,#3
        0x080052fc:    d001        ..      BEQ      0x8005302 ; mbedtls_ecp_tls_read_group_id + 26
        0x080052fe:    4628        (F      MOV      r0,r5
        0x08005300:    bd30        0.      POP      {r4,r5,pc}
        0x08005302:    1c5a        Z.      ADDS     r2,r3,#1
        0x08005304:    600a        .`      STR      r2,[r1,#0]
        0x08005306:    7818        .x      LDRB     r0,[r3,#0]
        0x08005308:    f64f73ff    O..s    MOV      r3,#0xffff
        0x0800530c:    ea032000    ...     AND      r0,r3,r0,LSL #8
        0x08005310:    1c53        S.      ADDS     r3,r2,#1
        0x08005312:    600b        .`      STR      r3,[r1,#0]
        0x08005314:    7811        .x      LDRB     r1,[r2,#0]
        0x08005316:    4308        .C      ORRS     r0,r0,r1
        0x08005318:    f7fffcae    ....    BL       mbedtls_ecp_curve_info_from_tls_id ; 0x8004c78
        0x0800531c:    b118        ..      CBZ      r0,0x8005326 ; mbedtls_ecp_tls_read_group_id + 62
        0x0800531e:    7800        .x      LDRB     r0,[r0,#0]
        0x08005320:    7020         p      STRB     r0,[r4,#0]
        0x08005322:    2000        .       MOVS     r0,#0
        0x08005324:    bd30        0.      POP      {r4,r5,pc}
        0x08005326:    4802        .H      LDR      r0,[pc,#8] ; [0x8005330] = 0xffffb180
        0x08005328:    bd30        0.      POP      {r4,r5,pc}
    $d
        0x0800532a:    0000        ..      DCW    0
        0x0800532c:    ffffb080    ....    DCD    4294946944
        0x08005330:    ffffb180    ....    DCD    4294947200
    $t
    i.mbedtls_internal_sha256_process
    mbedtls_internal_sha256_process
        0x08005334:    e92d4ff0    -..O    PUSH     {r4-r11,lr}
        0x08005338:    4686        .F      MOV      lr,r0
        0x0800533a:    b0c8        ..      SUB      sp,sp,#0x120
        0x0800533c:    f05f0000    _...    MOVS.W   r0,#0
        0x08005340:    eb0e0380    ....    ADD      r3,lr,r0,LSL #2
        0x08005344:    689b        .h      LDR      r3,[r3,#8]
        0x08005346:    f84d3020    M. 0    STR      r3,[sp,r0,LSL #2]
        0x0800534a:    1c40        @.      ADDS     r0,r0,#1
        0x0800534c:    2808        .(      CMP      r0,#8
        0x0800534e:    d3f7        ..      BCC      0x8005340 ; mbedtls_internal_sha256_process + 12
        0x08005350:    2000        .       MOVS     r0,#0
        0x08005352:    ac08        ..      ADD      r4,sp,#0x20
        0x08005354:    eb010280    ....    ADD      r2,r1,r0,LSL #2
        0x08005358:    6813        .h      LDR      r3,[r2,#0]
        0x0800535a:    78d2        .x      LDRB     r2,[r2,#3]
        0x0800535c:    ba1b        ..      REV      r3,r3
        0x0800535e:    f02303ff    #...    BIC      r3,r3,#0xff
        0x08005362:    4313        .C      ORRS     r3,r3,r2
        0x08005364:    f8443020    D. 0    STR      r3,[r4,r0,LSL #2]
        0x08005368:    1c40        @.      ADDS     r0,r0,#1
        0x0800536a:    2810        .(      CMP      r0,#0x10
        0x0800536c:    d3f2        ..      BCC      0x8005354 ; mbedtls_internal_sha256_process + 32
        0x0800536e:    4bff        .K      LDR      r3,[pc,#1020] ; [0x800576c] = 0x8007ec4
        0x08005370:    2000        .       MOVS     r0,#0
        0x08005372:    9904        ..      LDR      r1,[sp,#0x10]
        0x08005374:    9a04        ..      LDR      r2,[sp,#0x10]
        0x08005376:    ea4f11b1    O...    ROR      r1,r1,#6
        0x0800537a:    ea8121f2    ...!    EOR      r1,r1,r2,ROR #11
        0x0800537e:    ea816272    ..rb    EOR      r2,r1,r2,ROR #25
        0x08005382:    e9dd1505    ....    LDRD     r1,r5,[sp,#0x14]
        0x08005386:    4069        i@      EORS     r1,r1,r5
        0x08005388:    9d04        ..      LDR      r5,[sp,#0x10]
        0x0800538a:    9f00        ..      LDR      r7,[sp,#0]
        0x0800538c:    4029        )@      ANDS     r1,r1,r5
        0x0800538e:    9d06        ..      LDR      r5,[sp,#0x18]
        0x08005390:    f8ddc000    ....    LDR      r12,[sp,#0]
        0x08005394:    4069        i@      EORS     r1,r1,r5
        0x08005396:    440a        .D      ADD      r2,r2,r1
