openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08005398:    f8535020    S. P    LDR      r5,[r3,r0,LSL #2]
        0x0800539c:    9907        ..      LDR      r1,[sp,#0x1c]
        0x0800539e:    4429        )D      ADD      r1,r1,r5
        0x080053a0:    4411        .D      ADD      r1,r1,r2
        0x080053a2:    f8542020    T.      LDR      r2,[r4,r0,LSL #2]
        0x080053a6:    4411        .D      ADD      r1,r1,r2
        0x080053a8:    e9dd2500    ...%    LDRD     r2,r5,[sp,#0]
        0x080053ac:    402a        *@      ANDS     r2,r2,r5
        0x080053ae:    e9dd5600    ...V    LDRD     r5,r6,[sp,#0]
        0x080053b2:    4335        5C      ORRS     r5,r5,r6
        0x080053b4:    9e02        ..      LDR      r6,[sp,#8]
        0x080053b6:    4035        5@      ANDS     r5,r5,r6
        0x080053b8:    432a        *C      ORRS     r2,r2,r5
        0x080053ba:    9d00        ..      LDR      r5,[sp,#0]
        0x080053bc:    9e00        ..      LDR      r6,[sp,#0]
        0x080053be:    ea4f05b5    O...    ROR      r5,r5,#2
        0x080053c2:    ea853576    ..v5    EOR      r5,r5,r6,ROR #13
        0x080053c6:    ea8555b6    ...U    EOR      r5,r5,r6,ROR #22
        0x080053ca:    442a        *D      ADD      r2,r2,r5
        0x080053cc:    9d03        ..      LDR      r5,[sp,#0xc]
        0x080053ce:    440d        .D      ADD      r5,r5,r1
        0x080053d0:    4411        .D      ADD      r1,r1,r2
        0x080053d2:    9107        ..      STR      r1,[sp,#0x1c]
        0x080053d4:    ea4f11b5    O...    ROR      r1,r5,#6
        0x080053d8:    ea8121f5    ...!    EOR      r1,r1,r5,ROR #11
        0x080053dc:    9503        ..      STR      r5,[sp,#0xc]
        0x080053de:    ea816275    ..ub    EOR      r2,r1,r5,ROR #25
        0x080053e2:    e9dd1504    ....    LDRD     r1,r5,[sp,#0x10]
        0x080053e6:    4069        i@      EORS     r1,r1,r5
        0x080053e8:    9d03        ..      LDR      r5,[sp,#0xc]
        0x080053ea:    4029        )@      ANDS     r1,r1,r5
        0x080053ec:    9d05        ..      LDR      r5,[sp,#0x14]
        0x080053ee:    4069        i@      EORS     r1,r1,r5
        0x080053f0:    4411        .D      ADD      r1,r1,r2
        0x080053f2:    eb030280    ....    ADD      r2,r3,r0,LSL #2
        0x080053f6:    9d06        ..      LDR      r5,[sp,#0x18]
        0x080053f8:    6856        Vh      LDR      r6,[r2,#4]
        0x080053fa:    4435        5D      ADD      r5,r5,r6
        0x080053fc:    440d        .D      ADD      r5,r5,r1
        0x080053fe:    eb040180    ....    ADD      r1,r4,r0,LSL #2
        0x08005402:    684e        Nh      LDR      r6,[r1,#4]
        0x08005404:    4435        5D      ADD      r5,r5,r6
        0x08005406:    9e07        ..      LDR      r6,[sp,#0x1c]
        0x08005408:    403e        >@      ANDS     r6,r6,r7
        0x0800540a:    9f07        ..      LDR      r7,[sp,#0x1c]
        0x0800540c:    ea47070c    G...    ORR      r7,r7,r12
        0x08005410:    f8ddc004    ....    LDR      r12,[sp,#4]
        0x08005414:    ea07070c    ....    AND      r7,r7,r12
        0x08005418:    433e        >C      ORRS     r6,r6,r7
        0x0800541a:    9f07        ..      LDR      r7,[sp,#0x1c]
        0x0800541c:    f8ddc01c    ....    LDR      r12,[sp,#0x1c]
        0x08005420:    ea4f07b7    O...    ROR      r7,r7,#2
        0x08005424:    ea87377c    ..|7    EOR      r7,r7,r12,ROR #13
        0x08005428:    ea8757bc    ...W    EOR      r7,r7,r12,ROR #22
        0x0800542c:    443e        >D      ADD      r6,r6,r7
        0x0800542e:    9f02        ..      LDR      r7,[sp,#8]
        0x08005430:    442f        /D      ADD      r7,r7,r5
        0x08005432:    4435        5D      ADD      r5,r5,r6
        0x08005434:    9506        ..      STR      r5,[sp,#0x18]
        0x08005436:    9702        ..      STR      r7,[sp,#8]
        0x08005438:    ea4f15b7    O...    ROR      r5,r7,#6
        0x0800543c:    ea8525f7    ...%    EOR      r5,r5,r7,ROR #11
        0x08005440:    ea856677    ..wf    EOR      r6,r5,r7,ROR #25
        0x08005444:    e9dd5703    ...W    LDRD     r5,r7,[sp,#0xc]
        0x08005448:    407d        }@      EORS     r5,r5,r7
        0x0800544a:    9f02        ..      LDR      r7,[sp,#8]
        0x0800544c:    403d        =@      ANDS     r5,r5,r7
        0x0800544e:    9f04        ..      LDR      r7,[sp,#0x10]
        0x08005450:    407d        }@      EORS     r5,r5,r7
        0x08005452:    4435        5D      ADD      r5,r5,r6
        0x08005454:    9e05        ..      LDR      r6,[sp,#0x14]
        0x08005456:    6897        .h      LDR      r7,[r2,#8]
        0x08005458:    443e        >D      ADD      r6,r6,r7
        0x0800545a:    4435        5D      ADD      r5,r5,r6
        0x0800545c:    688e        .h      LDR      r6,[r1,#8]
        0x0800545e:    9f06        ..      LDR      r7,[sp,#0x18]
        0x08005460:    4435        5D      ADD      r5,r5,r6
        0x08005462:    9e06        ..      LDR      r6,[sp,#0x18]
        0x08005464:    ea47070c    G...    ORR      r7,r7,r12
        0x08005468:    ea06060c    ....    AND      r6,r6,r12
        0x0800546c:    f8ddc000    ....    LDR      r12,[sp,#0]
        0x08005470:    ea07070c    ....    AND      r7,r7,r12
        0x08005474:    433e        >C      ORRS     r6,r6,r7
        0x08005476:    9f06        ..      LDR      r7,[sp,#0x18]
        0x08005478:    f8ddc018    ....    LDR      r12,[sp,#0x18]
        0x0800547c:    ea4f07b7    O...    ROR      r7,r7,#2
        0x08005480:    ea87377c    ..|7    EOR      r7,r7,r12,ROR #13
        0x08005484:    ea8757bc    ...W    EOR      r7,r7,r12,ROR #22
        0x08005488:    443e        >D      ADD      r6,r6,r7
        0x0800548a:    9f01        ..      LDR      r7,[sp,#4]
        0x0800548c:    442f        /D      ADD      r7,r7,r5
        0x0800548e:    4435        5D      ADD      r5,r5,r6
        0x08005490:    9505        ..      STR      r5,[sp,#0x14]
        0x08005492:    ea4f15b7    O...    ROR      r5,r7,#6
        0x08005496:    ea8525f7    ...%    EOR      r5,r5,r7,ROR #11
        0x0800549a:    9701        ..      STR      r7,[sp,#4]
        0x0800549c:    ea856677    ..wf    EOR      r6,r5,r7,ROR #25
        0x080054a0:    e9dd5702    ...W    LDRD     r5,r7,[sp,#8]
        0x080054a4:    407d        }@      EORS     r5,r5,r7
        0x080054a6:    9f01        ..      LDR      r7,[sp,#4]
        0x080054a8:    403d        =@      ANDS     r5,r5,r7
        0x080054aa:    9f03        ..      LDR      r7,[sp,#0xc]
        0x080054ac:    407d        }@      EORS     r5,r5,r7
        0x080054ae:    4435        5D      ADD      r5,r5,r6
        0x080054b0:    9e04        ..      LDR      r6,[sp,#0x10]
        0x080054b2:    68d7        .h      LDR      r7,[r2,#0xc]
        0x080054b4:    443e        >D      ADD      r6,r6,r7
        0x080054b6:    4435        5D      ADD      r5,r5,r6
        0x080054b8:    68ce        .h      LDR      r6,[r1,#0xc]
        0x080054ba:    9f05        ..      LDR      r7,[sp,#0x14]
        0x080054bc:    4435        5D      ADD      r5,r5,r6
        0x080054be:    9e05        ..      LDR      r6,[sp,#0x14]
        0x080054c0:    ea47070c    G...    ORR      r7,r7,r12
        0x080054c4:    ea06060c    ....    AND      r6,r6,r12
        0x080054c8:    f8ddc01c    ....    LDR      r12,[sp,#0x1c]
        0x080054cc:    ea07070c    ....    AND      r7,r7,r12
        0x080054d0:    433e        >C      ORRS     r6,r6,r7
        0x080054d2:    9f05        ..      LDR      r7,[sp,#0x14]
        0x080054d4:    f8ddc014    ....    LDR      r12,[sp,#0x14]
        0x080054d8:    ea4f07b7    O...    ROR      r7,r7,#2
        0x080054dc:    ea87377c    ..|7    EOR      r7,r7,r12,ROR #13
        0x080054e0:    ea8757bc    ...W    EOR      r7,r7,r12,ROR #22
        0x080054e4:    443e        >D      ADD      r6,r6,r7
        0x080054e6:    9f00        ..      LDR      r7,[sp,#0]
        0x080054e8:    442f        /D      ADD      r7,r7,r5
        0x080054ea:    4435        5D      ADD      r5,r5,r6
        0x080054ec:    9504        ..      STR      r5,[sp,#0x10]
        0x080054ee:    ea4f15b7    O...    ROR      r5,r7,#6
        0x080054f2:    ea8525f7    ...%    EOR      r5,r5,r7,ROR #11
        0x080054f6:    9700        ..      STR      r7,[sp,#0]
        0x080054f8:    ea856677    ..wf    EOR      r6,r5,r7,ROR #25
        0x080054fc:    e9dd5701    ...W    LDRD     r5,r7,[sp,#4]
        0x08005500:    407d        }@      EORS     r5,r5,r7
        0x08005502:    9f00        ..      LDR      r7,[sp,#0]
        0x08005504:    403d        =@      ANDS     r5,r5,r7
        0x08005506:    9f02        ..      LDR      r7,[sp,#8]
        0x08005508:    407d        }@      EORS     r5,r5,r7
        0x0800550a:    4435        5D      ADD      r5,r5,r6
        0x0800550c:    9e03        ..      LDR      r6,[sp,#0xc]
        0x0800550e:    6917        .i      LDR      r7,[r2,#0x10]
        0x08005510:    443e        >D      ADD      r6,r6,r7
        0x08005512:    4435        5D      ADD      r5,r5,r6
        0x08005514:    690e        .i      LDR      r6,[r1,#0x10]
        0x08005516:    9f04        ..      LDR      r7,[sp,#0x10]
        0x08005518:    4435        5D      ADD      r5,r5,r6
        0x0800551a:    9e04        ..      LDR      r6,[sp,#0x10]
        0x0800551c:    ea47070c    G...    ORR      r7,r7,r12
        0x08005520:    ea06060c    ....    AND      r6,r6,r12
        0x08005524:    f8ddc018    ....    LDR      r12,[sp,#0x18]
        0x08005528:    ea07070c    ....    AND      r7,r7,r12
        0x0800552c:    433e        >C      ORRS     r6,r6,r7
        0x0800552e:    9f04        ..      LDR      r7,[sp,#0x10]
        0x08005530:    f8ddc010    ....    LDR      r12,[sp,#0x10]
        0x08005534:    ea4f07b7    O...    ROR      r7,r7,#2
        0x08005538:    ea87377c    ..|7    EOR      r7,r7,r12,ROR #13
        0x0800553c:    ea8757bc    ...W    EOR      r7,r7,r12,ROR #22
        0x08005540:    443e        >D      ADD      r6,r6,r7
        0x08005542:    9f07        ..      LDR      r7,[sp,#0x1c]
        0x08005544:    442f        /D      ADD      r7,r7,r5
        0x08005546:    4435        5D      ADD      r5,r5,r6
        0x08005548:    9503        ..      STR      r5,[sp,#0xc]
        0x0800554a:    ea4f15b7    O...    ROR      r5,r7,#6
        0x0800554e:    ea8525f7    ...%    EOR      r5,r5,r7,ROR #11
        0x08005552:    9707        ..      STR      r7,[sp,#0x1c]
        0x08005554:    ea856677    ..wf    EOR      r6,r5,r7,ROR #25
        0x08005558:    e9dd5700    ...W    LDRD     r5,r7,[sp,#0]
        0x0800555c:    407d        }@      EORS     r5,r5,r7
        0x0800555e:    9f07        ..      LDR      r7,[sp,#0x1c]
        0x08005560:    403d        =@      ANDS     r5,r5,r7
        0x08005562:    9f01        ..      LDR      r7,[sp,#4]
        0x08005564:    407d        }@      EORS     r5,r5,r7
        0x08005566:    4435        5D      ADD      r5,r5,r6
        0x08005568:    9e02        ..      LDR      r6,[sp,#8]
        0x0800556a:    6957        Wi      LDR      r7,[r2,#0x14]
        0x0800556c:    443e        >D      ADD      r6,r6,r7
        0x0800556e:    4435        5D      ADD      r5,r5,r6
        0x08005570:    694e        Ni      LDR      r6,[r1,#0x14]
        0x08005572:    9f03        ..      LDR      r7,[sp,#0xc]
        0x08005574:    4435        5D      ADD      r5,r5,r6
        0x08005576:    9e03        ..      LDR      r6,[sp,#0xc]
        0x08005578:    ea47070c    G...    ORR      r7,r7,r12
        0x0800557c:    ea06060c    ....    AND      r6,r6,r12
        0x08005580:    f8ddc014    ....    LDR      r12,[sp,#0x14]
        0x08005584:    ea07070c    ....    AND      r7,r7,r12
        0x08005588:    433e        >C      ORRS     r6,r6,r7
        0x0800558a:    9f03        ..      LDR      r7,[sp,#0xc]
        0x0800558c:    f8ddc00c    ....    LDR      r12,[sp,#0xc]
        0x08005590:    ea4f07b7    O...    ROR      r7,r7,#2
        0x08005594:    ea87377c    ..|7    EOR      r7,r7,r12,ROR #13
        0x08005598:    ea8757bc    ...W    EOR      r7,r7,r12,ROR #22
        0x0800559c:    443e        >D      ADD      r6,r6,r7
        0x0800559e:    9f06        ..      LDR      r7,[sp,#0x18]
        0x080055a0:    442f        /D      ADD      r7,r7,r5
        0x080055a2:    4435        5D      ADD      r5,r5,r6
        0x080055a4:    9502        ..      STR      r5,[sp,#8]
        0x080055a6:    ea4f15b7    O...    ROR      r5,r7,#6
        0x080055aa:    ea8525f7    ...%    EOR      r5,r5,r7,ROR #11
        0x080055ae:    ea856677    ..wf    EOR      r6,r5,r7,ROR #25
        0x080055b2:    9706        ..      STR      r7,[sp,#0x18]
        0x080055b4:    9f00        ..      LDR      r7,[sp,#0]
        0x080055b6:    9d07        ..      LDR      r5,[sp,#0x1c]
        0x080055b8:    407d        }@      EORS     r5,r5,r7
        0x080055ba:    9f06        ..      LDR      r7,[sp,#0x18]
        0x080055bc:    403d        =@      ANDS     r5,r5,r7
        0x080055be:    9f00        ..      LDR      r7,[sp,#0]
        0x080055c0:    407d        }@      EORS     r5,r5,r7
        0x080055c2:    4435        5D      ADD      r5,r5,r6
        0x080055c4:    9e01        ..      LDR      r6,[sp,#4]
        0x080055c6:    6997        .i      LDR      r7,[r2,#0x18]
        0x080055c8:    443e        >D      ADD      r6,r6,r7
        0x080055ca:    4435        5D      ADD      r5,r5,r6
        0x080055cc:    698e        .i      LDR      r6,[r1,#0x18]
        0x080055ce:    9f02        ..      LDR      r7,[sp,#8]
        0x080055d0:    4435        5D      ADD      r5,r5,r6
        0x080055d2:    9e02        ..      LDR      r6,[sp,#8]
        0x080055d4:    ea47070c    G...    ORR      r7,r7,r12
        0x080055d8:    ea06060c    ....    AND      r6,r6,r12
        0x080055dc:    f8ddc010    ....    LDR      r12,[sp,#0x10]
        0x080055e0:    3008        .0      ADDS     r0,r0,#8
        0x080055e2:    ea07070c    ....    AND      r7,r7,r12
        0x080055e6:    433e        >C      ORRS     r6,r6,r7
        0x080055e8:    9f02        ..      LDR      r7,[sp,#8]
        0x080055ea:    f8ddc008    ....    LDR      r12,[sp,#8]
        0x080055ee:    ea4f07b7    O...    ROR      r7,r7,#2
        0x080055f2:    ea87377c    ..|7    EOR      r7,r7,r12,ROR #13
        0x080055f6:    ea8757bc    ...W    EOR      r7,r7,r12,ROR #22
        0x080055fa:    443e        >D      ADD      r6,r6,r7
        0x080055fc:    9f05        ..      LDR      r7,[sp,#0x14]
        0x080055fe:    442f        /D      ADD      r7,r7,r5
        0x08005600:    4435        5D      ADD      r5,r5,r6
        0x08005602:    9501        ..      STR      r5,[sp,#4]
        0x08005604:    ea4f15b7    O...    ROR      r5,r7,#6
        0x08005608:    ea8525f7    ...%    EOR      r5,r5,r7,ROR #11
        0x0800560c:    9705        ..      STR      r7,[sp,#0x14]
        0x0800560e:    ea856677    ..wf    EOR      r6,r5,r7,ROR #25
        0x08005612:    e9dd5706    ...W    LDRD     r5,r7,[sp,#0x18]
        0x08005616:    407d        }@      EORS     r5,r5,r7
        0x08005618:    9f05        ..      LDR      r7,[sp,#0x14]
        0x0800561a:    69d2        .i      LDR      r2,[r2,#0x1c]
        0x0800561c:    403d        =@      ANDS     r5,r5,r7
        0x0800561e:    9f07        ..      LDR      r7,[sp,#0x1c]
        0x08005620:    69c9        .i      LDR      r1,[r1,#0x1c]
        0x08005622:    407d        }@      EORS     r5,r5,r7
        0x08005624:    4435        5D      ADD      r5,r5,r6
        0x08005626:    9e00        ..      LDR      r6,[sp,#0]
        0x08005628:    4432        2D      ADD      r2,r2,r6
        0x0800562a:    442a        *D      ADD      r2,r2,r5
        0x0800562c:    4411        .D      ADD      r1,r1,r2
        0x0800562e:    9a01        ..      LDR      r2,[sp,#4]
        0x08005630:    9d01        ..      LDR      r5,[sp,#4]
        0x08005632:    9e03        ..      LDR      r6,[sp,#0xc]
        0x08005634:    ea42020c    B...    ORR      r2,r2,r12
        0x08005638:    ea05050c    ....    AND      r5,r5,r12
        0x0800563c:    4032        2@      ANDS     r2,r2,r6
        0x0800563e:    4315        .C      ORRS     r5,r5,r2
        0x08005640:    9a01        ..      LDR      r2,[sp,#4]
        0x08005642:    9e01        ..      LDR      r6,[sp,#4]
        0x08005644:    ea4f02b2    O...    ROR      r2,r2,#2
        0x08005648:    ea823276    ..v2    EOR      r2,r2,r6,ROR #13
        0x0800564c:    ea8252b6    ...R    EOR      r2,r2,r6,ROR #22
        0x08005650:    442a        *D      ADD      r2,r2,r5
        0x08005652:    9d04        ..      LDR      r5,[sp,#0x10]
        0x08005654:    2810        .(      CMP      r0,#0x10
        0x08005656:    440d        .D      ADD      r5,r5,r1
        0x08005658:    4411        .D      ADD      r1,r1,r2
        0x0800565a:    9504        ..      STR      r5,[sp,#0x10]
        0x0800565c:    9100        ..      STR      r1,[sp,#0]
        0x0800565e:    f4ffae88    ....    BCC      0x8005372 ; mbedtls_internal_sha256_process + 62
        0x08005662:    2110        .!      MOVS     r1,#0x10
        0x08005664:    9804        ..      LDR      r0,[sp,#0x10]
        0x08005666:    9a04        ..      LDR      r2,[sp,#0x10]
        0x08005668:    ea4f10b0    O...    ROR      r0,r0,#6
        0x0800566c:    ea8020f2    ...     EOR      r0,r0,r2,ROR #11
        0x08005670:    ea806272    ..rb    EOR      r2,r0,r2,ROR #25
        0x08005674:    e9dd0305    ....    LDRD     r0,r3,[sp,#0x14]
        0x08005678:    4058        X@      EORS     r0,r0,r3
        0x0800567a:    9b04        ..      LDR      r3,[sp,#0x10]
        0x0800567c:    ae08        ..      ADD      r6,sp,#0x20
        0x0800567e:    4018        .@      ANDS     r0,r0,r3
        0x08005680:    9b06        ..      LDR      r3,[sp,#0x18]
        0x08005682:    4058        X@      EORS     r0,r0,r3
        0x08005684:    1813        ..      ADDS     r3,r2,r0
        0x08005686:    4a39        9J      LDR      r2,[pc,#228] ; [0x800576c] = 0x8007ec4
        0x08005688:    9807        ..      LDR      r0,[sp,#0x1c]
        0x0800568a:    f8524021    R.!@    LDR      r4,[r2,r1,LSL #2]
        0x0800568e:    eb020281    ....    ADD      r2,r2,r1,LSL #2
        0x08005692:    4420         D      ADD      r0,r0,r4
        0x08005694:    181c        ..      ADDS     r4,r3,r0
        0x08005696:    eb060081    ....    ADD      r0,r6,r1,LSL #2
        0x0800569a:    f850cc08    P...    LDR      r12,[r0,#-8]
        0x0800569e:    f8505c3c    P.<\    LDR      r5,[r0,#-0x3c]
        0x080056a2:    ea4f437c    O.|C    ROR      r3,r12,#17
        0x080056a6:    ea4f17f5    O...    ROR      r7,r5,#7
        0x080056aa:    ea8343fc    ...C    EOR      r3,r3,r12,ROR #19
        0x080056ae:    ea8747b5    ...G    EOR      r7,r7,r5,ROR #18
        0x080056b2:    ea83239c    ...#    EOR      r3,r3,r12,LSR #10
        0x080056b6:    ea8707d5    ....    EOR      r7,r7,r5,LSR #3
        0x080056ba:    443b        ;D      ADD      r3,r3,r7
        0x080056bc:    46e1        .F      MOV      r9,r12
        0x080056be:    f8507c1c    P..|    LDR      r7,[r0,#-0x1c]
        0x080056c2:    f850cd40    P.@.    LDR      r12,[r0,#-0x40]!
        0x080056c6:    4467        gD      ADD      r7,r7,r12
        0x080056c8:    443b        ;D      ADD      r3,r3,r7
        0x080056ca:    f8463021    F.!0    STR      r3,[r6,r1,LSL #2]
        0x080056ce:    e9dd6700    ...g    LDRD     r6,r7,[sp,#0]
        0x080056d2:    403e        >@      ANDS     r6,r6,r7
        0x080056d4:    e9dd7c00    ...|    LDRD     r7,r12,[sp,#0]
        0x080056d8:    ea47070c    G...    ORR      r7,r7,r12
        0x080056dc:    f8ddc008    ....    LDR      r12,[sp,#8]
        0x080056e0:    441c        .D      ADD      r4,r4,r3
        0x080056e2:    ea07070c    ....    AND      r7,r7,r12
        0x080056e6:    433e        >C      ORRS     r6,r6,r7
        0x080056e8:    9f00        ..      LDR      r7,[sp,#0]
        0x080056ea:    f8ddc000    ....    LDR      r12,[sp,#0]
        0x080056ee:    ea4f07b7    O...    ROR      r7,r7,#2
        0x080056f2:    ea87377c    ..|7    EOR      r7,r7,r12,ROR #13
        0x080056f6:    ea8757bc    ...W    EOR      r7,r7,r12,ROR #22
        0x080056fa:    443e        >D      ADD      r6,r6,r7
        0x080056fc:    9f03        ..      LDR      r7,[sp,#0xc]
        0x080056fe:    4427        'D      ADD      r7,r7,r4
        0x08005700:    4434        4D      ADD      r4,r4,r6
        0x08005702:    9407        ..      STR      r4,[sp,#0x1c]
        0x08005704:    ea4f14b7    O...    ROR      r4,r7,#6
        0x08005708:    ea8424f7    ...$    EOR      r4,r4,r7,ROR #11
        0x0800570c:    9703        ..      STR      r7,[sp,#0xc]
        0x0800570e:    ea846677    ..wf    EOR      r6,r4,r7,ROR #25
        0x08005712:    e9dd4704    ...G    LDRD     r4,r7,[sp,#0x10]
        0x08005716:    407c        |@      EORS     r4,r4,r7
        0x08005718:    9f03        ..      LDR      r7,[sp,#0xc]
        0x0800571a:    f8d0c03c    ..<.    LDR      r12,[r0,#0x3c]
        0x0800571e:    403c        <@      ANDS     r4,r4,r7
        0x08005720:    9f05        ..      LDR      r7,[sp,#0x14]
        0x08005722:    46e2        .F      MOV      r10,r12
        0x08005724:    407c        |@      EORS     r4,r4,r7
        0x08005726:    4434        4D      ADD      r4,r4,r6
        0x08005728:    9e06        ..      LDR      r6,[sp,#0x18]
        0x0800572a:    6857        Wh      LDR      r7,[r2,#4]
        0x0800572c:    443e        >D      ADD      r6,r6,r7
        0x0800572e:    4434        4D      ADD      r4,r4,r6
        0x08005730:    ea4f467c    O.|F    ROR      r6,r12,#17
        0x08005734:    ea8646fc    ...F    EOR      r6,r6,r12,ROR #19
        0x08005738:    ea86279c    ...'    EOR      r7,r6,r12,LSR #10
        0x0800573c:    6886        .h      LDR      r6,[r0,#8]
        0x0800573e:    ea4f1cf6    O...    ROR      r12,r6,#7
        0x08005742:    ea8c4cb6    ...L    EOR      r12,r12,r6,ROR #18
        0x08005746:    ea8c0cd6    ....    EOR      r12,r12,r6,LSR #3
        0x0800574a:    4467        gD      ADD      r7,r7,r12
        0x0800574c:    f8d0c028    ..(.    LDR      r12,[r0,#0x28]
        0x08005750:    4465        eD      ADD      r5,r5,r12
        0x08005752:    443d        =D      ADD      r5,r5,r7
        0x08005754:    6445        Ed      STR      r5,[r0,#0x44]
        0x08005756:    f8ddc000    ....    LDR      r12,[sp,#0]
        0x0800575a:    9f07        ..      LDR      r7,[sp,#0x1c]
        0x0800575c:    442c        ,D      ADD      r4,r4,r5
        0x0800575e:    ea07070c    ....    AND      r7,r7,r12
        0x08005762:    f8ddc01c    ....    LDR      r12,[sp,#0x1c]
        0x08005766:    f8dd8000    ....    LDR      r8,[sp,#0]
        0x0800576a:    e001        ..      B        0x8005770 ; mbedtls_internal_sha256_process + 1084
    $d
        0x0800576c:    08007ec4    .~..    DCD    134250180
    $t
        0x08005770:    ea4c0c08    L...    ORR      r12,r12,r8
        0x08005774:    f8dd8004    ....    LDR      r8,[sp,#4]
        0x08005778:    ea0c0c08    ....    AND      r12,r12,r8
        0x0800577c:    ea47070c    G...    ORR      r7,r7,r12
        0x08005780:    f8ddc01c    ....    LDR      r12,[sp,#0x1c]
        0x08005784:    f8dd801c    ....    LDR      r8,[sp,#0x1c]
        0x08005788:    ea4f0cbc    O...    ROR      r12,r12,#2
        0x0800578c:    ea8c3c78    ..x<    EOR      r12,r12,r8,ROR #13
