openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08005790:    ea8c5cb8    ...\    EOR      r12,r12,r8,ROR #22
        0x08005794:    4467        gD      ADD      r7,r7,r12
        0x08005796:    f8ddc008    ....    LDR      r12,[sp,#8]
        0x0800579a:    44a4        .D      ADD      r12,r12,r4
        0x0800579c:    443c        <D      ADD      r4,r4,r7
        0x0800579e:    9406        ..      STR      r4,[sp,#0x18]
        0x080057a0:    ea4f14bc    O...    ROR      r4,r12,#6
        0x080057a4:    ea8424fc    ...$    EOR      r4,r4,r12,ROR #11
        0x080057a8:    f8cdc008    ....    STR      r12,[sp,#8]
        0x080057ac:    ea84677c    ..|g    EOR      r7,r4,r12,ROR #25
        0x080057b0:    e9dd4c03    ...L    LDRD     r4,r12,[sp,#0xc]
        0x080057b4:    ea84040c    ....    EOR      r4,r4,r12
        0x080057b8:    f8ddc008    ....    LDR      r12,[sp,#8]
        0x080057bc:    ea04040c    ....    AND      r4,r4,r12
        0x080057c0:    f8ddc010    ....    LDR      r12,[sp,#0x10]
        0x080057c4:    ea84040c    ....    EOR      r4,r4,r12
        0x080057c8:    4427        'D      ADD      r7,r7,r4
        0x080057ca:    9c05        ..      LDR      r4,[sp,#0x14]
        0x080057cc:    f8d2c008    ....    LDR      r12,[r2,#8]
        0x080057d0:    4464        dD      ADD      r4,r4,r12
        0x080057d2:    4427        'D      ADD      r7,r7,r4
        0x080057d4:    ea4f4473    O.sD    ROR      r4,r3,#17
        0x080057d8:    ea8444f3    ...D    EOR      r4,r4,r3,ROR #19
        0x080057dc:    ea842c93    ...,    EOR      r12,r4,r3,LSR #10
        0x080057e0:    68c4        .h      LDR      r4,[r0,#0xc]
        0x080057e2:    ea4f18f4    O...    ROR      r8,r4,#7
        0x080057e6:    ea8848b4    ...H    EOR      r8,r8,r4,ROR #18
        0x080057ea:    ea8808d4    ....    EOR      r8,r8,r4,LSR #3
        0x080057ee:    44c4        .D      ADD      r12,r12,r8
        0x080057f0:    f8d0802c    ..,.    LDR      r8,[r0,#0x2c]
        0x080057f4:    4446        FD      ADD      r6,r6,r8
        0x080057f6:    4466        fD      ADD      r6,r6,r12
        0x080057f8:    eb070b06    ....    ADD      r11,r7,r6
        0x080057fc:    6486        .d      STR      r6,[r0,#0x48]
        0x080057fe:    e9dd7c06    ...|    LDRD     r7,r12,[sp,#0x18]
        0x08005802:    ea07070c    ....    AND      r7,r7,r12
        0x08005806:    e9ddc806    ....    LDRD     r12,r8,[sp,#0x18]
        0x0800580a:    ea4c0c08    L...    ORR      r12,r12,r8
        0x0800580e:    f8dd8000    ....    LDR      r8,[sp,#0]
        0x08005812:    ea0c0c08    ....    AND      r12,r12,r8
        0x08005816:    ea47070c    G...    ORR      r7,r7,r12
        0x0800581a:    f8ddc018    ....    LDR      r12,[sp,#0x18]
        0x0800581e:    f8dd8018    ....    LDR      r8,[sp,#0x18]
        0x08005822:    ea4f0cbc    O...    ROR      r12,r12,#2
        0x08005826:    ea8c3c78    ..x<    EOR      r12,r12,r8,ROR #13
        0x0800582a:    ea8c5cb8    ...\    EOR      r12,r12,r8,ROR #22
        0x0800582e:    f8dd8004    ....    LDR      r8,[sp,#4]
        0x08005832:    44bc        .D      ADD      r12,r12,r7
        0x08005834:    eb08070b    ....    ADD      r7,r8,r11
        0x08005838:    9701        ..      STR      r7,[sp,#4]
        0x0800583a:    eb0b070c    ....    ADD      r7,r11,r12
        0x0800583e:    9705        ..      STR      r7,[sp,#0x14]
        0x08005840:    9f01        ..      LDR      r7,[sp,#4]
        0x08005842:    f8ddc004    ....    LDR      r12,[sp,#4]
        0x08005846:    ea4f17b7    O...    ROR      r7,r7,#6
        0x0800584a:    ea8727fc    ...'    EOR      r7,r7,r12,ROR #11
        0x0800584e:    ea876c7c    ..|l    EOR      r12,r7,r12,ROR #25
        0x08005852:    e9dd7802    ...x    LDRD     r7,r8,[sp,#8]
        0x08005856:    ea870708    ....    EOR      r7,r7,r8
        0x0800585a:    f8dd8004    ....    LDR      r8,[sp,#4]
        0x0800585e:    ea070708    ....    AND      r7,r7,r8
        0x08005862:    f8dd800c    ....    LDR      r8,[sp,#0xc]
        0x08005866:    ea870708    ....    EOR      r7,r7,r8
        0x0800586a:    4467        gD      ADD      r7,r7,r12
        0x0800586c:    f8ddc010    ....    LDR      r12,[sp,#0x10]
        0x08005870:    f8d2800c    ....    LDR      r8,[r2,#0xc]
        0x08005874:    44c4        .D      ADD      r12,r12,r8
        0x08005876:    4467        gD      ADD      r7,r7,r12
        0x08005878:    ea4f4c75    O.uL    ROR      r12,r5,#17
        0x0800587c:    ea8c4cf5    ...L    EOR      r12,r12,r5,ROR #19
        0x08005880:    ea8c2c95    ...,    EOR      r12,r12,r5,LSR #10
        0x08005884:    6905        .i      LDR      r5,[r0,#0x10]
        0x08005886:    ea4f18f5    O...    ROR      r8,r5,#7
        0x0800588a:    ea8848b5    ...H    EOR      r8,r8,r5,ROR #18
        0x0800588e:    ea8808d5    ....    EOR      r8,r8,r5,LSR #3
        0x08005892:    44c4        .D      ADD      r12,r12,r8
        0x08005894:    f8d08030    ..0.    LDR      r8,[r0,#0x30]
        0x08005898:    4444        DD      ADD      r4,r4,r8
        0x0800589a:    4464        dD      ADD      r4,r4,r12
        0x0800589c:    eb070b04    ....    ADD      r11,r7,r4
        0x080058a0:    64c4        .d      STR      r4,[r0,#0x4c]
        0x080058a2:    e9dd7c05    ...|    LDRD     r7,r12,[sp,#0x14]
        0x080058a6:    ea07070c    ....    AND      r7,r7,r12
        0x080058aa:    e9ddc805    ....    LDRD     r12,r8,[sp,#0x14]
        0x080058ae:    ea4c0c08    L...    ORR      r12,r12,r8
        0x080058b2:    f8dd801c    ....    LDR      r8,[sp,#0x1c]
        0x080058b6:    ea0c0c08    ....    AND      r12,r12,r8
        0x080058ba:    ea47070c    G...    ORR      r7,r7,r12
        0x080058be:    f8ddc014    ....    LDR      r12,[sp,#0x14]
        0x080058c2:    f8dd8014    ....    LDR      r8,[sp,#0x14]
        0x080058c6:    ea4f0cbc    O...    ROR      r12,r12,#2
        0x080058ca:    ea8c3c78    ..x<    EOR      r12,r12,r8,ROR #13
        0x080058ce:    ea8c5cb8    ...\    EOR      r12,r12,r8,ROR #22
        0x080058d2:    f8dd8000    ....    LDR      r8,[sp,#0]
        0x080058d6:    44bc        .D      ADD      r12,r12,r7
        0x080058d8:    eb08070b    ....    ADD      r7,r8,r11
        0x080058dc:    9700        ..      STR      r7,[sp,#0]
        0x080058de:    eb0b070c    ....    ADD      r7,r11,r12
        0x080058e2:    9704        ..      STR      r7,[sp,#0x10]
        0x080058e4:    9f00        ..      LDR      r7,[sp,#0]
        0x080058e6:    f8ddc000    ....    LDR      r12,[sp,#0]
        0x080058ea:    ea4f17b7    O...    ROR      r7,r7,#6
        0x080058ee:    ea872cfc    ...,    EOR      r12,r7,r12,ROR #11
        0x080058f2:    9f00        ..      LDR      r7,[sp,#0]
        0x080058f4:    ea8c6c77    ..wl    EOR      r12,r12,r7,ROR #25
        0x080058f8:    e9dd7801    ...x    LDRD     r7,r8,[sp,#4]
        0x080058fc:    ea870708    ....    EOR      r7,r7,r8
        0x08005900:    f8dd8000    ....    LDR      r8,[sp,#0]
        0x08005904:    ea070708    ....    AND      r7,r7,r8
        0x08005908:    f8dd8008    ....    LDR      r8,[sp,#8]
        0x0800590c:    ea870708    ....    EOR      r7,r7,r8
        0x08005910:    4467        gD      ADD      r7,r7,r12
        0x08005912:    f8ddc00c    ....    LDR      r12,[sp,#0xc]
        0x08005916:    f8d28010    ....    LDR      r8,[r2,#0x10]
        0x0800591a:    44c4        .D      ADD      r12,r12,r8
        0x0800591c:    4467        gD      ADD      r7,r7,r12
        0x0800591e:    ea4f4c76    O.vL    ROR      r12,r6,#17
        0x08005922:    ea8c4cf6    ...L    EOR      r12,r12,r6,ROR #19
        0x08005926:    ea8c2c96    ...,    EOR      r12,r12,r6,LSR #10
        0x0800592a:    6946        Fi      LDR      r6,[r0,#0x14]
        0x0800592c:    ea4f18f6    O...    ROR      r8,r6,#7
        0x08005930:    ea8848b6    ...H    EOR      r8,r8,r6,ROR #18
        0x08005934:    ea8808d6    ....    EOR      r8,r8,r6,LSR #3
        0x08005938:    44c4        .D      ADD      r12,r12,r8
        0x0800593a:    f8d08034    ..4.    LDR      r8,[r0,#0x34]
        0x0800593e:    4445        ED      ADD      r5,r5,r8
        0x08005940:    4465        eD      ADD      r5,r5,r12
        0x08005942:    eb070b05    ....    ADD      r11,r7,r5
        0x08005946:    6505        .e      STR      r5,[r0,#0x50]
        0x08005948:    e9dd7c04    ...|    LDRD     r7,r12,[sp,#0x10]
        0x0800594c:    ea07070c    ....    AND      r7,r7,r12
        0x08005950:    e9ddc804    ....    LDRD     r12,r8,[sp,#0x10]
        0x08005954:    ea4c0c08    L...    ORR      r12,r12,r8
        0x08005958:    f8dd8018    ....    LDR      r8,[sp,#0x18]
        0x0800595c:    ea0c0c08    ....    AND      r12,r12,r8
        0x08005960:    ea47070c    G...    ORR      r7,r7,r12
        0x08005964:    f8ddc010    ....    LDR      r12,[sp,#0x10]
        0x08005968:    f8dd8010    ....    LDR      r8,[sp,#0x10]
        0x0800596c:    ea4f0cbc    O...    ROR      r12,r12,#2
        0x08005970:    ea8c3c78    ..x<    EOR      r12,r12,r8,ROR #13
        0x08005974:    ea8c5cb8    ...\    EOR      r12,r12,r8,ROR #22
        0x08005978:    44bc        .D      ADD      r12,r12,r7
        0x0800597a:    f8dd801c    ....    LDR      r8,[sp,#0x1c]
        0x0800597e:    444e        ND      ADD      r6,r6,r9
        0x08005980:    eb08070b    ....    ADD      r7,r8,r11
        0x08005984:    9707        ..      STR      r7,[sp,#0x1c]
        0x08005986:    eb0b070c    ....    ADD      r7,r11,r12
        0x0800598a:    9703        ..      STR      r7,[sp,#0xc]
        0x0800598c:    9f07        ..      LDR      r7,[sp,#0x1c]
        0x0800598e:    f8ddc01c    ....    LDR      r12,[sp,#0x1c]
        0x08005992:    ea4f17b7    O...    ROR      r7,r7,#6
        0x08005996:    ea8727fc    ...'    EOR      r7,r7,r12,ROR #11
        0x0800599a:    ea876c7c    ..|l    EOR      r12,r7,r12,ROR #25
        0x0800599e:    e9dd7800    ...x    LDRD     r7,r8,[sp,#0]
        0x080059a2:    ea870708    ....    EOR      r7,r7,r8
        0x080059a6:    f8dd801c    ....    LDR      r8,[sp,#0x1c]
        0x080059aa:    ea070708    ....    AND      r7,r7,r8
        0x080059ae:    f8dd8004    ....    LDR      r8,[sp,#4]
        0x080059b2:    ea870708    ....    EOR      r7,r7,r8
        0x080059b6:    4467        gD      ADD      r7,r7,r12
        0x080059b8:    f8ddc008    ....    LDR      r12,[sp,#8]
        0x080059bc:    f8d28014    ....    LDR      r8,[r2,#0x14]
        0x080059c0:    44c4        .D      ADD      r12,r12,r8
        0x080059c2:    4467        gD      ADD      r7,r7,r12
        0x080059c4:    ea4f4c74    O.tL    ROR      r12,r4,#17
        0x080059c8:    ea8c4cf4    ...L    EOR      r12,r12,r4,ROR #19
        0x080059cc:    ea8c2c94    ...,    EOR      r12,r12,r4,LSR #10
        0x080059d0:    6984        .i      LDR      r4,[r0,#0x18]
        0x080059d2:    ea4f18f4    O...    ROR      r8,r4,#7
        0x080059d6:    ea8848b4    ...H    EOR      r8,r8,r4,ROR #18
        0x080059da:    ea8808d4    ....    EOR      r8,r8,r4,LSR #3
        0x080059de:    44e0        .D      ADD      r8,r8,r12
        0x080059e0:    4446        FD      ADD      r6,r6,r8
        0x080059e2:    eb070906    ....    ADD      r9,r7,r6
        0x080059e6:    6546        Fe      STR      r6,[r0,#0x54]
        0x080059e8:    e9dd7c03    ...|    LDRD     r7,r12,[sp,#0xc]
        0x080059ec:    ea07070c    ....    AND      r7,r7,r12
        0x080059f0:    e9ddc803    ....    LDRD     r12,r8,[sp,#0xc]
        0x080059f4:    ea4c0c08    L...    ORR      r12,r12,r8
        0x080059f8:    f8dd8014    ....    LDR      r8,[sp,#0x14]
        0x080059fc:    ea0c0c08    ....    AND      r12,r12,r8
        0x08005a00:    ea47070c    G...    ORR      r7,r7,r12
        0x08005a04:    f8ddc00c    ....    LDR      r12,[sp,#0xc]
        0x08005a08:    f8dd800c    ....    LDR      r8,[sp,#0xc]
        0x08005a0c:    ea4f0cbc    O...    ROR      r12,r12,#2
        0x08005a10:    ea8c3c78    ..x<    EOR      r12,r12,r8,ROR #13
        0x08005a14:    ea8c5cb8    ...\    EOR      r12,r12,r8,ROR #22
        0x08005a18:    f8dd8018    ....    LDR      r8,[sp,#0x18]
        0x08005a1c:    44bc        .D      ADD      r12,r12,r7
        0x08005a1e:    eb080709    ....    ADD      r7,r8,r9
        0x08005a22:    9706        ..      STR      r7,[sp,#0x18]
        0x08005a24:    eb09070c    ....    ADD      r7,r9,r12
        0x08005a28:    9702        ..      STR      r7,[sp,#8]
        0x08005a2a:    9f06        ..      LDR      r7,[sp,#0x18]
        0x08005a2c:    f8ddc018    ....    LDR      r12,[sp,#0x18]
        0x08005a30:    ea4f17b7    O...    ROR      r7,r7,#6
        0x08005a34:    ea8727fc    ...'    EOR      r7,r7,r12,ROR #11
        0x08005a38:    ea876c7c    ..|l    EOR      r12,r7,r12,ROR #25
        0x08005a3c:    f8dd8000    ....    LDR      r8,[sp,#0]
        0x08005a40:    9f07        ..      LDR      r7,[sp,#0x1c]
        0x08005a42:    ea870708    ....    EOR      r7,r7,r8
        0x08005a46:    f8dd8018    ....    LDR      r8,[sp,#0x18]
        0x08005a4a:    ea070708    ....    AND      r7,r7,r8
        0x08005a4e:    f8dd8000    ....    LDR      r8,[sp,#0]
        0x08005a52:    ea870708    ....    EOR      r7,r7,r8
        0x08005a56:    4467        gD      ADD      r7,r7,r12
        0x08005a58:    f8ddc004    ....    LDR      r12,[sp,#4]
        0x08005a5c:    f8d28018    ....    LDR      r8,[r2,#0x18]
        0x08005a60:    44c4        .D      ADD      r12,r12,r8
        0x08005a62:    4467        gD      ADD      r7,r7,r12
        0x08005a64:    ea4f4c75    O.uL    ROR      r12,r5,#17
        0x08005a68:    ea8c4cf5    ...L    EOR      r12,r12,r5,ROR #19
        0x08005a6c:    ea8c2c95    ...,    EOR      r12,r12,r5,LSR #10
        0x08005a70:    69c5        .i      LDR      r5,[r0,#0x1c]
        0x08005a72:    ea4f18f5    O...    ROR      r8,r5,#7
        0x08005a76:    ea8848b5    ...H    EOR      r8,r8,r5,ROR #18
        0x08005a7a:    ea8808d5    ....    EOR      r8,r8,r5,LSR #3
        0x08005a7e:    44e0        .D      ADD      r8,r8,r12
        0x08005a80:    4454        TD      ADD      r4,r4,r10
        0x08005a82:    4444        DD      ADD      r4,r4,r8
        0x08005a84:    6584        .e      STR      r4,[r0,#0x58]
        0x08005a86:    443c        <D      ADD      r4,r4,r7
        0x08005a88:    e9dd7c02    ...|    LDRD     r7,r12,[sp,#8]
        0x08005a8c:    ea07070c    ....    AND      r7,r7,r12
        0x08005a90:    e9ddc802    ....    LDRD     r12,r8,[sp,#8]
        0x08005a94:    ea4c0c08    L...    ORR      r12,r12,r8
        0x08005a98:    f8dd8010    ....    LDR      r8,[sp,#0x10]
        0x08005a9c:    442b        +D      ADD      r3,r3,r5
        0x08005a9e:    ea0c0c08    ....    AND      r12,r12,r8
        0x08005aa2:    ea47070c    G...    ORR      r7,r7,r12
        0x08005aa6:    f8ddc008    ....    LDR      r12,[sp,#8]
        0x08005aaa:    f8dd8008    ....    LDR      r8,[sp,#8]
        0x08005aae:    ea4f0cbc    O...    ROR      r12,r12,#2
        0x08005ab2:    ea8c3c78    ..x<    EOR      r12,r12,r8,ROR #13
        0x08005ab6:    ea8c5cb8    ...\    EOR      r12,r12,r8,ROR #22
        0x08005aba:    4467        gD      ADD      r7,r7,r12
        0x08005abc:    f8ddc014    ....    LDR      r12,[sp,#0x14]
        0x08005ac0:    3108        .1      ADDS     r1,r1,#8
        0x08005ac2:    44a4        .D      ADD      r12,r12,r4
        0x08005ac4:    443c        <D      ADD      r4,r4,r7
        0x08005ac6:    9401        ..      STR      r4,[sp,#4]
        0x08005ac8:    ea4f14bc    O...    ROR      r4,r12,#6
        0x08005acc:    ea8424fc    ...$    EOR      r4,r4,r12,ROR #11
        0x08005ad0:    f8cdc014    ....    STR      r12,[sp,#0x14]
        0x08005ad4:    ea84677c    ..|g    EOR      r7,r4,r12,ROR #25
        0x08005ad8:    e9dd4c06    ...L    LDRD     r4,r12,[sp,#0x18]
        0x08005adc:    ea84040c    ....    EOR      r4,r4,r12
        0x08005ae0:    f8ddc014    ....    LDR      r12,[sp,#0x14]
        0x08005ae4:    69d2        .i      LDR      r2,[r2,#0x1c]
        0x08005ae6:    ea04040c    ....    AND      r4,r4,r12
        0x08005aea:    f8ddc01c    ....    LDR      r12,[sp,#0x1c]
        0x08005aee:    ea84040c    ....    EOR      r4,r4,r12
        0x08005af2:    443c        <D      ADD      r4,r4,r7
        0x08005af4:    9f00        ..      LDR      r7,[sp,#0]
        0x08005af6:    443a        :D      ADD      r2,r2,r7
        0x08005af8:    4422        "D      ADD      r2,r2,r4
        0x08005afa:    ea4f4476    O.vD    ROR      r4,r6,#17
        0x08005afe:    ea8444f6    ...D    EOR      r4,r4,r6,ROR #19
        0x08005b02:    ea842696    ...&    EOR      r6,r4,r6,LSR #10
        0x08005b06:    6a04        .j      LDR      r4,[r0,#0x20]
        0x08005b08:    ea4f17f4    O...    ROR      r7,r4,#7
        0x08005b0c:    ea8747b4    ...G    EOR      r7,r7,r4,ROR #18
        0x08005b10:    ea8704d4    ....    EOR      r4,r7,r4,LSR #3
        0x08005b14:    4434        4D      ADD      r4,r4,r6
        0x08005b16:    4423        #D      ADD      r3,r3,r4
        0x08005b18:    65c3        .e      STR      r3,[r0,#0x5c]
        0x08005b1a:    18d0        ..      ADDS     r0,r2,r3
        0x08005b1c:    e9dd2301    ...#    LDRD     r2,r3,[sp,#4]
        0x08005b20:    401a        .@      ANDS     r2,r2,r3
        0x08005b22:    e9dd3401    ...4    LDRD     r3,r4,[sp,#4]
        0x08005b26:    4323        #C      ORRS     r3,r3,r4
        0x08005b28:    9c03        ..      LDR      r4,[sp,#0xc]
        0x08005b2a:    4023        #@      ANDS     r3,r3,r4
        0x08005b2c:    431a        .C      ORRS     r2,r2,r3
        0x08005b2e:    9b01        ..      LDR      r3,[sp,#4]
        0x08005b30:    9c01        ..      LDR      r4,[sp,#4]
        0x08005b32:    ea4f03b3    O...    ROR      r3,r3,#2
        0x08005b36:    ea833374    ..t3    EOR      r3,r3,r4,ROR #13
        0x08005b3a:    ea8353b4    ...S    EOR      r3,r3,r4,ROR #22
        0x08005b3e:    441a        .D      ADD      r2,r2,r3
        0x08005b40:    9b04        ..      LDR      r3,[sp,#0x10]
        0x08005b42:    2940        @)      CMP      r1,#0x40
        0x08005b44:    4403        .D      ADD      r3,r3,r0
        0x08005b46:    4410        .D      ADD      r0,r0,r2
        0x08005b48:    9304        ..      STR      r3,[sp,#0x10]
        0x08005b4a:    9000        ..      STR      r0,[sp,#0]
        0x08005b4c:    f4ffad8a    ....    BCC      0x8005664 ; mbedtls_internal_sha256_process + 816
        0x08005b50:    2000        .       MOVS     r0,#0
        0x08005b52:    4669        iF      MOV      r1,sp
        0x08005b54:    eb0e0280    ....    ADD      r2,lr,r0,LSL #2
        0x08005b58:    f8514020    Q. @    LDR      r4,[r1,r0,LSL #2]
        0x08005b5c:    6893        .h      LDR      r3,[r2,#8]
        0x08005b5e:    1c40        @.      ADDS     r0,r0,#1
        0x08005b60:    4423        #D      ADD      r3,r3,r4
        0x08005b62:    6093        .`      STR      r3,[r2,#8]
        0x08005b64:    2808        .(      CMP      r0,#8
        0x08005b66:    d3f5        ..      BCC      0x8005b54 ; mbedtls_internal_sha256_process + 2080
        0x08005b68:    b048        H.      ADD      sp,sp,#0x120
        0x08005b6a:    2000        .       MOVS     r0,#0
        0x08005b6c:    e8bd8ff0    ....    POP      {r4-r11,pc}
    i.mbedtls_mpi_add_abs
    mbedtls_mpi_add_abs
        0x08005b70:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08005b74:    4615        .F      MOV      r5,r2
        0x08005b76:    4604        .F      MOV      r4,r0
        0x08005b78:    42a8        .B      CMP      r0,r5
        0x08005b7a:    d101        ..      BNE      0x8005b80 ; mbedtls_mpi_add_abs + 16
        0x08005b7c:    460d        .F      MOV      r5,r1
        0x08005b7e:    4601        .F      MOV      r1,r0
        0x08005b80:    428c        .B      CMP      r4,r1
        0x08005b82:    d004        ..      BEQ      0x8005b8e ; mbedtls_mpi_add_abs + 30
        0x08005b84:    4620         F      MOV      r0,r4
        0x08005b86:    f000f93d    ..=.    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08005b8a:    0001        ..      MOVS     r1,r0
        0x08005b8c:    d148        H.      BNE      0x8005c20 ; mbedtls_mpi_add_abs + 176
        0x08005b8e:    2001        .       MOVS     r0,#1
        0x08005b90:    6020         `      STR      r0,[r4,#0]
        0x08005b92:    686e        nh      LDR      r6,[r5,#4]
        0x08005b94:    b146        F.      CBZ      r6,0x8005ba8 ; mbedtls_mpi_add_abs + 56
        0x08005b96:    1f41        A.      SUBS     r1,r0,#5
        0x08005b98:    f8d50008    ....    LDR.W    r0,[r5,#8]
        0x08005b9c:    eb010286    ....    ADD      r2,r1,r6,LSL #2
        0x08005ba0:    5882        .X      LDR      r2,[r0,r2]
        0x08005ba2:    b90a        ..      CBNZ     r2,0x8005ba8 ; mbedtls_mpi_add_abs + 56
        0x08005ba4:    1e76        v.      SUBS     r6,r6,#1
        0x08005ba6:    d1f9        ..      BNE      0x8005b9c ; mbedtls_mpi_add_abs + 44
        0x08005ba8:    4631        1F      MOV      r1,r6
        0x08005baa:    4620         F      MOV      r0,r4
        0x08005bac:    f000fbbc    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x08005bb0:    0001        ..      MOVS     r1,r0
        0x08005bb2:    d135        5.      BNE      0x8005c20 ; mbedtls_mpi_add_abs + 176
        0x08005bb4:    68aa        .h      LDR      r2,[r5,#8]
        0x08005bb6:    2700        .'      MOVS     r7,#0
        0x08005bb8:    463d        =F      MOV      r5,r7
        0x08005bba:    68a0        .h      LDR      r0,[r4,#8]
        0x08005bbc:    e015        ..      B        0x8005bea ; mbedtls_mpi_add_abs + 122
        0x08005bbe:    bf00        ..      NOP      
        0x08005bc0:    6803        .h      LDR      r3,[r0,#0]
        0x08005bc2:    f8d2c000    ....    LDR      r12,[r2,#0]
        0x08005bc6:    443b        ;D      ADD      r3,r3,r7
        0x08005bc8:    6003        .`      STR      r3,[r0,#0]
        0x08005bca:    42bb        .B      CMP      r3,r7
        0x08005bcc:    d201        ..      BCS      0x8005bd2 ; mbedtls_mpi_add_abs + 98
        0x08005bce:    2701        .'      MOVS     r7,#1
        0x08005bd0:    e000        ..      B        0x8005bd4 ; mbedtls_mpi_add_abs + 100
        0x08005bd2:    2700        .'      MOVS     r7,#0
        0x08005bd4:    4463        cD      ADD      r3,r3,r12
        0x08005bd6:    6003        .`      STR      r3,[r0,#0]
        0x08005bd8:    4563        cE      CMP      r3,r12
        0x08005bda:    d201        ..      BCS      0x8005be0 ; mbedtls_mpi_add_abs + 112
        0x08005bdc:    2301        .#      MOVS     r3,#1
        0x08005bde:    e000        ..      B        0x8005be2 ; mbedtls_mpi_add_abs + 114
        0x08005be0:    2300        .#      MOVS     r3,#0
        0x08005be2:    1d00        ..      ADDS     r0,r0,#4
        0x08005be4:    1d12        ..      ADDS     r2,r2,#4
        0x08005be6:    441f        .D      ADD      r7,r7,r3
        0x08005be8:    1c6d        m.      ADDS     r5,r5,#1
        0x08005bea:    42b5        .B      CMP      r5,r6
        0x08005bec:    d3e8        ..      BCC      0x8005bc0 ; mbedtls_mpi_add_abs + 80
        0x08005bee:    e015        ..      B        0x8005c1c ; mbedtls_mpi_add_abs + 172
        0x08005bf0:    6862        bh      LDR      r2,[r4,#4]
        0x08005bf2:    42aa        .B      CMP      r2,r5
