openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08005bf4:    d808        ..      BHI      0x8005c08 ; mbedtls_mpi_add_abs + 152
        0x08005bf6:    1c69        i.      ADDS     r1,r5,#1
        0x08005bf8:    4620         F      MOV      r0,r4
        0x08005bfa:    f000fb95    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x08005bfe:    0001        ..      MOVS     r1,r0
        0x08005c00:    d10e        ..      BNE      0x8005c20 ; mbedtls_mpi_add_abs + 176
        0x08005c02:    68a0        .h      LDR      r0,[r4,#8]
        0x08005c04:    eb000085    ....    ADD      r0,r0,r5,LSL #2
        0x08005c08:    6802        .h      LDR      r2,[r0,#0]
        0x08005c0a:    443a        :D      ADD      r2,r2,r7
        0x08005c0c:    6002        .`      STR      r2,[r0,#0]
        0x08005c0e:    42ba        .B      CMP      r2,r7
        0x08005c10:    d201        ..      BCS      0x8005c16 ; mbedtls_mpi_add_abs + 166
        0x08005c12:    2701        .'      MOVS     r7,#1
        0x08005c14:    e000        ..      B        0x8005c18 ; mbedtls_mpi_add_abs + 168
        0x08005c16:    2700        .'      MOVS     r7,#0
        0x08005c18:    1d00        ..      ADDS     r0,r0,#4
        0x08005c1a:    1c6d        m.      ADDS     r5,r5,#1
        0x08005c1c:    2f00        ./      CMP      r7,#0
        0x08005c1e:    d1e7        ..      BNE      0x8005bf0 ; mbedtls_mpi_add_abs + 128
        0x08005c20:    4608        .F      MOV      r0,r1
        0x08005c22:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x08005c26:    0000        ..      MOVS     r0,r0
    i.mbedtls_mpi_add_int
    mbedtls_mpi_add_int
        0x08005c28:    b51f        ..      PUSH     {r0-r4,lr}
        0x08005c2a:    2a00        .*      CMP      r2,#0
        0x08005c2c:    da02        ..      BGE      0x8005c34 ; mbedtls_mpi_add_int + 12
        0x08005c2e:    bf00        ..      NOP      
        0x08005c30:    f1c20200    ....    RSB      r2,r2,#0
        0x08005c34:    9203        ..      STR      r2,[sp,#0xc]
        0x08005c36:    da02        ..      BGE      0x8005c3e ; mbedtls_mpi_add_int + 22
        0x08005c38:    f04f32ff    O..2    MOV      r2,#0xffffffff
        0x08005c3c:    e001        ..      B        0x8005c42 ; mbedtls_mpi_add_int + 26
        0x08005c3e:    f04f0201    O...    MOV      r2,#1
        0x08005c42:    9200        ..      STR      r2,[sp,#0]
        0x08005c44:    f04f0201    O...    MOV      r2,#1
        0x08005c48:    9201        ..      STR      r2,[sp,#4]
        0x08005c4a:    aa03        ..      ADD      r2,sp,#0xc
        0x08005c4c:    9202        ..      STR      r2,[sp,#8]
        0x08005c4e:    466a        jF      MOV      r2,sp
        0x08005c50:    f000f802    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08005c54:    b004        ..      ADD      sp,sp,#0x10
        0x08005c56:    bd10        ..      POP      {r4,pc}
    i.mbedtls_mpi_add_mpi
    mbedtls_mpi_add_mpi
        0x08005c58:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08005c5c:    4605        .F      MOV      r5,r0
        0x08005c5e:    680c        .h      LDR      r4,[r1,#0]
        0x08005c60:    6810        .h      LDR      r0,[r2,#0]
        0x08005c62:    4617        .F      MOV      r7,r2
        0x08005c64:    460e        .F      MOV      r6,r1
        0x08005c66:    4360        `C      MULS     r0,r4,r0
        0x08005c68:    d519        ..      BPL      0x8005c9e ; mbedtls_mpi_add_mpi + 70
        0x08005c6a:    4611        .F      MOV      r1,r2
        0x08005c6c:    4630        0F      MOV      r0,r6
        0x08005c6e:    f000f839    ..9.    BL       mbedtls_mpi_cmp_abs ; 0x8005ce4
        0x08005c72:    2800        .(      CMP      r0,#0
        0x08005c74:    db09        ..      BLT      0x8005c8a ; mbedtls_mpi_add_mpi + 50
        0x08005c76:    463a        :F      MOV      r2,r7
        0x08005c78:    4631        1F      MOV      r1,r6
        0x08005c7a:    4628        (F      MOV      r0,r5
        0x08005c7c:    f000ffef    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08005c80:    2800        .(      CMP      r0,#0
        0x08005c82:    d100        ..      BNE      0x8005c86 ; mbedtls_mpi_add_mpi + 46
        0x08005c84:    602c        ,`      STR      r4,[r5,#0]
        0x08005c86:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x08005c8a:    4632        2F      MOV      r2,r6
        0x08005c8c:    4639        9F      MOV      r1,r7
        0x08005c8e:    4628        (F      MOV      r0,r5
        0x08005c90:    f000ffe5    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08005c94:    2800        .(      CMP      r0,#0
        0x08005c96:    d1f6        ..      BNE      0x8005c86 ; mbedtls_mpi_add_mpi + 46
        0x08005c98:    4261        aB      RSBS     r1,r4,#0
        0x08005c9a:    6029        )`      STR      r1,[r5,#0]
        0x08005c9c:    e7f3        ..      B        0x8005c86 ; mbedtls_mpi_add_mpi + 46
        0x08005c9e:    4628        (F      MOV      r0,r5
        0x08005ca0:    f7ffff66    ..f.    BL       mbedtls_mpi_add_abs ; 0x8005b70
        0x08005ca4:    e7ec        ..      B        0x8005c80 ; mbedtls_mpi_add_mpi + 40
    i.mbedtls_mpi_bitlen
    mbedtls_mpi_bitlen
        0x08005ca6:    b510        ..      PUSH     {r4,lr}
        0x08005ca8:    6841        Ah      LDR      r1,[r0,#4]
        0x08005caa:    b131        1.      CBZ      r1,0x8005cba ; mbedtls_mpi_bitlen + 20
        0x08005cac:    1e49        I.      SUBS     r1,r1,#1
        0x08005cae:    d008        ..      BEQ      0x8005cc2 ; mbedtls_mpi_bitlen + 28
        0x08005cb0:    6882        .h      LDR      r2,[r0,#8]
        0x08005cb2:    f8523021    R.!0    LDR      r3,[r2,r1,LSL #2]
        0x08005cb6:    b923        #.      CBNZ     r3,0x8005cc2 ; mbedtls_mpi_bitlen + 28
        0x08005cb8:    e001        ..      B        0x8005cbe ; mbedtls_mpi_bitlen + 24
        0x08005cba:    2000        .       MOVS     r0,#0
        0x08005cbc:    bd10        ..      POP      {r4,pc}
        0x08005cbe:    1e49        I.      SUBS     r1,r1,#1
        0x08005cc0:    d1f7        ..      BNE      0x8005cb2 ; mbedtls_mpi_bitlen + 12
        0x08005cc2:    6880        .h      LDR      r0,[r0,#8]
        0x08005cc4:    f04f4200    O..B    MOV      r2,#0x80000000
        0x08005cc8:    f8503021    P.!0    LDR      r3,[r0,r1,LSL #2]
        0x08005ccc:    2000        .       MOVS     r0,#0
        0x08005cce:    4213        .B      TST      r3,r2
        0x08005cd0:    d103        ..      BNE      0x8005cda ; mbedtls_mpi_bitlen + 52
        0x08005cd2:    0852        R.      LSRS     r2,r2,#1
        0x08005cd4:    1c40        @.      ADDS     r0,r0,#1
        0x08005cd6:    2820         (      CMP      r0,#0x20
        0x08005cd8:    d3f9        ..      BCC      0x8005cce ; mbedtls_mpi_bitlen + 40
        0x08005cda:    f1c00020    .. .    RSB      r0,r0,#0x20
        0x08005cde:    eb001041    ..A.    ADD      r0,r0,r1,LSL #5
        0x08005ce2:    bd10        ..      POP      {r4,pc}
    i.mbedtls_mpi_cmp_abs
    mbedtls_mpi_cmp_abs
        0x08005ce4:    b570        p.      PUSH     {r4-r6,lr}
        0x08005ce6:    6842        Bh      LDR      r2,[r0,#4]
        0x08005ce8:    f06f0403    o...    MVN      r4,#3
        0x08005cec:    b132        2.      CBZ      r2,0x8005cfc ; mbedtls_mpi_cmp_abs + 24
        0x08005cee:    6883        .h      LDR      r3,[r0,#8]
        0x08005cf0:    eb040582    ....    ADD      r5,r4,r2,LSL #2
        0x08005cf4:    595d        ]Y      LDR      r5,[r3,r5]
        0x08005cf6:    b90d        ..      CBNZ     r5,0x8005cfc ; mbedtls_mpi_cmp_abs + 24
        0x08005cf8:    1e52        R.      SUBS     r2,r2,#1
        0x08005cfa:    d1f9        ..      BNE      0x8005cf0 ; mbedtls_mpi_cmp_abs + 12
        0x08005cfc:    684b        Kh      LDR      r3,[r1,#4]
        0x08005cfe:    b13b        ;.      CBZ      r3,0x8005d10 ; mbedtls_mpi_cmp_abs + 44
        0x08005d00:    f8d15008    ...P    LDR.W    r5,[r1,#8]
        0x08005d04:    eb040683    ....    ADD      r6,r4,r3,LSL #2
        0x08005d08:    59ae        .Y      LDR      r6,[r5,r6]
        0x08005d0a:    b90e        ..      CBNZ     r6,0x8005d10 ; mbedtls_mpi_cmp_abs + 44
        0x08005d0c:    1e5b        [.      SUBS     r3,r3,#1
        0x08005d0e:    d1f9        ..      BNE      0x8005d04 ; mbedtls_mpi_cmp_abs + 32
        0x08005d10:    ea520503    R...    ORRS     r5,r2,r3
        0x08005d14:    d016        ..      BEQ      0x8005d44 ; mbedtls_mpi_cmp_abs + 96
        0x08005d16:    429a        .B      CMP      r2,r3
        0x08005d18:    d80c        ..      BHI      0x8005d34 ; mbedtls_mpi_cmp_abs + 80
        0x08005d1a:    f04f35ff    O..5    MOV      r5,#0xffffffff
        0x08005d1e:    4293        .B      CMP      r3,r2
        0x08005d20:    d80c        ..      BHI      0x8005d3c ; mbedtls_mpi_cmp_abs + 88
        0x08005d22:    b17a        z.      CBZ      r2,0x8005d44 ; mbedtls_mpi_cmp_abs + 96
        0x08005d24:    6883        .h      LDR      r3,[r0,#8]
        0x08005d26:    6889        .h      LDR      r1,[r1,#8]
        0x08005d28:    eb040082    ....    ADD      r0,r4,r2,LSL #2
        0x08005d2c:    581e        .X      LDR      r6,[r3,r0]
        0x08005d2e:    5808        .X      LDR      r0,[r1,r0]
        0x08005d30:    4286        .B      CMP      r6,r0
        0x08005d32:    d902        ..      BLS      0x8005d3a ; mbedtls_mpi_cmp_abs + 86
        0x08005d34:    f04f0001    O...    MOV      r0,#1
        0x08005d38:    bd70        p.      POP      {r4-r6,pc}
        0x08005d3a:    d201        ..      BCS      0x8005d40 ; mbedtls_mpi_cmp_abs + 92
        0x08005d3c:    4628        (F      MOV      r0,r5
        0x08005d3e:    bd70        p.      POP      {r4-r6,pc}
        0x08005d40:    1e52        R.      SUBS     r2,r2,#1
        0x08005d42:    d1f1        ..      BNE      0x8005d28 ; mbedtls_mpi_cmp_abs + 68
        0x08005d44:    2000        .       MOVS     r0,#0
        0x08005d46:    bd70        p.      POP      {r4-r6,pc}
    i.mbedtls_mpi_cmp_int
    mbedtls_mpi_cmp_int
        0x08005d48:    b50f        ..      PUSH     {r0-r3,lr}
        0x08005d4a:    2900        .)      CMP      r1,#0
        0x08005d4c:    da02        ..      BGE      0x8005d54 ; mbedtls_mpi_cmp_int + 12
        0x08005d4e:    bf00        ..      NOP      
        0x08005d50:    f1c10100    ....    RSB      r1,r1,#0
        0x08005d54:    9103        ..      STR      r1,[sp,#0xc]
        0x08005d56:    da02        ..      BGE      0x8005d5e ; mbedtls_mpi_cmp_int + 22
        0x08005d58:    f04f31ff    O..1    MOV      r1,#0xffffffff
        0x08005d5c:    e001        ..      B        0x8005d62 ; mbedtls_mpi_cmp_int + 26
        0x08005d5e:    f04f0101    O...    MOV      r1,#1
        0x08005d62:    9100        ..      STR      r1,[sp,#0]
        0x08005d64:    f04f0101    O...    MOV      r1,#1
        0x08005d68:    9101        ..      STR      r1,[sp,#4]
        0x08005d6a:    a903        ..      ADD      r1,sp,#0xc
        0x08005d6c:    9102        ..      STR      r1,[sp,#8]
        0x08005d6e:    4669        iF      MOV      r1,sp
        0x08005d70:    f000f802    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08005d74:    b004        ..      ADD      sp,sp,#0x10
        0x08005d76:    bd00        ..      POP      {pc}
    i.mbedtls_mpi_cmp_mpi
    mbedtls_mpi_cmp_mpi
        0x08005d78:    b570        p.      PUSH     {r4-r6,lr}
        0x08005d7a:    6842        Bh      LDR      r2,[r0,#4]
        0x08005d7c:    f06f0403    o...    MVN      r4,#3
        0x08005d80:    b132        2.      CBZ      r2,0x8005d90 ; mbedtls_mpi_cmp_mpi + 24
        0x08005d82:    6883        .h      LDR      r3,[r0,#8]
        0x08005d84:    eb040582    ....    ADD      r5,r4,r2,LSL #2
        0x08005d88:    595d        ]Y      LDR      r5,[r3,r5]
        0x08005d8a:    b90d        ..      CBNZ     r5,0x8005d90 ; mbedtls_mpi_cmp_mpi + 24
        0x08005d8c:    1e52        R.      SUBS     r2,r2,#1
        0x08005d8e:    d1f9        ..      BNE      0x8005d84 ; mbedtls_mpi_cmp_mpi + 12
        0x08005d90:    684b        Kh      LDR      r3,[r1,#4]
        0x08005d92:    b13b        ;.      CBZ      r3,0x8005da4 ; mbedtls_mpi_cmp_mpi + 44
        0x08005d94:    f8d15008    ...P    LDR.W    r5,[r1,#8]
        0x08005d98:    eb040683    ....    ADD      r6,r4,r3,LSL #2
        0x08005d9c:    59ae        .Y      LDR      r6,[r5,r6]
        0x08005d9e:    b90e        ..      CBNZ     r6,0x8005da4 ; mbedtls_mpi_cmp_mpi + 44
        0x08005da0:    1e5b        [.      SUBS     r3,r3,#1
        0x08005da2:    d1f9        ..      BNE      0x8005d98 ; mbedtls_mpi_cmp_mpi + 32
        0x08005da4:    ea520503    R...    ORRS     r5,r2,r3
        0x08005da8:    d02a        *.      BEQ      0x8005e00 ; mbedtls_mpi_cmp_mpi + 136
        0x08005daa:    429a        .B      CMP      r2,r3
        0x08005dac:    d901        ..      BLS      0x8005db2 ; mbedtls_mpi_cmp_mpi + 58
        0x08005dae:    6800        .h      LDR      r0,[r0,#0]
        0x08005db0:    bd70        p.      POP      {r4-r6,pc}
        0x08005db2:    4293        .B      CMP      r3,r2
        0x08005db4:    d902        ..      BLS      0x8005dbc ; mbedtls_mpi_cmp_mpi + 68
        0x08005db6:    6808        .h      LDR      r0,[r1,#0]
        0x08005db8:    4240        @B      RSBS     r0,r0,#0
        0x08005dba:    bd70        p.      POP      {r4-r6,pc}
        0x08005dbc:    6803        .h      LDR      r3,[r0,#0]
        0x08005dbe:    2b00        .+      CMP      r3,#0
        0x08005dc0:    dd04        ..      BLE      0x8005dcc ; mbedtls_mpi_cmp_mpi + 84
        0x08005dc2:    680d        .h      LDR      r5,[r1,#0]
        0x08005dc4:    2d00        .-      CMP      r5,#0
        0x08005dc6:    da01        ..      BGE      0x8005dcc ; mbedtls_mpi_cmp_mpi + 84
        0x08005dc8:    2001        .       MOVS     r0,#1
        0x08005dca:    bd70        p.      POP      {r4-r6,pc}
        0x08005dcc:    680d        .h      LDR      r5,[r1,#0]
        0x08005dce:    2d00        .-      CMP      r5,#0
        0x08005dd0:    dd04        ..      BLE      0x8005ddc ; mbedtls_mpi_cmp_mpi + 100
        0x08005dd2:    2b00        .+      CMP      r3,#0
        0x08005dd4:    da02        ..      BGE      0x8005ddc ; mbedtls_mpi_cmp_mpi + 100
        0x08005dd6:    f04f30ff    O..0    MOV      r0,#0xffffffff
        0x08005dda:    bd70        p.      POP      {r4-r6,pc}
        0x08005ddc:    b182        ..      CBZ      r2,0x8005e00 ; mbedtls_mpi_cmp_mpi + 136
        0x08005dde:    6885        .h      LDR      r5,[r0,#8]
        0x08005de0:    f8d10008    ....    LDR.W    r0,[r1,#8]
        0x08005de4:    eb040182    ....    ADD      r1,r4,r2,LSL #2
        0x08005de8:    586e        nX      LDR      r6,[r5,r1]
        0x08005dea:    5841        AX      LDR      r1,[r0,r1]
        0x08005dec:    428e        .B      CMP      r6,r1
        0x08005dee:    d901        ..      BLS      0x8005df4 ; mbedtls_mpi_cmp_mpi + 124
        0x08005df0:    4618        .F      MOV      r0,r3
        0x08005df2:    bd70        p.      POP      {r4-r6,pc}
        0x08005df4:    d202        ..      BCS      0x8005dfc ; mbedtls_mpi_cmp_mpi + 132
        0x08005df6:    f1c30000    ....    RSB      r0,r3,#0
        0x08005dfa:    bd70        p.      POP      {r4-r6,pc}
        0x08005dfc:    1e52        R.      SUBS     r2,r2,#1
        0x08005dfe:    d1f1        ..      BNE      0x8005de4 ; mbedtls_mpi_cmp_mpi + 108
        0x08005e00:    2000        .       MOVS     r0,#0
        0x08005e02:    bd70        p.      POP      {r4-r6,pc}
    i.mbedtls_mpi_copy
    mbedtls_mpi_copy
        0x08005e04:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08005e08:    460e        .F      MOV      r6,r1
        0x08005e0a:    2700        .'      MOVS     r7,#0
        0x08005e0c:    4605        .F      MOV      r5,r0
        0x08005e0e:    42b0        .B      CMP      r0,r6
        0x08005e10:    d102        ..      BNE      0x8005e18 ; mbedtls_mpi_copy + 20
        0x08005e12:    2000        .       MOVS     r0,#0
        0x08005e14:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x08005e18:    68b0        .h      LDR      r0,[r6,#8]
        0x08005e1a:    b108        ..      CBZ      r0,0x8005e20 ; mbedtls_mpi_copy + 28
        0x08005e1c:    6874        th      LDR      r4,[r6,#4]
        0x08005e1e:    e006        ..      B        0x8005e2e ; mbedtls_mpi_copy + 42
        0x08005e20:    4628        (F      MOV      r0,r5
        0x08005e22:    f000f9e0    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08005e26:    e7f4        ..      B        0x8005e12 ; mbedtls_mpi_copy + 14
        0x08005e28:    f8501024    P.$.    LDR      r1,[r0,r4,LSL #2]
        0x08005e2c:    b909        ..      CBNZ     r1,0x8005e32 ; mbedtls_mpi_copy + 46
        0x08005e2e:    1e64        d.      SUBS     r4,r4,#1
        0x08005e30:    d1fa        ..      BNE      0x8005e28 ; mbedtls_mpi_copy + 36
        0x08005e32:    6830        0h      LDR      r0,[r6,#0]
        0x08005e34:    6028        (`      STR      r0,[r5,#0]
        0x08005e36:    6869        ih      LDR      r1,[r5,#4]
        0x08005e38:    1c64        d.      ADDS     r4,r4,#1
        0x08005e3a:    42a1        .B      CMP      r1,r4
        0x08005e3c:    d206        ..      BCS      0x8005e4c ; mbedtls_mpi_copy + 72
        0x08005e3e:    4621        !F      MOV      r1,r4
        0x08005e40:    4628        (F      MOV      r0,r5
        0x08005e42:    f000fa71    ..q.    BL       mbedtls_mpi_grow ; 0x8006328
        0x08005e46:    0007        ..      MOVS     r7,r0
        0x08005e48:    d10c        ..      BNE      0x8005e64 ; mbedtls_mpi_copy + 96
        0x08005e4a:    e006        ..      B        0x8005e5a ; mbedtls_mpi_copy + 86
        0x08005e4c:    68a8        .h      LDR      r0,[r5,#8]
        0x08005e4e:    1b09        ..      SUBS     r1,r1,r4
        0x08005e50:    eb000084    ....    ADD      r0,r0,r4,LSL #2
        0x08005e54:    0089        ..      LSLS     r1,r1,#2
        0x08005e56:    f7fafb81    ....    BL       __aeabi_memclr4 ; 0x800055c
        0x08005e5a:    00a2        ..      LSLS     r2,r4,#2
        0x08005e5c:    68b1        .h      LDR      r1,[r6,#8]
        0x08005e5e:    68a8        .h      LDR      r0,[r5,#8]
        0x08005e60:    f7fafb1d    ....    BL       __aeabi_memcpy4 ; 0x800049e
        0x08005e64:    4638        8F      MOV      r0,r7
        0x08005e66:    e7d5        ..      B        0x8005e14 ; mbedtls_mpi_copy + 16
    i.mbedtls_mpi_div_mpi
    mbedtls_mpi_div_mpi
        0x08005e68:    e92d4fff    -..O    PUSH     {r0-r11,lr}
        0x08005e6c:    b097        ..      SUB      sp,sp,#0x5c
        0x08005e6e:    468a        .F      MOV      r10,r1
        0x08005e70:    4683        .F      MOV      r11,r0
        0x08005e72:    4691        .F      MOV      r9,r2
        0x08005e74:    2100        .!      MOVS     r1,#0
        0x08005e76:    981a        ..      LDR      r0,[sp,#0x68]
        0x08005e78:    f7ffff66    ..f.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08005e7c:    b1e8        ..      CBZ      r0,0x8005eba ; mbedtls_mpi_div_mpi + 82
        0x08005e7e:    a804        ..      ADD      r0,sp,#0x10
        0x08005e80:    f000fa7a    ..z.    BL       mbedtls_mpi_init ; 0x8006378
        0x08005e84:    a807        ..      ADD      r0,sp,#0x1c
        0x08005e86:    f000fa77    ..w.    BL       mbedtls_mpi_init ; 0x8006378
        0x08005e8a:    a80a        ..      ADD      r0,sp,#0x28
        0x08005e8c:    f000fa74    ..t.    BL       mbedtls_mpi_init ; 0x8006378
        0x08005e90:    a80d        ..      ADD      r0,sp,#0x34
        0x08005e92:    f000fa71    ..q.    BL       mbedtls_mpi_init ; 0x8006378
        0x08005e96:    a810        ..      ADD      r0,sp,#0x40
        0x08005e98:    f000fa6e    ..n.    BL       mbedtls_mpi_init ; 0x8006378
        0x08005e9c:    4648        HF      MOV      r0,r9
        0x08005e9e:    991a        ..      LDR      r1,[sp,#0x68]
        0x08005ea0:    f7ffff20    .. .    BL       mbedtls_mpi_cmp_abs ; 0x8005ce4
        0x08005ea4:    2800        .(      CMP      r0,#0
        0x08005ea6:    da17        ..      BGE      0x8005ed8 ; mbedtls_mpi_div_mpi + 112
        0x08005ea8:    f1bb0000    ....    SUBS     r0,r11,#0
        0x08005eac:    d00a        ..      BEQ      0x8005ec4 ; mbedtls_mpi_div_mpi + 92
        0x08005eae:    2100        .!      MOVS     r1,#0
        0x08005eb0:    f000fbb4    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x08005eb4:    0004        ..      MOVS     r4,r0
        0x08005eb6:    d179        y.      BNE      0x8005fac ; mbedtls_mpi_div_mpi + 324
        0x08005eb8:    e004        ..      B        0x8005ec4 ; mbedtls_mpi_div_mpi + 92
        0x08005eba:    f06f000b    o...    MVN      r0,#0xb
        0x08005ebe:    b01b        ..      ADD      sp,sp,#0x6c
        0x08005ec0:    e8bd8ff0    ....    POP      {r4-r11,pc}
        0x08005ec4:    f1ba0000    ....    SUBS     r0,r10,#0
        0x08005ec8:    d004        ..      BEQ      0x8005ed4 ; mbedtls_mpi_div_mpi + 108
        0x08005eca:    4649        IF      MOV      r1,r9
        0x08005ecc:    f7ffff9a    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08005ed0:    0004        ..      MOVS     r4,r0
        0x08005ed2:    d1f0        ..      BNE      0x8005eb6 ; mbedtls_mpi_div_mpi + 78
        0x08005ed4:    2000        .       MOVS     r0,#0
        0x08005ed6:    e7f2        ..      B        0x8005ebe ; mbedtls_mpi_div_mpi + 86
        0x08005ed8:    4649        IF      MOV      r1,r9
        0x08005eda:    a804        ..      ADD      r0,sp,#0x10
        0x08005edc:    f7ffff92    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08005ee0:    0004        ..      MOVS     r4,r0
        0x08005ee2:    d1e8        ..      BNE      0x8005eb6 ; mbedtls_mpi_div_mpi + 78
        0x08005ee4:    a807        ..      ADD      r0,sp,#0x1c
        0x08005ee6:    991a        ..      LDR      r1,[sp,#0x68]
        0x08005ee8:    f7ffff8c    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08005eec:    0004        ..      MOVS     r4,r0
        0x08005eee:    d1e2        ..      BNE      0x8005eb6 ; mbedtls_mpi_div_mpi + 78
        0x08005ef0:    2001        .       MOVS     r0,#1
        0x08005ef2:    9007        ..      STR      r0,[sp,#0x1c]
        0x08005ef4:    9004        ..      STR      r0,[sp,#0x10]
        0x08005ef6:    f8d91004    ....    LDR      r1,[r9,#4]
        0x08005efa:    a80a        ..      ADD      r0,sp,#0x28
        0x08005efc:    1c89        ..      ADDS     r1,r1,#2
        0x08005efe:    f000fa13    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x08005f02:    0004        ..      MOVS     r4,r0
        0x08005f04:    d1d7        ..      BNE      0x8005eb6 ; mbedtls_mpi_div_mpi + 78
        0x08005f06:    2100        .!      MOVS     r1,#0
        0x08005f08:    a80a        ..      ADD      r0,sp,#0x28
        0x08005f0a:    f000fb87    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x08005f0e:    0004        ..      MOVS     r4,r0
        0x08005f10:    d1d1        ..      BNE      0x8005eb6 ; mbedtls_mpi_div_mpi + 78
        0x08005f12:    2102        .!      MOVS     r1,#2
        0x08005f14:    a80d        ..      ADD      r0,sp,#0x34
        0x08005f16:    f000fa07    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x08005f1a:    0004        ..      MOVS     r4,r0
