openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08005f1c:    d1cb        ..      BNE      0x8005eb6 ; mbedtls_mpi_div_mpi + 78
        0x08005f1e:    2103        .!      MOVS     r1,#3
        0x08005f20:    a810        ..      ADD      r0,sp,#0x40
        0x08005f22:    f000fa01    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x08005f26:    0004        ..      MOVS     r4,r0
        0x08005f28:    d1c5        ..      BNE      0x8005eb6 ; mbedtls_mpi_div_mpi + 78
        0x08005f2a:    a807        ..      ADD      r0,sp,#0x1c
        0x08005f2c:    f7fffebb    ....    BL       mbedtls_mpi_bitlen ; 0x8005ca6
        0x08005f30:    f000001f    ....    AND      r0,r0,#0x1f
        0x08005f34:    281f        .(      CMP      r0,#0x1f
        0x08005f36:    d20f        ..      BCS      0x8005f58 ; mbedtls_mpi_div_mpi + 240
        0x08005f38:    f1c0001f    ....    RSB      r0,r0,#0x1f
        0x08005f3c:    4601        .F      MOV      r1,r0
        0x08005f3e:    9015        ..      STR      r0,[sp,#0x54]
        0x08005f40:    a804        ..      ADD      r0,sp,#0x10
        0x08005f42:    f000fdbf    ....    BL       mbedtls_mpi_shift_l ; 0x8006ac4
        0x08005f46:    0004        ..      MOVS     r4,r0
        0x08005f48:    d1b5        ..      BNE      0x8005eb6 ; mbedtls_mpi_div_mpi + 78
        0x08005f4a:    a807        ..      ADD      r0,sp,#0x1c
        0x08005f4c:    9915        ..      LDR      r1,[sp,#0x54]
        0x08005f4e:    f000fdb9    ....    BL       mbedtls_mpi_shift_l ; 0x8006ac4
        0x08005f52:    0004        ..      MOVS     r4,r0
        0x08005f54:    d1af        ..      BNE      0x8005eb6 ; mbedtls_mpi_div_mpi + 78
        0x08005f56:    e001        ..      B        0x8005f5c ; mbedtls_mpi_div_mpi + 244
        0x08005f58:    2000        .       MOVS     r0,#0
        0x08005f5a:    9015        ..      STR      r0,[sp,#0x54]
        0x08005f5c:    9d05        ..      LDR      r5,[sp,#0x14]
        0x08005f5e:    9e08        ..      LDR      r6,[sp,#0x20]
        0x08005f60:    1e6d        m.      SUBS     r5,r5,#1
        0x08005f62:    1e76        v.      SUBS     r6,r6,#1
        0x08005f64:    1baf        ..      SUBS     r7,r5,r6
        0x08005f66:    0179        y.      LSLS     r1,r7,#5
        0x08005f68:    4688        .F      MOV      r8,r1
        0x08005f6a:    a807        ..      ADD      r0,sp,#0x1c
        0x08005f6c:    f000fdaa    ....    BL       mbedtls_mpi_shift_l ; 0x8006ac4
        0x08005f70:    e00b        ..      B        0x8005f8a ; mbedtls_mpi_div_mpi + 290
        0x08005f72:    980c        ..      LDR      r0,[sp,#0x30]
        0x08005f74:    990c        ..      LDR      r1,[sp,#0x30]
        0x08005f76:    aa07        ..      ADD      r2,sp,#0x1c
        0x08005f78:    f8500027    P.'.    LDR      r0,[r0,r7,LSL #2]
        0x08005f7c:    1c40        @.      ADDS     r0,r0,#1
        0x08005f7e:    f8410027    A.'.    STR      r0,[r1,r7,LSL #2]
        0x08005f82:    a904        ..      ADD      r1,sp,#0x10
        0x08005f84:    4608        .F      MOV      r0,r1
        0x08005f86:    f000feb9    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x08005f8a:    0004        ..      MOVS     r4,r0
        0x08005f8c:    d193        ..      BNE      0x8005eb6 ; mbedtls_mpi_div_mpi + 78
        0x08005f8e:    a907        ..      ADD      r1,sp,#0x1c
        0x08005f90:    a804        ..      ADD      r0,sp,#0x10
        0x08005f92:    f7fffef1    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08005f96:    2800        .(      CMP      r0,#0
        0x08005f98:    daeb        ..      BGE      0x8005f72 ; mbedtls_mpi_div_mpi + 266
        0x08005f9a:    4641        AF      MOV      r1,r8
        0x08005f9c:    a807        ..      ADD      r0,sp,#0x1c
        0x08005f9e:    f000fde1    ....    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x08005fa2:    0004        ..      MOVS     r4,r0
        0x08005fa4:    d187        ..      BNE      0x8005eb6 ; mbedtls_mpi_div_mpi + 78
        0x08005fa6:    f06f0803    o...    MVN      r8,#3
        0x08005faa:    e0ad        ..      B        0x8006108 ; mbedtls_mpi_div_mpi + 672
        0x08005fac:    e0b6        ..      B        0x800611c ; mbedtls_mpi_div_mpi + 692
        0x08005fae:    9806        ..      LDR      r0,[sp,#0x18]
        0x08005fb0:    f8501025    P.%.    LDR      r1,[r0,r5,LSL #2]
        0x08005fb4:    9809        ..      LDR      r0,[sp,#0x24]
        0x08005fb6:    f8502026    P.&     LDR      r2,[r0,r6,LSL #2]
        0x08005fba:    4291        .B      CMP      r1,r2
        0x08005fbc:    d307        ..      BCC      0x8005fce ; mbedtls_mpi_div_mpi + 358
        0x08005fbe:    1ba8        ..      SUBS     r0,r5,r6
        0x08005fc0:    9b0c        ..      LDR      r3,[sp,#0x30]
        0x08005fc2:    eb080080    ....    ADD      r0,r8,r0,LSL #2
        0x08005fc6:    f04f31ff    O..1    MOV      r1,#0xffffffff
        0x08005fca:    5019        .P      STR      r1,[r3,r0]
        0x08005fcc:    e015        ..      B        0x8005ffa ; mbedtls_mpi_div_mpi + 402
        0x08005fce:    9b06        ..      LDR      r3,[sp,#0x18]
        0x08005fd0:    eb080085    ....    ADD      r0,r8,r5,LSL #2
        0x08005fd4:    5818        .X      LDR      r0,[r3,r0]
        0x08005fd6:    b14a        J.      CBZ      r2,0x8005fec ; mbedtls_mpi_div_mpi + 388
        0x08005fd8:    4291        .B      CMP      r1,r2
        0x08005fda:    d207        ..      BCS      0x8005fec ; mbedtls_mpi_div_mpi + 388
        0x08005fdc:    2300        .#      MOVS     r3,#0
        0x08005fde:    f7faf983    ....    BL       __aeabi_uldivmod ; 0x80002e8
        0x08005fe2:    2200        ."      MOVS     r2,#0
        0x08005fe4:    f1d033ff    ...3    RSBS     r3,r0,#0xffffffff
        0x08005fe8:    418a        .A      SBCS     r2,r2,r1
        0x08005fea:    d201        ..      BCS      0x8005ff0 ; mbedtls_mpi_div_mpi + 392
        0x08005fec:    f04f30ff    O..0    MOV      r0,#0xffffffff
        0x08005ff0:    1bab        ..      SUBS     r3,r5,r6
        0x08005ff2:    9a0c        ..      LDR      r2,[sp,#0x30]
        0x08005ff4:    eb080183    ....    ADD      r1,r8,r3,LSL #2
        0x08005ff8:    5050        PP      STR      r0,[r2,r1]
        0x08005ffa:    1ba9        ..      SUBS     r1,r5,r6
        0x08005ffc:    9a0c        ..      LDR      r2,[sp,#0x30]
        0x08005ffe:    eb080781    ....    ADD      r7,r8,r1,LSL #2
        0x08006002:    9114        ..      STR      r1,[sp,#0x50]
        0x08006004:    59d1        .Y      LDR      r1,[r2,r7]
        0x08006006:    1c49        I.      ADDS     r1,r1,#1
        0x08006008:    51d1        .Q      STR      r1,[r2,r7]
        0x0800600a:    980c        ..      LDR      r0,[sp,#0x30]
        0x0800600c:    990c        ..      LDR      r1,[sp,#0x30]
        0x0800600e:    59c0        .Y      LDR      r0,[r0,r7]
        0x08006010:    1e40        @.      SUBS     r0,r0,#1
        0x08006012:    51c8        .Q      STR      r0,[r1,r7]
        0x08006014:    2100        .!      MOVS     r1,#0
        0x08006016:    a80d        ..      ADD      r0,sp,#0x34
        0x08006018:    f000fb00    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x0800601c:    0004        ..      MOVS     r4,r0
        0x0800601e:    d17d        }.      BNE      0x800611c ; mbedtls_mpi_div_mpi + 692
        0x08006020:    b19e        ..      CBZ      r6,0x800604a ; mbedtls_mpi_div_mpi + 482
        0x08006022:    9909        ..      LDR      r1,[sp,#0x24]
        0x08006024:    eb080086    ....    ADD      r0,r8,r6,LSL #2
        0x08006028:    5808        .X      LDR      r0,[r1,r0]
        0x0800602a:    990f        ..      LDR      r1,[sp,#0x3c]
        0x0800602c:    6008        .`      STR      r0,[r1,#0]
        0x0800602e:    9809        ..      LDR      r0,[sp,#0x24]
        0x08006030:    f8501026    P.&.    LDR      r1,[r0,r6,LSL #2]
        0x08006034:    980f        ..      LDR      r0,[sp,#0x3c]
        0x08006036:    6041        A`      STR      r1,[r0,#4]
        0x08006038:    980c        ..      LDR      r0,[sp,#0x30]
        0x0800603a:    a90d        ..      ADD      r1,sp,#0x34
        0x0800603c:    59c2        .Y      LDR      r2,[r0,r7]
        0x0800603e:    4608        .F      MOV      r0,r1
        0x08006040:    f000fb3a    ..:.    BL       mbedtls_mpi_mul_int ; 0x80066b8
        0x08006044:    0004        ..      MOVS     r4,r0
        0x08006046:    d169        i.      BNE      0x800611c ; mbedtls_mpi_div_mpi + 692
        0x08006048:    e001        ..      B        0x800604e ; mbedtls_mpi_div_mpi + 486
        0x0800604a:    2000        .       MOVS     r0,#0
        0x0800604c:    e7ed        ..      B        0x800602a ; mbedtls_mpi_div_mpi + 450
        0x0800604e:    2100        .!      MOVS     r1,#0
        0x08006050:    a810        ..      ADD      r0,sp,#0x40
        0x08006052:    f000fae3    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x08006056:    0004        ..      MOVS     r4,r0
        0x08006058:    d160        `.      BNE      0x800611c ; mbedtls_mpi_div_mpi + 692
        0x0800605a:    2d02        .-      CMP      r5,#2
        0x0800605c:    d200        ..      BCS      0x8006060 ; mbedtls_mpi_div_mpi + 504
        0x0800605e:    e005        ..      B        0x800606c ; mbedtls_mpi_div_mpi + 516
        0x08006060:    f06f0107    o...    MVN      r1,#7
        0x08006064:    9806        ..      LDR      r0,[sp,#0x18]
        0x08006066:    eb010185    ....    ADD      r1,r1,r5,LSL #2
        0x0800606a:    5840        @X      LDR      r0,[r0,r1]
        0x0800606c:    9912        ..      LDR      r1,[sp,#0x48]
        0x0800606e:    6008        .`      STR      r0,[r1,#0]
        0x08006070:    b1cd        ..      CBZ      r5,0x80060a6 ; mbedtls_mpi_div_mpi + 574
        0x08006072:    9906        ..      LDR      r1,[sp,#0x18]
        0x08006074:    eb080085    ....    ADD      r0,r8,r5,LSL #2
        0x08006078:    5808        .X      LDR      r0,[r1,r0]
        0x0800607a:    9912        ..      LDR      r1,[sp,#0x48]
        0x0800607c:    6048        H`      STR      r0,[r1,#4]
        0x0800607e:    9806        ..      LDR      r0,[sp,#0x18]
        0x08006080:    9912        ..      LDR      r1,[sp,#0x48]
        0x08006082:    f8500025    P.%.    LDR      r0,[r0,r5,LSL #2]
        0x08006086:    6088        .`      STR      r0,[r1,#8]
        0x08006088:    a910        ..      ADD      r1,sp,#0x40
        0x0800608a:    a80d        ..      ADD      r0,sp,#0x34
        0x0800608c:    f7fffe74    ..t.    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08006090:    2800        .(      CMP      r0,#0
        0x08006092:    dcba        ..      BGT      0x800600a ; mbedtls_mpi_div_mpi + 418
        0x08006094:    980c        ..      LDR      r0,[sp,#0x30]
        0x08006096:    a907        ..      ADD      r1,sp,#0x1c
        0x08006098:    59c2        .Y      LDR      r2,[r0,r7]
        0x0800609a:    a80d        ..      ADD      r0,sp,#0x34
        0x0800609c:    f000fb0c    ....    BL       mbedtls_mpi_mul_int ; 0x80066b8
        0x080060a0:    0004        ..      MOVS     r4,r0
        0x080060a2:    d15f        _.      BNE      0x8006164 ; mbedtls_mpi_div_mpi + 764
        0x080060a4:    e001        ..      B        0x80060aa ; mbedtls_mpi_div_mpi + 578
        0x080060a6:    2000        .       MOVS     r0,#0
        0x080060a8:    e7e7        ..      B        0x800607a ; mbedtls_mpi_div_mpi + 530
        0x080060aa:    9814        ..      LDR      r0,[sp,#0x50]
        0x080060ac:    0141        A.      LSLS     r1,r0,#5
        0x080060ae:    3920         9      SUBS     r1,r1,#0x20
        0x080060b0:    a80d        ..      ADD      r0,sp,#0x34
        0x080060b2:    9100        ..      STR      r1,[sp,#0]
        0x080060b4:    f000fd06    ....    BL       mbedtls_mpi_shift_l ; 0x8006ac4
        0x080060b8:    0004        ..      MOVS     r4,r0
        0x080060ba:    d153        S.      BNE      0x8006164 ; mbedtls_mpi_div_mpi + 764
        0x080060bc:    a904        ..      ADD      r1,sp,#0x10
        0x080060be:    aa0d        ..      ADD      r2,sp,#0x34
        0x080060c0:    4608        .F      MOV      r0,r1
        0x080060c2:    f000fe1b    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x080060c6:    0004        ..      MOVS     r4,r0
        0x080060c8:    d14c        L.      BNE      0x8006164 ; mbedtls_mpi_div_mpi + 764
        0x080060ca:    2100        .!      MOVS     r1,#0
        0x080060cc:    a804        ..      ADD      r0,sp,#0x10
        0x080060ce:    f7fffe3b    ..;.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080060d2:    2800        .(      CMP      r0,#0
        0x080060d4:    da17        ..      BGE      0x8006106 ; mbedtls_mpi_div_mpi + 670
        0x080060d6:    a907        ..      ADD      r1,sp,#0x1c
        0x080060d8:    a80d        ..      ADD      r0,sp,#0x34
        0x080060da:    f7fffe93    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x080060de:    0004        ..      MOVS     r4,r0
        0x080060e0:    d140        @.      BNE      0x8006164 ; mbedtls_mpi_div_mpi + 764
        0x080060e2:    a80d        ..      ADD      r0,sp,#0x34
        0x080060e4:    9900        ..      LDR      r1,[sp,#0]
        0x080060e6:    f000fced    ....    BL       mbedtls_mpi_shift_l ; 0x8006ac4
        0x080060ea:    0004        ..      MOVS     r4,r0
        0x080060ec:    d13a        :.      BNE      0x8006164 ; mbedtls_mpi_div_mpi + 764
        0x080060ee:    a904        ..      ADD      r1,sp,#0x10
        0x080060f0:    aa0d        ..      ADD      r2,sp,#0x34
        0x080060f2:    4608        .F      MOV      r0,r1
        0x080060f4:    f7fffdb0    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x080060f8:    0004        ..      MOVS     r4,r0
        0x080060fa:    d133        3.      BNE      0x8006164 ; mbedtls_mpi_div_mpi + 764
        0x080060fc:    980c        ..      LDR      r0,[sp,#0x30]
        0x080060fe:    990c        ..      LDR      r1,[sp,#0x30]
        0x08006100:    59c0        .Y      LDR      r0,[r0,r7]
        0x08006102:    1e40        @.      SUBS     r0,r0,#1
        0x08006104:    51c8        .Q      STR      r0,[r1,r7]
        0x08006106:    1e6d        m.      SUBS     r5,r5,#1
        0x08006108:    42b5        .B      CMP      r5,r6
        0x0800610a:    f63faf50    ?.P.    BHI      0x8005fae ; mbedtls_mpi_div_mpi + 326
        0x0800610e:    f1bb0000    ....    SUBS     r0,r11,#0
        0x08006112:    d00d        ..      BEQ      0x8006130 ; mbedtls_mpi_div_mpi + 712
        0x08006114:    a90a        ..      ADD      r1,sp,#0x28
        0x08006116:    f7fffe75    ..u.    BL       mbedtls_mpi_copy ; 0x8005e04
        0x0800611a:    e000        ..      B        0x800611e ; mbedtls_mpi_div_mpi + 694
        0x0800611c:    e022        ".      B        0x8006164 ; mbedtls_mpi_div_mpi + 764
        0x0800611e:    0004        ..      MOVS     r4,r0
        0x08006120:    d120         .      BNE      0x8006164 ; mbedtls_mpi_div_mpi + 764
        0x08006122:    991a        ..      LDR      r1,[sp,#0x68]
        0x08006124:    f8d90000    ....    LDR      r0,[r9,#0]
        0x08006128:    6809        .h      LDR      r1,[r1,#0]
        0x0800612a:    4348        HC      MULS     r0,r1,r0
        0x0800612c:    f8cb0000    ....    STR      r0,[r11,#0]
        0x08006130:    f1ba0f00    ....    CMP      r10,#0
        0x08006134:    d016        ..      BEQ      0x8006164 ; mbedtls_mpi_div_mpi + 764
        0x08006136:    a804        ..      ADD      r0,sp,#0x10
        0x08006138:    9915        ..      LDR      r1,[sp,#0x54]
        0x0800613a:    f000fd13    ....    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x0800613e:    0004        ..      MOVS     r4,r0
        0x08006140:    d110        ..      BNE      0x8006164 ; mbedtls_mpi_div_mpi + 764
        0x08006142:    f8d90000    ....    LDR      r0,[r9,#0]
        0x08006146:    9004        ..      STR      r0,[sp,#0x10]
        0x08006148:    a904        ..      ADD      r1,sp,#0x10
        0x0800614a:    4650        PF      MOV      r0,r10
        0x0800614c:    f7fffe5a    ..Z.    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08006150:    0004        ..      MOVS     r4,r0
        0x08006152:    d107        ..      BNE      0x8006164 ; mbedtls_mpi_div_mpi + 764
        0x08006154:    2100        .!      MOVS     r1,#0
        0x08006156:    4650        PF      MOV      r0,r10
        0x08006158:    f7fffdf6    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x0800615c:    b910        ..      CBNZ     r0,0x8006164 ; mbedtls_mpi_div_mpi + 764
        0x0800615e:    2001        .       MOVS     r0,#1
        0x08006160:    f8ca0000    ....    STR      r0,[r10,#0]
        0x08006164:    a804        ..      ADD      r0,sp,#0x10
        0x08006166:    f000f83e    ..>.    BL       mbedtls_mpi_free ; 0x80061e6
        0x0800616a:    a807        ..      ADD      r0,sp,#0x1c
        0x0800616c:    f000f83b    ..;.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08006170:    a80a        ..      ADD      r0,sp,#0x28
        0x08006172:    f000f838    ..8.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08006176:    a80d        ..      ADD      r0,sp,#0x34
        0x08006178:    f000f835    ..5.    BL       mbedtls_mpi_free ; 0x80061e6
        0x0800617c:    a810        ..      ADD      r0,sp,#0x40
        0x0800617e:    f000f832    ..2.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08006182:    4620         F      MOV      r0,r4
        0x08006184:    e69b        ..      B        0x8005ebe ; mbedtls_mpi_div_mpi + 86
    i.mbedtls_mpi_fill_random
    mbedtls_mpi_fill_random
        0x08006186:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x0800618a:    4606        .F      MOV      r6,r0
        0x0800618c:    469a        .F      MOV      r10,r3
        0x0800618e:    4691        .F      MOV      r9,r2
        0x08006190:    460c        .F      MOV      r4,r1
        0x08006192:    0788        ..      LSLS     r0,r1,#30
        0x08006194:    d000        ..      BEQ      0x8006198 ; mbedtls_mpi_fill_random + 18
        0x08006196:    2001        .       MOVS     r0,#1
        0x08006198:    eb000594    ....    ADD      r5,r0,r4,LSR #2
        0x0800619c:    6870        ph      LDR      r0,[r6,#4]
        0x0800619e:    ebc40885    ....    RSB      r8,r4,r5,LSL #2
        0x080061a2:    42a8        .B      CMP      r0,r5
        0x080061a4:    d00b        ..      BEQ      0x80061be ; mbedtls_mpi_fill_random + 56
        0x080061a6:    4630        0F      MOV      r0,r6
        0x080061a8:    f000f81d    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080061ac:    4630        0F      MOV      r0,r6
        0x080061ae:    f000f8e3    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x080061b2:    4629        )F      MOV      r1,r5
        0x080061b4:    4630        0F      MOV      r0,r6
        0x080061b6:    f000f8b7    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x080061ba:    0007        ..      MOVS     r7,r0
        0x080061bc:    d110        ..      BNE      0x80061e0 ; mbedtls_mpi_fill_random + 90
        0x080061be:    2100        .!      MOVS     r1,#0
        0x080061c0:    4630        0F      MOV      r0,r6
        0x080061c2:    f000fa2b    ..+.    BL       mbedtls_mpi_lset ; 0x800661c
        0x080061c6:    0007        ..      MOVS     r7,r0
        0x080061c8:    d10a        ..      BNE      0x80061e0 ; mbedtls_mpi_fill_random + 90
        0x080061ca:    68b0        .h      LDR      r0,[r6,#8]
        0x080061cc:    4622        "F      MOV      r2,r4
        0x080061ce:    eb000108    ....    ADD      r1,r0,r8
        0x080061d2:    4650        PF      MOV      r0,r10
        0x080061d4:    464b        KF      MOV      r3,r9
        0x080061d6:    4798        .G      BLX      r3
        0x080061d8:    4629        )F      MOV      r1,r5
        0x080061da:    68b0        .h      LDR      r0,[r6,#8]
        0x080061dc:    f000ff0e    ....    BL       mpi_bigendian_to_host ; 0x8006ffc
        0x080061e0:    4638        8F      MOV      r0,r7
        0x080061e2:    e8bd87f0    ....    POP      {r4-r10,pc}
    i.mbedtls_mpi_free
    mbedtls_mpi_free
        0x080061e6:    b510        ..      PUSH     {r4,lr}
        0x080061e8:    0004        ..      MOVS     r4,r0
        0x080061ea:    d00c        ..      BEQ      0x8006206 ; mbedtls_mpi_free + 32
        0x080061ec:    68a0        .h      LDR      r0,[r4,#8]
        0x080061ee:    b128        (.      CBZ      r0,0x80061fc ; mbedtls_mpi_free + 22
        0x080061f0:    6861        ah      LDR      r1,[r4,#4]
        0x080061f2:    f7fbff02    ....    BL       mbedtls_mpi_zeroize ; 0x8001ffa
        0x080061f6:    68a0        .h      LDR      r0,[r4,#8]
        0x080061f8:    f7faf84f    ..O.    BL       free ; 0x800029a
        0x080061fc:    2001        .       MOVS     r0,#1
        0x080061fe:    6020         `      STR      r0,[r4,#0]
        0x08006200:    2000        .       MOVS     r0,#0
        0x08006202:    6060        ``      STR      r0,[r4,#4]
        0x08006204:    60a0        .`      STR      r0,[r4,#8]
        0x08006206:    bd10        ..      POP      {r4,pc}
    i.mbedtls_mpi_gcd
    mbedtls_mpi_gcd
        0x08006208:    b570        p.      PUSH     {r4-r6,lr}
        0x0800620a:    b08a        ..      SUB      sp,sp,#0x28
        0x0800620c:    4615        .F      MOV      r5,r2
        0x0800620e:    4606        .F      MOV      r6,r0
        0x08006210:    460a        .F      MOV      r2,r1
        0x08006212:    a806        ..      ADD      r0,sp,#0x18
        0x08006214:    f000f8b0    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08006218:    a803        ..      ADD      r0,sp,#0xc
        0x0800621a:    f000f8ad    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x0800621e:    4668        hF      MOV      r0,sp
        0x08006220:    f000f8aa    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x08006224:    4611        .F      MOV      r1,r2
        0x08006226:    a803        ..      ADD      r0,sp,#0xc
        0x08006228:    f7fffdec    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x0800622c:    0004        ..      MOVS     r4,r0
        0x0800622e:    d15f        _.      BNE      0x80062f0 ; mbedtls_mpi_gcd + 232
        0x08006230:    4629        )F      MOV      r1,r5
        0x08006232:    4668        hF      MOV      r0,sp
        0x08006234:    f7fffde6    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08006238:    0004        ..      MOVS     r4,r0
        0x0800623a:    d159        Y.      BNE      0x80062f0 ; mbedtls_mpi_gcd + 232
        0x0800623c:    a803        ..      ADD      r0,sp,#0xc
        0x0800623e:    f000f9d5    ....    BL       mbedtls_mpi_lsb ; 0x80065ec
        0x08006242:    4605        .F      MOV      r5,r0
        0x08006244:    4668        hF      MOV      r0,sp
        0x08006246:    f000f9d1    ....    BL       mbedtls_mpi_lsb ; 0x80065ec
        0x0800624a:    42a8        .B      CMP      r0,r5
        0x0800624c:    d200        ..      BCS      0x8006250 ; mbedtls_mpi_gcd + 72
        0x0800624e:    4605        .F      MOV      r5,r0
        0x08006250:    4629        )F      MOV      r1,r5
        0x08006252:    a803        ..      ADD      r0,sp,#0xc
        0x08006254:    f000fc86    ....    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x08006258:    0004        ..      MOVS     r4,r0
