openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x0800625a:    d149        I.      BNE      0x80062f0 ; mbedtls_mpi_gcd + 232
        0x0800625c:    4629        )F      MOV      r1,r5
        0x0800625e:    4668        hF      MOV      r0,sp
        0x08006260:    f000fc80    ....    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x08006264:    0004        ..      MOVS     r4,r0
        0x08006266:    d143        C.      BNE      0x80062f0 ; mbedtls_mpi_gcd + 232
        0x08006268:    2001        .       MOVS     r0,#1
        0x0800626a:    9000        ..      STR      r0,[sp,#0]
        0x0800626c:    9003        ..      STR      r0,[sp,#0xc]
        0x0800626e:    e02e        ..      B        0x80062ce ; mbedtls_mpi_gcd + 198
        0x08006270:    a803        ..      ADD      r0,sp,#0xc
        0x08006272:    f000f9bb    ....    BL       mbedtls_mpi_lsb ; 0x80065ec
        0x08006276:    4601        .F      MOV      r1,r0
        0x08006278:    a803        ..      ADD      r0,sp,#0xc
        0x0800627a:    f000fc73    ..s.    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x0800627e:    0004        ..      MOVS     r4,r0
        0x08006280:    d136        6.      BNE      0x80062f0 ; mbedtls_mpi_gcd + 232
        0x08006282:    4668        hF      MOV      r0,sp
        0x08006284:    f000f9b2    ....    BL       mbedtls_mpi_lsb ; 0x80065ec
        0x08006288:    4601        .F      MOV      r1,r0
        0x0800628a:    4668        hF      MOV      r0,sp
        0x0800628c:    f000fc6a    ..j.    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x08006290:    0004        ..      MOVS     r4,r0
        0x08006292:    d12d        -.      BNE      0x80062f0 ; mbedtls_mpi_gcd + 232
        0x08006294:    4669        iF      MOV      r1,sp
        0x08006296:    a803        ..      ADD      r0,sp,#0xc
        0x08006298:    f7fffd6e    ..n.    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x0800629c:    2800        .(      CMP      r0,#0
        0x0800629e:    db09        ..      BLT      0x80062b4 ; mbedtls_mpi_gcd + 172
        0x080062a0:    a903        ..      ADD      r1,sp,#0xc
        0x080062a2:    466a        jF      MOV      r2,sp
        0x080062a4:    4608        .F      MOV      r0,r1
        0x080062a6:    f000fcda    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x080062aa:    0004        ..      MOVS     r4,r0
        0x080062ac:    d120         .      BNE      0x80062f0 ; mbedtls_mpi_gcd + 232
        0x080062ae:    2101        .!      MOVS     r1,#1
        0x080062b0:    a803        ..      ADD      r0,sp,#0xc
        0x080062b2:    e008        ..      B        0x80062c6 ; mbedtls_mpi_gcd + 190
        0x080062b4:    4669        iF      MOV      r1,sp
        0x080062b6:    aa03        ..      ADD      r2,sp,#0xc
        0x080062b8:    4608        .F      MOV      r0,r1
        0x080062ba:    f000fcd0    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x080062be:    0004        ..      MOVS     r4,r0
        0x080062c0:    d116        ..      BNE      0x80062f0 ; mbedtls_mpi_gcd + 232
        0x080062c2:    2101        .!      MOVS     r1,#1
        0x080062c4:    4668        hF      MOV      r0,sp
        0x080062c6:    f000fc4d    ..M.    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x080062ca:    0004        ..      MOVS     r4,r0
        0x080062cc:    d110        ..      BNE      0x80062f0 ; mbedtls_mpi_gcd + 232
        0x080062ce:    2100        .!      MOVS     r1,#0
        0x080062d0:    a803        ..      ADD      r0,sp,#0xc
        0x080062d2:    f7fffd39    ..9.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080062d6:    2800        .(      CMP      r0,#0
        0x080062d8:    d1ca        ..      BNE      0x8006270 ; mbedtls_mpi_gcd + 104
        0x080062da:    4629        )F      MOV      r1,r5
        0x080062dc:    4668        hF      MOV      r0,sp
        0x080062de:    f000fbf1    ....    BL       mbedtls_mpi_shift_l ; 0x8006ac4
        0x080062e2:    0004        ..      MOVS     r4,r0
        0x080062e4:    d104        ..      BNE      0x80062f0 ; mbedtls_mpi_gcd + 232
        0x080062e6:    4669        iF      MOV      r1,sp
        0x080062e8:    4630        0F      MOV      r0,r6
        0x080062ea:    f7fffd8b    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x080062ee:    4604        .F      MOV      r4,r0
        0x080062f0:    a806        ..      ADD      r0,sp,#0x18
        0x080062f2:    f7ffff78    ..x.    BL       mbedtls_mpi_free ; 0x80061e6
        0x080062f6:    a803        ..      ADD      r0,sp,#0xc
        0x080062f8:    f7ffff75    ..u.    BL       mbedtls_mpi_free ; 0x80061e6
        0x080062fc:    4668        hF      MOV      r0,sp
        0x080062fe:    f7ffff72    ..r.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08006302:    b00a        ..      ADD      sp,sp,#0x28
        0x08006304:    4620         F      MOV      r0,r4
        0x08006306:    bd70        p.      POP      {r4-r6,pc}
    i.mbedtls_mpi_get_bit
    mbedtls_mpi_get_bit
        0x08006308:    6842        Bh      LDR      r2,[r0,#4]
        0x0800630a:    ebb11f42    ..B.    CMP      r1,r2,LSL #5
        0x0800630e:    d301        ..      BCC      0x8006314 ; mbedtls_mpi_get_bit + 12
        0x08006310:    2000        .       MOVS     r0,#0
        0x08006312:    4770        pG      BX       lr
        0x08006314:    6880        .h      LDR      r0,[r0,#8]
        0x08006316:    094a        J.      LSRS     r2,r1,#5
        0x08006318:    f001011f    ....    AND      r1,r1,#0x1f
        0x0800631c:    f8500022    P.".    LDR      r0,[r0,r2,LSL #2]
        0x08006320:    40c8        .@      LSRS     r0,r0,r1
        0x08006322:    f0000001    ....    AND      r0,r0,#1
        0x08006326:    4770        pG      BX       lr
    i.mbedtls_mpi_grow
    mbedtls_mpi_grow
        0x08006328:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x0800632c:    4604        .F      MOV      r4,r0
        0x0800632e:    f2427010    B..p    MOV      r0,#0x2710
        0x08006332:    460d        .F      MOV      r5,r1
        0x08006334:    f06f070f    o...    MVN      r7,#0xf
        0x08006338:    4281        .B      CMP      r1,r0
        0x0800633a:    d81b        ..      BHI      0x8006374 ; mbedtls_mpi_grow + 76
        0x0800633c:    6860        `h      LDR      r0,[r4,#4]
        0x0800633e:    42a8        .B      CMP      r0,r5
        0x08006340:    d215        ..      BCS      0x800636e ; mbedtls_mpi_grow + 70
        0x08006342:    2104        .!      MOVS     r1,#4
        0x08006344:    4628        (F      MOV      r0,r5
        0x08006346:    f7f9ff65    ..e.    BL       calloc ; 0x8000214
        0x0800634a:    0006        ..      MOVS     r6,r0
        0x0800634c:    d012        ..      BEQ      0x8006374 ; mbedtls_mpi_grow + 76
        0x0800634e:    68a1        .h      LDR      r1,[r4,#8]
        0x08006350:    b159        Y.      CBZ      r1,0x800636a ; mbedtls_mpi_grow + 66
        0x08006352:    6860        `h      LDR      r0,[r4,#4]
        0x08006354:    0082        ..      LSLS     r2,r0,#2
        0x08006356:    4630        0F      MOV      r0,r6
        0x08006358:    f7faf8a1    ....    BL       __aeabi_memcpy4 ; 0x800049e
        0x0800635c:    e9d41001    ....    LDRD     r1,r0,[r4,#4]
        0x08006360:    f7fbfe4b    ..K.    BL       mbedtls_mpi_zeroize ; 0x8001ffa
        0x08006364:    68a0        .h      LDR      r0,[r4,#8]
        0x08006366:    f7f9ff98    ....    BL       free ; 0x800029a
        0x0800636a:    e9c45601    ...V    STRD     r5,r6,[r4,#4]
        0x0800636e:    2000        .       MOVS     r0,#0
        0x08006370:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x08006374:    4638        8F      MOV      r0,r7
        0x08006376:    e7fb        ..      B        0x8006370 ; mbedtls_mpi_grow + 72
    i.mbedtls_mpi_init
    mbedtls_mpi_init
        0x08006378:    2101        .!      MOVS     r1,#1
        0x0800637a:    6001        .`      STR      r1,[r0,#0]
        0x0800637c:    2100        .!      MOVS     r1,#0
        0x0800637e:    6041        A`      STR      r1,[r0,#4]
        0x08006380:    6081        .`      STR      r1,[r0,#8]
        0x08006382:    4770        pG      BX       lr
    i.mbedtls_mpi_inv_mod
    mbedtls_mpi_inv_mod
        0x08006384:    b5f0        ..      PUSH     {r4-r7,lr}
        0x08006386:    460e        .F      MOV      r6,r1
        0x08006388:    4607        .F      MOV      r7,r0
        0x0800638a:    b09b        ..      SUB      sp,sp,#0x6c
        0x0800638c:    4615        .F      MOV      r5,r2
        0x0800638e:    2101        .!      MOVS     r1,#1
        0x08006390:    4610        .F      MOV      r0,r2
        0x08006392:    f7fffcd9    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08006396:    2800        .(      CMP      r0,#0
        0x08006398:    dc03        ..      BGT      0x80063a2 ; mbedtls_mpi_inv_mod + 30
        0x0800639a:    f06f0003    o...    MVN      r0,#3
        0x0800639e:    b01b        ..      ADD      sp,sp,#0x6c
        0x080063a0:    bdf0        ..      POP      {r4-r7,pc}
        0x080063a2:    a812        ..      ADD      r0,sp,#0x48
        0x080063a4:    f7ffffe8    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x080063a8:    a803        ..      ADD      r0,sp,#0xc
        0x080063aa:    f7ffffe5    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x080063ae:    a806        ..      ADD      r0,sp,#0x18
        0x080063b0:    f7ffffe2    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x080063b4:    a809        ..      ADD      r0,sp,#0x24
        0x080063b6:    f7ffffdf    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x080063ba:    a818        ..      ADD      r0,sp,#0x60
        0x080063bc:    f7ffffdc    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x080063c0:    a815        ..      ADD      r0,sp,#0x54
        0x080063c2:    f7ffffd9    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x080063c6:    a80f        ..      ADD      r0,sp,#0x3c
        0x080063c8:    f7ffffd6    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x080063cc:    4668        hF      MOV      r0,sp
        0x080063ce:    f7ffffd3    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x080063d2:    a80c        ..      ADD      r0,sp,#0x30
        0x080063d4:    f7ffffd0    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x080063d8:    462a        *F      MOV      r2,r5
        0x080063da:    4631        1F      MOV      r1,r6
        0x080063dc:    a818        ..      ADD      r0,sp,#0x60
        0x080063de:    f7ffff13    ....    BL       mbedtls_mpi_gcd ; 0x8006208
        0x080063e2:    0004        ..      MOVS     r4,r0
        0x080063e4:    d106        ..      BNE      0x80063f4 ; mbedtls_mpi_inv_mod + 112
        0x080063e6:    2101        .!      MOVS     r1,#1
        0x080063e8:    a818        ..      ADD      r0,sp,#0x60
        0x080063ea:    f7fffcad    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x080063ee:    b110        ..      CBZ      r0,0x80063f6 ; mbedtls_mpi_inv_mod + 114
        0x080063f0:    f06f040d    o...    MVN      r4,#0xd
        0x080063f4:    e0dd        ..      B        0x80065b2 ; mbedtls_mpi_inv_mod + 558
        0x080063f6:    462a        *F      MOV      r2,r5
        0x080063f8:    4631        1F      MOV      r1,r6
        0x080063fa:    a812        ..      ADD      r0,sp,#0x48
        0x080063fc:    f000f92b    ..+.    BL       mbedtls_mpi_mod_mpi ; 0x8006656
        0x08006400:    0004        ..      MOVS     r4,r0
        0x08006402:    d1f7        ..      BNE      0x80063f4 ; mbedtls_mpi_inv_mod + 112
        0x08006404:    a912        ..      ADD      r1,sp,#0x48
        0x08006406:    a803        ..      ADD      r0,sp,#0xc
        0x08006408:    f7fffcfc    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x0800640c:    0004        ..      MOVS     r4,r0
        0x0800640e:    d1f1        ..      BNE      0x80063f4 ; mbedtls_mpi_inv_mod + 112
        0x08006410:    4629        )F      MOV      r1,r5
        0x08006412:    a815        ..      ADD      r0,sp,#0x54
        0x08006414:    f7fffcf6    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08006418:    0004        ..      MOVS     r4,r0
        0x0800641a:    d1eb        ..      BNE      0x80063f4 ; mbedtls_mpi_inv_mod + 112
        0x0800641c:    4629        )F      MOV      r1,r5
        0x0800641e:    a80f        ..      ADD      r0,sp,#0x3c
        0x08006420:    f7fffcf0    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08006424:    0004        ..      MOVS     r4,r0
        0x08006426:    d1e5        ..      BNE      0x80063f4 ; mbedtls_mpi_inv_mod + 112
        0x08006428:    2101        .!      MOVS     r1,#1
        0x0800642a:    a806        ..      ADD      r0,sp,#0x18
        0x0800642c:    f000f8f6    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x08006430:    0004        ..      MOVS     r4,r0
        0x08006432:    d1df        ..      BNE      0x80063f4 ; mbedtls_mpi_inv_mod + 112
        0x08006434:    2100        .!      MOVS     r1,#0
        0x08006436:    a809        ..      ADD      r0,sp,#0x24
        0x08006438:    f000f8f0    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x0800643c:    0004        ..      MOVS     r4,r0
        0x0800643e:    d1d9        ..      BNE      0x80063f4 ; mbedtls_mpi_inv_mod + 112
        0x08006440:    2100        .!      MOVS     r1,#0
        0x08006442:    4668        hF      MOV      r0,sp
        0x08006444:    f000f8ea    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x08006448:    0004        ..      MOVS     r4,r0
        0x0800644a:    d1d3        ..      BNE      0x80063f4 ; mbedtls_mpi_inv_mod + 112
        0x0800644c:    2101        .!      MOVS     r1,#1
        0x0800644e:    a80c        ..      ADD      r0,sp,#0x30
        0x08006450:    f000f8e4    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x08006454:    e025        %.      B        0x80064a2 ; mbedtls_mpi_inv_mod + 286
        0x08006456:    2101        .!      MOVS     r1,#1
        0x08006458:    a803        ..      ADD      r0,sp,#0xc
        0x0800645a:    f000fb83    ....    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x0800645e:    0004        ..      MOVS     r4,r0
        0x08006460:    d17e        ~.      BNE      0x8006560 ; mbedtls_mpi_inv_mod + 476
        0x08006462:    9808        ..      LDR      r0,[sp,#0x20]
        0x08006464:    7800        .x      LDRB     r0,[r0,#0]
        0x08006466:    07c0        ..      LSLS     r0,r0,#31
        0x08006468:    d103        ..      BNE      0x8006472 ; mbedtls_mpi_inv_mod + 238
        0x0800646a:    980b        ..      LDR      r0,[sp,#0x2c]
        0x0800646c:    7800        .x      LDRB     r0,[r0,#0]
        0x0800646e:    07c0        ..      LSLS     r0,r0,#31
        0x08006470:    d00d        ..      BEQ      0x800648e ; mbedtls_mpi_inv_mod + 266
        0x08006472:    a906        ..      ADD      r1,sp,#0x18
        0x08006474:    aa15        ..      ADD      r2,sp,#0x54
        0x08006476:    4608        .F      MOV      r0,r1
        0x08006478:    f7fffbee    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x0800647c:    0004        ..      MOVS     r4,r0
        0x0800647e:    d16f        o.      BNE      0x8006560 ; mbedtls_mpi_inv_mod + 476
        0x08006480:    a909        ..      ADD      r1,sp,#0x24
        0x08006482:    aa12        ..      ADD      r2,sp,#0x48
        0x08006484:    4608        .F      MOV      r0,r1
        0x08006486:    f000fc39    ..9.    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x0800648a:    0004        ..      MOVS     r4,r0
        0x0800648c:    d168        h.      BNE      0x8006560 ; mbedtls_mpi_inv_mod + 476
        0x0800648e:    2101        .!      MOVS     r1,#1
        0x08006490:    a806        ..      ADD      r0,sp,#0x18
        0x08006492:    f000fb67    ..g.    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x08006496:    0004        ..      MOVS     r4,r0
        0x08006498:    d162        b.      BNE      0x8006560 ; mbedtls_mpi_inv_mod + 476
        0x0800649a:    2101        .!      MOVS     r1,#1
        0x0800649c:    a809        ..      ADD      r0,sp,#0x24
        0x0800649e:    f000fb61    ..a.    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x080064a2:    0004        ..      MOVS     r4,r0
        0x080064a4:    d15c        \.      BNE      0x8006560 ; mbedtls_mpi_inv_mod + 476
        0x080064a6:    9805        ..      LDR      r0,[sp,#0x14]
        0x080064a8:    7800        .x      LDRB     r0,[r0,#0]
        0x080064aa:    07c0        ..      LSLS     r0,r0,#31
        0x080064ac:    d0d3        ..      BEQ      0x8006456 ; mbedtls_mpi_inv_mod + 210
        0x080064ae:    e027        '.      B        0x8006500 ; mbedtls_mpi_inv_mod + 380
        0x080064b0:    2101        .!      MOVS     r1,#1
        0x080064b2:    a80f        ..      ADD      r0,sp,#0x3c
        0x080064b4:    f000fb56    ..V.    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x080064b8:    0004        ..      MOVS     r4,r0
        0x080064ba:    d17a        z.      BNE      0x80065b2 ; mbedtls_mpi_inv_mod + 558
        0x080064bc:    9802        ..      LDR      r0,[sp,#8]
        0x080064be:    7800        .x      LDRB     r0,[r0,#0]
        0x080064c0:    07c0        ..      LSLS     r0,r0,#31
        0x080064c2:    d103        ..      BNE      0x80064cc ; mbedtls_mpi_inv_mod + 328
        0x080064c4:    980e        ..      LDR      r0,[sp,#0x38]
        0x080064c6:    7800        .x      LDRB     r0,[r0,#0]
        0x080064c8:    07c0        ..      LSLS     r0,r0,#31
        0x080064ca:    d00d        ..      BEQ      0x80064e8 ; mbedtls_mpi_inv_mod + 356
        0x080064cc:    4669        iF      MOV      r1,sp
        0x080064ce:    aa15        ..      ADD      r2,sp,#0x54
        0x080064d0:    4608        .F      MOV      r0,r1
        0x080064d2:    f7fffbc1    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x080064d6:    0004        ..      MOVS     r4,r0
        0x080064d8:    d16b        k.      BNE      0x80065b2 ; mbedtls_mpi_inv_mod + 558
        0x080064da:    a90c        ..      ADD      r1,sp,#0x30
        0x080064dc:    aa12        ..      ADD      r2,sp,#0x48
        0x080064de:    4608        .F      MOV      r0,r1
        0x080064e0:    f000fc0c    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x080064e4:    0004        ..      MOVS     r4,r0
        0x080064e6:    d164        d.      BNE      0x80065b2 ; mbedtls_mpi_inv_mod + 558
        0x080064e8:    2101        .!      MOVS     r1,#1
        0x080064ea:    4668        hF      MOV      r0,sp
        0x080064ec:    f000fb3a    ..:.    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x080064f0:    0004        ..      MOVS     r4,r0
        0x080064f2:    d15e        ^.      BNE      0x80065b2 ; mbedtls_mpi_inv_mod + 558
        0x080064f4:    2101        .!      MOVS     r1,#1
        0x080064f6:    a80c        ..      ADD      r0,sp,#0x30
        0x080064f8:    f000fb34    ..4.    BL       mbedtls_mpi_shift_r ; 0x8006b64
        0x080064fc:    0004        ..      MOVS     r4,r0
        0x080064fe:    d158        X.      BNE      0x80065b2 ; mbedtls_mpi_inv_mod + 558
        0x08006500:    9811        ..      LDR      r0,[sp,#0x44]
        0x08006502:    7800        .x      LDRB     r0,[r0,#0]
        0x08006504:    07c0        ..      LSLS     r0,r0,#31
        0x08006506:    d0d3        ..      BEQ      0x80064b0 ; mbedtls_mpi_inv_mod + 300
        0x08006508:    a90f        ..      ADD      r1,sp,#0x3c
        0x0800650a:    a803        ..      ADD      r0,sp,#0xc
        0x0800650c:    f7fffc34    ..4.    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x08006510:    2800        .(      CMP      r0,#0
        0x08006512:    db10        ..      BLT      0x8006536 ; mbedtls_mpi_inv_mod + 434
        0x08006514:    a903        ..      ADD      r1,sp,#0xc
        0x08006516:    aa0f        ..      ADD      r2,sp,#0x3c
        0x08006518:    4608        .F      MOV      r0,r1
        0x0800651a:    f000fbef    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x0800651e:    0004        ..      MOVS     r4,r0
        0x08006520:    d147        G.      BNE      0x80065b2 ; mbedtls_mpi_inv_mod + 558
        0x08006522:    a906        ..      ADD      r1,sp,#0x18
        0x08006524:    466a        jF      MOV      r2,sp
        0x08006526:    4608        .F      MOV      r0,r1
        0x08006528:    f000fbe8    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x0800652c:    0004        ..      MOVS     r4,r0
        0x0800652e:    d140        @.      BNE      0x80065b2 ; mbedtls_mpi_inv_mod + 558
        0x08006530:    aa0c        ..      ADD      r2,sp,#0x30
        0x08006532:    a909        ..      ADD      r1,sp,#0x24
        0x08006534:    e00f        ..      B        0x8006556 ; mbedtls_mpi_inv_mod + 466
        0x08006536:    a90f        ..      ADD      r1,sp,#0x3c
        0x08006538:    aa03        ..      ADD      r2,sp,#0xc
        0x0800653a:    4608        .F      MOV      r0,r1
        0x0800653c:    f000fbde    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x08006540:    0004        ..      MOVS     r4,r0
        0x08006542:    d136        6.      BNE      0x80065b2 ; mbedtls_mpi_inv_mod + 558
        0x08006544:    4669        iF      MOV      r1,sp
        0x08006546:    aa06        ..      ADD      r2,sp,#0x18
        0x08006548:    4608        .F      MOV      r0,r1
        0x0800654a:    f000fbd7    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x0800654e:    0004        ..      MOVS     r4,r0
        0x08006550:    d12f        /.      BNE      0x80065b2 ; mbedtls_mpi_inv_mod + 558
        0x08006552:    aa09        ..      ADD      r2,sp,#0x24
        0x08006554:    a90c        ..      ADD      r1,sp,#0x30
        0x08006556:    4608        .F      MOV      r0,r1
        0x08006558:    f000fbd0    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x0800655c:    0004        ..      MOVS     r4,r0
        0x0800655e:    e000        ..      B        0x8006562 ; mbedtls_mpi_inv_mod + 478
        0x08006560:    e027        '.      B        0x80065b2 ; mbedtls_mpi_inv_mod + 558
        0x08006562:    d126        &.      BNE      0x80065b2 ; mbedtls_mpi_inv_mod + 558
        0x08006564:    2100        .!      MOVS     r1,#0
        0x08006566:    a803        ..      ADD      r0,sp,#0xc
        0x08006568:    f7fffbee    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x0800656c:    2800        .(      CMP      r0,#0
        0x0800656e:    d19a        ..      BNE      0x80064a6 ; mbedtls_mpi_inv_mod + 290
        0x08006570:    e006        ..      B        0x8006580 ; mbedtls_mpi_inv_mod + 508
        0x08006572:    4669        iF      MOV      r1,sp
        0x08006574:    462a        *F      MOV      r2,r5
        0x08006576:    4608        .F      MOV      r0,r1
        0x08006578:    f7fffb6e    ..n.    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x0800657c:    0004        ..      MOVS     r4,r0
        0x0800657e:    d118        ..      BNE      0x80065b2 ; mbedtls_mpi_inv_mod + 558
        0x08006580:    2100        .!      MOVS     r1,#0
        0x08006582:    4668        hF      MOV      r0,sp
        0x08006584:    f7fffbe0    ....    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08006588:    2800        .(      CMP      r0,#0
