openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x0800658a:    dbf2        ..      BLT      0x8006572 ; mbedtls_mpi_inv_mod + 494
        0x0800658c:    e006        ..      B        0x800659c ; mbedtls_mpi_inv_mod + 536
        0x0800658e:    4669        iF      MOV      r1,sp
        0x08006590:    462a        *F      MOV      r2,r5
        0x08006592:    4608        .F      MOV      r0,r1
        0x08006594:    f000fbb2    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x08006598:    0004        ..      MOVS     r4,r0
        0x0800659a:    d10a        ..      BNE      0x80065b2 ; mbedtls_mpi_inv_mod + 558
        0x0800659c:    4629        )F      MOV      r1,r5
        0x0800659e:    4668        hF      MOV      r0,sp
        0x080065a0:    f7fffbea    ....    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x080065a4:    2800        .(      CMP      r0,#0
        0x080065a6:    daf2        ..      BGE      0x800658e ; mbedtls_mpi_inv_mod + 522
        0x080065a8:    4669        iF      MOV      r1,sp
        0x080065aa:    4638        8F      MOV      r0,r7
        0x080065ac:    f7fffc2a    ..*.    BL       mbedtls_mpi_copy ; 0x8005e04
        0x080065b0:    4604        .F      MOV      r4,r0
        0x080065b2:    a812        ..      ADD      r0,sp,#0x48
        0x080065b4:    f7fffe17    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080065b8:    a803        ..      ADD      r0,sp,#0xc
        0x080065ba:    f7fffe14    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080065be:    a806        ..      ADD      r0,sp,#0x18
        0x080065c0:    f7fffe11    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080065c4:    a809        ..      ADD      r0,sp,#0x24
        0x080065c6:    f7fffe0e    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080065ca:    a818        ..      ADD      r0,sp,#0x60
        0x080065cc:    f7fffe0b    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080065d0:    a815        ..      ADD      r0,sp,#0x54
        0x080065d2:    f7fffe08    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080065d6:    a80f        ..      ADD      r0,sp,#0x3c
        0x080065d8:    f7fffe05    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080065dc:    4668        hF      MOV      r0,sp
        0x080065de:    f7fffe02    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080065e2:    a80c        ..      ADD      r0,sp,#0x30
        0x080065e4:    f7fffdff    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080065e8:    4620         F      MOV      r0,r4
        0x080065ea:    e6d8        ..      B        0x800639e ; mbedtls_mpi_inv_mod + 26
    i.mbedtls_mpi_lsb
    mbedtls_mpi_lsb
        0x080065ec:    b570        p.      PUSH     {r4-r6,lr}
        0x080065ee:    4603        .F      MOV      r3,r0
        0x080065f0:    2000        .       MOVS     r0,#0
        0x080065f2:    4602        .F      MOV      r2,r0
        0x080065f4:    685c        \h      LDR      r4,[r3,#4]
        0x080065f6:    e00c        ..      B        0x8006612 ; mbedtls_mpi_lsb + 38
        0x080065f8:    689d        .h      LDR      r5,[r3,#8]
        0x080065fa:    2100        .!      MOVS     r1,#0
        0x080065fc:    f8555022    U."P    LDR      r5,[r5,r2,LSL #2]
        0x08006600:    fa25f601    %...    LSR      r6,r5,r1
        0x08006604:    07f6        ..      LSLS     r6,r6,#31
        0x08006606:    d107        ..      BNE      0x8006618 ; mbedtls_mpi_lsb + 44
        0x08006608:    1c40        @.      ADDS     r0,r0,#1
        0x0800660a:    1c49        I.      ADDS     r1,r1,#1
        0x0800660c:    2920         )      CMP      r1,#0x20
        0x0800660e:    d3f7        ..      BCC      0x8006600 ; mbedtls_mpi_lsb + 20
        0x08006610:    1c52        R.      ADDS     r2,r2,#1
        0x08006612:    4294        .B      CMP      r4,r2
        0x08006614:    d8f0        ..      BHI      0x80065f8 ; mbedtls_mpi_lsb + 12
        0x08006616:    2000        .       MOVS     r0,#0
        0x08006618:    bd70        p.      POP      {r4-r6,pc}
        0x0800661a:    0000        ..      MOVS     r0,r0
    i.mbedtls_mpi_lset
    mbedtls_mpi_lset
        0x0800661c:    b570        p.      PUSH     {r4-r6,lr}
        0x0800661e:    460d        .F      MOV      r5,r1
        0x08006620:    4604        .F      MOV      r4,r0
        0x08006622:    2101        .!      MOVS     r1,#1
        0x08006624:    f7fffe80    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x08006628:    0006        ..      MOVS     r6,r0
        0x0800662a:    d112        ..      BNE      0x8006652 ; mbedtls_mpi_lset + 54
        0x0800662c:    6860        `h      LDR      r0,[r4,#4]
        0x0800662e:    0081        ..      LSLS     r1,r0,#2
        0x08006630:    68a0        .h      LDR      r0,[r4,#8]
        0x08006632:    f7f9ff93    ....    BL       __aeabi_memclr4 ; 0x800055c
        0x08006636:    2d00        .-      CMP      r5,#0
        0x08006638:    da02        ..      BGE      0x8006640 ; mbedtls_mpi_lset + 36
        0x0800663a:    bf00        ..      NOP      
        0x0800663c:    f1c50500    ....    RSB      r5,r5,#0
        0x08006640:    68a0        .h      LDR      r0,[r4,#8]
        0x08006642:    6005        .`      STR      r5,[r0,#0]
        0x08006644:    da02        ..      BGE      0x800664c ; mbedtls_mpi_lset + 48
        0x08006646:    f04f30ff    O..0    MOV      r0,#0xffffffff
        0x0800664a:    e001        ..      B        0x8006650 ; mbedtls_mpi_lset + 52
        0x0800664c:    f04f0001    O...    MOV      r0,#1
        0x08006650:    6020         `      STR      r0,[r4,#0]
        0x08006652:    4630        0F      MOV      r0,r6
        0x08006654:    bd70        p.      POP      {r4-r6,pc}
    i.mbedtls_mpi_mod_mpi
    mbedtls_mpi_mod_mpi
        0x08006656:    b570        p.      PUSH     {r4-r6,lr}
        0x08006658:    460c        .F      MOV      r4,r1
        0x0800665a:    4606        .F      MOV      r6,r0
        0x0800665c:    4615        .F      MOV      r5,r2
        0x0800665e:    2100        .!      MOVS     r1,#0
        0x08006660:    4610        .F      MOV      r0,r2
        0x08006662:    f7fffb71    ..q.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08006666:    2800        .(      CMP      r0,#0
        0x08006668:    da02        ..      BGE      0x8006670 ; mbedtls_mpi_mod_mpi + 26
        0x0800666a:    f06f0009    o...    MVN      r0,#9
        0x0800666e:    bd70        p.      POP      {r4-r6,pc}
        0x08006670:    462b        +F      MOV      r3,r5
        0x08006672:    4622        "F      MOV      r2,r4
        0x08006674:    4631        1F      MOV      r1,r6
        0x08006676:    2000        .       MOVS     r0,#0
        0x08006678:    f7fffbf6    ....    BL       mbedtls_mpi_div_mpi ; 0x8005e68
        0x0800667c:    e004        ..      B        0x8006688 ; mbedtls_mpi_mod_mpi + 50
        0x0800667e:    4631        1F      MOV      r1,r6
        0x08006680:    462a        *F      MOV      r2,r5
        0x08006682:    4608        .F      MOV      r0,r1
        0x08006684:    f7fffae8    ....    BL       mbedtls_mpi_add_mpi ; 0x8005c58
        0x08006688:    0004        ..      MOVS     r4,r0
        0x0800668a:    d113        ..      BNE      0x80066b4 ; mbedtls_mpi_mod_mpi + 94
        0x0800668c:    2100        .!      MOVS     r1,#0
        0x0800668e:    4630        0F      MOV      r0,r6
        0x08006690:    f7fffb5a    ..Z.    BL       mbedtls_mpi_cmp_int ; 0x8005d48
        0x08006694:    2800        .(      CMP      r0,#0
        0x08006696:    dbf2        ..      BLT      0x800667e ; mbedtls_mpi_mod_mpi + 40
        0x08006698:    e006        ..      B        0x80066a8 ; mbedtls_mpi_mod_mpi + 82
        0x0800669a:    4631        1F      MOV      r1,r6
        0x0800669c:    462a        *F      MOV      r2,r5
        0x0800669e:    4608        .F      MOV      r0,r1
        0x080066a0:    f000fb2c    ..,.    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x080066a4:    0004        ..      MOVS     r4,r0
        0x080066a6:    d105        ..      BNE      0x80066b4 ; mbedtls_mpi_mod_mpi + 94
        0x080066a8:    4629        )F      MOV      r1,r5
        0x080066aa:    4630        0F      MOV      r0,r6
        0x080066ac:    f7fffb64    ..d.    BL       mbedtls_mpi_cmp_mpi ; 0x8005d78
        0x080066b0:    2800        .(      CMP      r0,#0
        0x080066b2:    daf2        ..      BGE      0x800669a ; mbedtls_mpi_mod_mpi + 68
        0x080066b4:    4620         F      MOV      r0,r4
        0x080066b6:    bd70        p.      POP      {r4-r6,pc}
    i.mbedtls_mpi_mul_int
    mbedtls_mpi_mul_int
        0x080066b8:    b51f        ..      PUSH     {r0-r4,lr}
        0x080066ba:    2301        .#      MOVS     r3,#1
        0x080066bc:    9300        ..      STR      r3,[sp,#0]
        0x080066be:    9301        ..      STR      r3,[sp,#4]
        0x080066c0:    ab03        ..      ADD      r3,sp,#0xc
        0x080066c2:    e9cd3202    ...2    STRD     r3,r2,[sp,#8]
        0x080066c6:    466a        jF      MOV      r2,sp
        0x080066c8:    f000f802    ....    BL       mbedtls_mpi_mul_mpi ; 0x80066d0
        0x080066cc:    b004        ..      ADD      sp,sp,#0x10
        0x080066ce:    bd10        ..      POP      {r4,pc}
    i.mbedtls_mpi_mul_mpi
    mbedtls_mpi_mul_mpi
        0x080066d0:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x080066d4:    b086        ..      SUB      sp,sp,#0x18
        0x080066d6:    4680        .F      MOV      r8,r0
        0x080066d8:    4616        .F      MOV      r6,r2
        0x080066da:    460f        .F      MOV      r7,r1
        0x080066dc:    4668        hF      MOV      r0,sp
        0x080066de:    f7fffe4b    ..K.    BL       mbedtls_mpi_init ; 0x8006378
        0x080066e2:    a803        ..      ADD      r0,sp,#0xc
        0x080066e4:    f7fffe48    ..H.    BL       mbedtls_mpi_init ; 0x8006378
        0x080066e8:    45b8        .E      CMP      r8,r7
        0x080066ea:    d107        ..      BNE      0x80066fc ; mbedtls_mpi_mul_mpi + 44
        0x080066ec:    4639        9F      MOV      r1,r7
        0x080066ee:    4668        hF      MOV      r0,sp
        0x080066f0:    f7fffb88    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x080066f4:    ea5f0900    _...    MOVS     r9,r0
        0x080066f8:    d141        A.      BNE      0x800677e ; mbedtls_mpi_mul_mpi + 174
        0x080066fa:    466f        oF      MOV      r7,sp
        0x080066fc:    45b0        .E      CMP      r8,r6
        0x080066fe:    d107        ..      BNE      0x8006710 ; mbedtls_mpi_mul_mpi + 64
        0x08006700:    4631        1F      MOV      r1,r6
        0x08006702:    a803        ..      ADD      r0,sp,#0xc
        0x08006704:    f7fffb7e    ..~.    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08006708:    ea5f0900    _...    MOVS     r9,r0
        0x0800670c:    d137        7.      BNE      0x800677e ; mbedtls_mpi_mul_mpi + 174
        0x0800670e:    ae03        ..      ADD      r6,sp,#0xc
        0x08006710:    687d        }h      LDR      r5,[r7,#4]
        0x08006712:    f06f0a03    o...    MVN      r10,#3
        0x08006716:    b13d        =.      CBZ      r5,0x8006728 ; mbedtls_mpi_mul_mpi + 88
        0x08006718:    68b9        .h      LDR      r1,[r7,#8]
        0x0800671a:    4650        PF      MOV      r0,r10
        0x0800671c:    eb000285    ....    ADD      r2,r0,r5,LSL #2
        0x08006720:    588a        .X      LDR      r2,[r1,r2]
        0x08006722:    b90a        ..      CBNZ     r2,0x8006728 ; mbedtls_mpi_mul_mpi + 88
        0x08006724:    1e6d        m.      SUBS     r5,r5,#1
        0x08006726:    d1f9        ..      BNE      0x800671c ; mbedtls_mpi_mul_mpi + 76
        0x08006728:    6874        th      LDR      r4,[r6,#4]
        0x0800672a:    b13c        <.      CBZ      r4,0x800673c ; mbedtls_mpi_mul_mpi + 108
        0x0800672c:    68b1        .h      LDR      r1,[r6,#8]
        0x0800672e:    4650        PF      MOV      r0,r10
        0x08006730:    eb000284    ....    ADD      r2,r0,r4,LSL #2
        0x08006734:    588a        .X      LDR      r2,[r1,r2]
        0x08006736:    b90a        ..      CBNZ     r2,0x800673c ; mbedtls_mpi_mul_mpi + 108
        0x08006738:    1e64        d.      SUBS     r4,r4,#1
        0x0800673a:    d1f9        ..      BNE      0x8006730 ; mbedtls_mpi_mul_mpi + 96
        0x0800673c:    1929        ).      ADDS     r1,r5,r4
        0x0800673e:    4640        @F      MOV      r0,r8
        0x08006740:    f7fffdf2    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x08006744:    ea5f0900    _...    MOVS     r9,r0
        0x08006748:    d119        ..      BNE      0x800677e ; mbedtls_mpi_mul_mpi + 174
        0x0800674a:    2100        .!      MOVS     r1,#0
        0x0800674c:    4640        @F      MOV      r0,r8
        0x0800674e:    f7ffff65    ..e.    BL       mbedtls_mpi_lset ; 0x800661c
        0x08006752:    ea5f0900    _...    MOVS     r9,r0
        0x08006756:    d112        ..      BNE      0x800677e ; mbedtls_mpi_mul_mpi + 174
        0x08006758:    b164        d.      CBZ      r4,0x8006774 ; mbedtls_mpi_mul_mpi + 164
        0x0800675a:    68b1        .h      LDR      r1,[r6,#8]
        0x0800675c:    eb0a0084    ....    ADD      r0,r10,r4,LSL #2
        0x08006760:    580b        .X      LDR      r3,[r1,r0]
        0x08006762:    f8d81008    ....    LDR      r1,[r8,#8]
        0x08006766:    180a        ..      ADDS     r2,r1,r0
        0x08006768:    4628        (F      MOV      r0,r5
        0x0800676a:    68b9        .h      LDR      r1,[r7,#8]
        0x0800676c:    f000fc76    ..v.    BL       mpi_mul_hlp ; 0x800705c
        0x08006770:    1e64        d.      SUBS     r4,r4,#1
        0x08006772:    e7f1        ..      B        0x8006758 ; mbedtls_mpi_mul_mpi + 136
        0x08006774:    6838        8h      LDR      r0,[r7,#0]
        0x08006776:    6831        1h      LDR      r1,[r6,#0]
        0x08006778:    4348        HC      MULS     r0,r1,r0
        0x0800677a:    f8c80000    ....    STR      r0,[r8,#0]
        0x0800677e:    a803        ..      ADD      r0,sp,#0xc
        0x08006780:    f7fffd31    ..1.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08006784:    4668        hF      MOV      r0,sp
        0x08006786:    f7fffd2e    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x0800678a:    b006        ..      ADD      sp,sp,#0x18
        0x0800678c:    4648        HF      MOV      r0,r9
        0x0800678e:    e8bd87f0    ....    POP      {r4-r10,pc}
    i.mbedtls_mpi_read_binary
    mbedtls_mpi_read_binary
        0x08006792:    e92d47f0    -..G    PUSH     {r4-r10,lr}
        0x08006796:    4606        .F      MOV      r6,r0
        0x08006798:    4615        .F      MOV      r5,r2
        0x0800679a:    4689        .F      MOV      r9,r1
        0x0800679c:    0790        ..      LSLS     r0,r2,#30
        0x0800679e:    d000        ..      BEQ      0x80067a2 ; mbedtls_mpi_read_binary + 16
        0x080067a0:    2001        .       MOVS     r0,#1
        0x080067a2:    eb000495    ....    ADD      r4,r0,r5,LSR #2
        0x080067a6:    6870        ph      LDR      r0,[r6,#4]
        0x080067a8:    ebc50884    ....    RSB      r8,r5,r4,LSL #2
        0x080067ac:    42a0        .B      CMP      r0,r4
        0x080067ae:    d00b        ..      BEQ      0x80067c8 ; mbedtls_mpi_read_binary + 54
        0x080067b0:    4630        0F      MOV      r0,r6
        0x080067b2:    f7fffd18    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x080067b6:    4630        0F      MOV      r0,r6
        0x080067b8:    f7fffdde    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x080067bc:    4621        !F      MOV      r1,r4
        0x080067be:    4630        0F      MOV      r0,r6
        0x080067c0:    f7fffdb2    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x080067c4:    0007        ..      MOVS     r7,r0
        0x080067c6:    d112        ..      BNE      0x80067ee ; mbedtls_mpi_read_binary + 92
        0x080067c8:    2100        .!      MOVS     r1,#0
        0x080067ca:    4630        0F      MOV      r0,r6
        0x080067cc:    f7ffff26    ..&.    BL       mbedtls_mpi_lset ; 0x800661c
        0x080067d0:    0007        ..      MOVS     r7,r0
        0x080067d2:    d10c        ..      BNE      0x80067ee ; mbedtls_mpi_read_binary + 92
        0x080067d4:    f1b90f00    ....    CMP      r9,#0
        0x080067d8:    d009        ..      BEQ      0x80067ee ; mbedtls_mpi_read_binary + 92
        0x080067da:    68b0        .h      LDR      r0,[r6,#8]
        0x080067dc:    462a        *F      MOV      r2,r5
        0x080067de:    4440        @D      ADD      r0,r0,r8
        0x080067e0:    4649        IF      MOV      r1,r9
        0x080067e2:    f7f9fe17    ....    BL       __aeabi_memcpy ; 0x8000414
        0x080067e6:    4621        !F      MOV      r1,r4
        0x080067e8:    68b0        .h      LDR      r0,[r6,#8]
        0x080067ea:    f000fc07    ....    BL       mpi_bigendian_to_host ; 0x8006ffc
        0x080067ee:    4638        8F      MOV      r0,r7
        0x080067f0:    e8bd87f0    ....    POP      {r4-r10,pc}
    i.mbedtls_mpi_read_binary_le
    mbedtls_mpi_read_binary_le
        0x080067f4:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x080067f8:    4605        .F      MOV      r5,r0
        0x080067fa:    4614        .F      MOV      r4,r2
        0x080067fc:    460e        .F      MOV      r6,r1
        0x080067fe:    0790        ..      LSLS     r0,r2,#30
        0x08006800:    d000        ..      BEQ      0x8006804 ; mbedtls_mpi_read_binary_le + 16
        0x08006802:    2001        .       MOVS     r0,#1
        0x08006804:    eb000794    ....    ADD      r7,r0,r4,LSR #2
        0x08006808:    6868        hh      LDR      r0,[r5,#4]
        0x0800680a:    42b8        .B      CMP      r0,r7
        0x0800680c:    d00b        ..      BEQ      0x8006826 ; mbedtls_mpi_read_binary_le + 50
        0x0800680e:    4628        (F      MOV      r0,r5
        0x08006810:    f7fffce9    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08006814:    4628        (F      MOV      r0,r5
        0x08006816:    f7fffdaf    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x0800681a:    4639        9F      MOV      r1,r7
        0x0800681c:    4628        (F      MOV      r0,r5
        0x0800681e:    f7fffd83    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x08006822:    2800        .(      CMP      r0,#0
        0x08006824:    d11a        ..      BNE      0x800685c ; mbedtls_mpi_read_binary_le + 104
        0x08006826:    2100        .!      MOVS     r1,#0
        0x08006828:    4628        (F      MOV      r0,r5
        0x0800682a:    f7fffef7    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x0800682e:    2800        .(      CMP      r0,#0
        0x08006830:    d114        ..      BNE      0x800685c ; mbedtls_mpi_read_binary_le + 104
        0x08006832:    2300        .#      MOVS     r3,#0
        0x08006834:    e010        ..      B        0x8006858 ; mbedtls_mpi_read_binary_le + 100
        0x08006836:    bf00        ..      NOP      
        0x08006838:    68aa        .h      LDR      r2,[r5,#8]
        0x0800683a:    f0230103    #...    BIC      r1,r3,#3
        0x0800683e:    f816c003    ....    LDRB     r12,[r6,r3]
        0x08006842:    ea4f7e83    O..~    LSL      lr,r3,#30
        0x08006846:    ea4f6ede    O..n    LSR      lr,lr,#27
        0x0800684a:    5857        WX      LDR      r7,[r2,r1]
        0x0800684c:    fa0cfc0e    ....    LSL      r12,r12,lr
        0x08006850:    ea47070c    G...    ORR      r7,r7,r12
        0x08006854:    5057        WP      STR      r7,[r2,r1]
        0x08006856:    1c5b        [.      ADDS     r3,r3,#1
        0x08006858:    42a3        .B      CMP      r3,r4
        0x0800685a:    d3ed        ..      BCC      0x8006838 ; mbedtls_mpi_read_binary_le + 68
        0x0800685c:    e8bd81f0    ....    POP      {r4-r8,pc}
    i.mbedtls_mpi_read_string
    mbedtls_mpi_read_string
        0x08006860:    e92d47ff    -..G    PUSH     {r0-r10,lr}
        0x08006864:    4680        .F      MOV      r8,r0
        0x08006866:    1e88        ..      SUBS     r0,r1,#2
        0x08006868:    4616        .F      MOV      r6,r2
        0x0800686a:    4689        .F      MOV      r9,r1
        0x0800686c:    f06f0403    o...    MVN      r4,#3
        0x08006870:    280f        .(      CMP      r0,#0xf
        0x08006872:    d215        ..      BCS      0x80068a0 ; mbedtls_mpi_read_string + 64
        0x08006874:    4668        hF      MOV      r0,sp
        0x08006876:    f7fffd7f    ....    BL       mbedtls_mpi_init ; 0x8006378
        0x0800687a:    4630        0F      MOV      r0,r6
        0x0800687c:    f7f9fdab    ....    BL       strlen ; 0x80003d6
        0x08006880:    4605        .F      MOV      r5,r0
        0x08006882:    f04f3aff    O..:    MOV      r10,#0xffffffff
        0x08006886:    f1b90f10    ....    CMP      r9,#0x10
        0x0800688a:    d006        ..      BEQ      0x800689a ; mbedtls_mpi_read_string + 58
        0x0800688c:    2100        .!      MOVS     r1,#0
        0x0800688e:    4640        @F      MOV      r0,r8
        0x08006890:    f7fffec4    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x08006894:    0004        ..      MOVS     r4,r0
        0x08006896:    d16b        k.      BNE      0x8006970 ; mbedtls_mpi_read_string + 272
        0x08006898:    e03e        >.      B        0x8006918 ; mbedtls_mpi_read_string + 184
        0x0800689a:    f1b54f80    ...O    CMP      r5,#0x40000000
        0x0800689e:    d303        ..      BCC      0x80068a8 ; mbedtls_mpi_read_string + 72
        0x080068a0:    b004        ..      ADD      sp,sp,#0x10
        0x080068a2:    4620         F      MOV      r0,r4
        0x080068a4:    e8bd87f0    ....    POP      {r4-r10,pc}
        0x080068a8:    0768        h.      LSLS     r0,r5,#29
        0x080068aa:    d000        ..      BEQ      0x80068ae ; mbedtls_mpi_read_string + 78
        0x080068ac:    2001        .       MOVS     r0,#1
        0x080068ae:    f3c501da    ....    UBFX     r1,r5,#3,#27
        0x080068b2:    4401        .D      ADD      r1,r1,r0
        0x080068b4:    4640        @F      MOV      r0,r8
        0x080068b6:    f7fffd37    ..7.    BL       mbedtls_mpi_grow ; 0x8006328
        0x080068ba:    0004        ..      MOVS     r4,r0
        0x080068bc:    d158        X.      BNE      0x8006970 ; mbedtls_mpi_read_string + 272
        0x080068be:    2100        .!      MOVS     r1,#0
        0x080068c0:    4640        @F      MOV      r0,r8
        0x080068c2:    f7fffeab    ....    BL       mbedtls_mpi_lset ; 0x800661c
        0x080068c6:    0004        ..      MOVS     r4,r0
        0x080068c8:    d152        R.      BNE      0x8006970 ; mbedtls_mpi_read_string + 272
        0x080068ca:    2700        .'      MOVS     r7,#0
        0x080068cc:    e021        !.      B        0x8006912 ; mbedtls_mpi_read_string + 178
        0x080068ce:    2d01        .-      CMP      r5,#1
        0x080068d0:    d102        ..      BNE      0x80068d8 ; mbedtls_mpi_read_string + 120
        0x080068d2:    7830        0x      LDRB     r0,[r6,#0]
        0x080068d4:    282d        -(      CMP      r0,#0x2d
        0x080068d6:    d009        ..      BEQ      0x80068ec ; mbedtls_mpi_read_string + 140
        0x080068d8:    1970        p.      ADDS     r0,r6,r5
        0x080068da:    4649        IF      MOV      r1,r9
