openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x080068dc:    f8102c01    ...,    LDRB     r2,[r0,#-1]
        0x080068e0:    a803        ..      ADD      r0,sp,#0xc
        0x080068e2:    f000fba0    ....    BL       mpi_get_digit ; 0x8007026
        0x080068e6:    0004        ..      MOVS     r4,r0
        0x080068e8:    d142        B.      BNE      0x8006970 ; mbedtls_mpi_read_string + 272
        0x080068ea:    e002        ..      B        0x80068f2 ; mbedtls_mpi_read_string + 146
        0x080068ec:    f8c8a000    ....    STR      r10,[r8,#0]
        0x080068f0:    e03e        >.      B        0x8006970 ; mbedtls_mpi_read_string + 272
        0x080068f2:    08f9        ..      LSRS     r1,r7,#3
        0x080068f4:    077b        {.      LSLS     r3,r7,#29
        0x080068f6:    f8d80008    ....    LDR      r0,[r8,#8]
        0x080068fa:    ea4f6cd3    O..l    LSR      r12,r3,#27
        0x080068fe:    9b03        ..      LDR      r3,[sp,#0xc]
        0x08006900:    f8502021    P.!     LDR      r2,[r0,r1,LSL #2]
        0x08006904:    fa03f30c    ....    LSL      r3,r3,r12
        0x08006908:    431a        .C      ORRS     r2,r2,r3
        0x0800690a:    1e6d        m.      SUBS     r5,r5,#1
        0x0800690c:    f8402021    @.!     STR      r2,[r0,r1,LSL #2]
        0x08006910:    1c7f        ..      ADDS     r7,r7,#1
        0x08006912:    2d00        .-      CMP      r5,#0
        0x08006914:    d1db        ..      BNE      0x80068ce ; mbedtls_mpi_read_string + 110
        0x08006916:    e02b        +.      B        0x8006970 ; mbedtls_mpi_read_string + 272
        0x08006918:    2700        .'      MOVS     r7,#0
        0x0800691a:    2d00        .-      CMP      r5,#0
        0x0800691c:    d801        ..      BHI      0x8006922 ; mbedtls_mpi_read_string + 194
        0x0800691e:    e027        '.      B        0x8006970 ; mbedtls_mpi_read_string + 272
        0x08006920:    b917        ..      CBNZ     r7,0x8006928 ; mbedtls_mpi_read_string + 200
        0x08006922:    7830        0x      LDRB     r0,[r6,#0]
        0x08006924:    282d        -(      CMP      r0,#0x2d
        0x08006926:    d007        ..      BEQ      0x8006938 ; mbedtls_mpi_read_string + 216
        0x08006928:    5df2        .]      LDRB     r2,[r6,r7]
        0x0800692a:    4649        IF      MOV      r1,r9
        0x0800692c:    a803        ..      ADD      r0,sp,#0xc
        0x0800692e:    f000fb7a    ..z.    BL       mpi_get_digit ; 0x8007026
        0x08006932:    0004        ..      MOVS     r4,r0
        0x08006934:    d11c        ..      BNE      0x8006970 ; mbedtls_mpi_read_string + 272
        0x08006936:    e002        ..      B        0x800693e ; mbedtls_mpi_read_string + 222
        0x08006938:    f8c8a000    ....    STR      r10,[r8,#0]
        0x0800693c:    e015        ..      B        0x800696a ; mbedtls_mpi_read_string + 266
        0x0800693e:    464a        JF      MOV      r2,r9
        0x08006940:    4641        AF      MOV      r1,r8
        0x08006942:    4668        hF      MOV      r0,sp
        0x08006944:    f7fffeb8    ....    BL       mbedtls_mpi_mul_int ; 0x80066b8
        0x08006948:    0004        ..      MOVS     r4,r0
        0x0800694a:    d111        ..      BNE      0x8006970 ; mbedtls_mpi_read_string + 272
        0x0800694c:    f8d80000    ....    LDR      r0,[r8,#0]
        0x08006950:    9a03        ..      LDR      r2,[sp,#0xc]
        0x08006952:    2801        .(      CMP      r0,#1
        0x08006954:    4669        iF      MOV      r1,sp
        0x08006956:    4640        @F      MOV      r0,r8
        0x08006958:    d004        ..      BEQ      0x8006964 ; mbedtls_mpi_read_string + 260
        0x0800695a:    f000f9b7    ....    BL       mbedtls_mpi_sub_int ; 0x8006ccc
        0x0800695e:    0004        ..      MOVS     r4,r0
        0x08006960:    d106        ..      BNE      0x8006970 ; mbedtls_mpi_read_string + 272
        0x08006962:    e002        ..      B        0x800696a ; mbedtls_mpi_read_string + 266
        0x08006964:    f7fff960    ..`.    BL       mbedtls_mpi_add_int ; 0x8005c28
        0x08006968:    e7f9        ..      B        0x800695e ; mbedtls_mpi_read_string + 254
        0x0800696a:    1c7f        ..      ADDS     r7,r7,#1
        0x0800696c:    42af        .B      CMP      r7,r5
        0x0800696e:    d3d7        ..      BCC      0x8006920 ; mbedtls_mpi_read_string + 192
        0x08006970:    4668        hF      MOV      r0,sp
        0x08006972:    f7fffc38    ..8.    BL       mbedtls_mpi_free ; 0x80061e6
        0x08006976:    e793        ..      B        0x80068a0 ; mbedtls_mpi_read_string + 64
    i.mbedtls_mpi_safe_cond_assign
    mbedtls_mpi_safe_cond_assign
        0x08006978:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x0800697c:    4604        .F      MOV      r4,r0
        0x0800697e:    4250        PB      RSBS     r0,r2,#0
        0x08006980:    b2c0        ..      UXTB     r0,r0
        0x08006982:    4310        .C      ORRS     r0,r0,r2
        0x08006984:    460d        .F      MOV      r5,r1
        0x08006986:    09c6        ..      LSRS     r6,r0,#7
        0x08006988:    6849        Ih      LDR      r1,[r1,#4]
        0x0800698a:    4620         F      MOV      r0,r4
        0x0800698c:    f7fffccc    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x08006990:    0001        ..      MOVS     r1,r0
        0x08006992:    d124        $.      BNE      0x80069de ; mbedtls_mpi_safe_cond_assign + 102
        0x08006994:    6822        "h      LDR      r2,[r4,#0]
        0x08006996:    f1c60001    ....    RSB      r0,r6,#1
        0x0800699a:    682b        +h      LDR      r3,[r5,#0]
        0x0800699c:    4342        BC      MULS     r2,r0,r2
        0x0800699e:    fb032206    ..."    MLA      r2,r3,r6,r2
        0x080069a2:    6022        "`      STR      r2,[r4,#0]
        0x080069a4:    2200        ."      MOVS     r2,#0
        0x080069a6:    e00c        ..      B        0x80069c2 ; mbedtls_mpi_safe_cond_assign + 74
        0x080069a8:    68a3        .h      LDR      r3,[r4,#8]
        0x080069aa:    f8d5c008    ....    LDR      r12,[r5,#8]
        0x080069ae:    f8537022    S."p    LDR      r7,[r3,r2,LSL #2]
        0x080069b2:    f85cc022    \.".    LDR      r12,[r12,r2,LSL #2]
        0x080069b6:    4347        GC      MULS     r7,r0,r7
        0x080069b8:    fb0c7706    ...w    MLA      r7,r12,r6,r7
        0x080069bc:    f8437022    C."p    STR      r7,[r3,r2,LSL #2]
        0x080069c0:    1c52        R.      ADDS     r2,r2,#1
        0x080069c2:    686b        kh      LDR      r3,[r5,#4]
        0x080069c4:    4293        .B      CMP      r3,r2
        0x080069c6:    d8ef        ..      BHI      0x80069a8 ; mbedtls_mpi_safe_cond_assign + 48
        0x080069c8:    e006        ..      B        0x80069d8 ; mbedtls_mpi_safe_cond_assign + 96
        0x080069ca:    68a3        .h      LDR      r3,[r4,#8]
        0x080069cc:    f8535022    S."P    LDR      r5,[r3,r2,LSL #2]
        0x080069d0:    4345        EC      MULS     r5,r0,r5
        0x080069d2:    f8435022    C."P    STR      r5,[r3,r2,LSL #2]
        0x080069d6:    1c52        R.      ADDS     r2,r2,#1
        0x080069d8:    6863        ch      LDR      r3,[r4,#4]
        0x080069da:    4293        .B      CMP      r3,r2
        0x080069dc:    d8f5        ..      BHI      0x80069ca ; mbedtls_mpi_safe_cond_assign + 82
        0x080069de:    4608        .F      MOV      r0,r1
        0x080069e0:    e8bd81f0    ....    POP      {r4-r8,pc}
    i.mbedtls_mpi_safe_cond_swap
    mbedtls_mpi_safe_cond_swap
        0x080069e4:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x080069e8:    460c        .F      MOV      r4,r1
        0x080069ea:    4605        .F      MOV      r5,r0
        0x080069ec:    42a0        .B      CMP      r0,r4
        0x080069ee:    d102        ..      BNE      0x80069f6 ; mbedtls_mpi_safe_cond_swap + 18
        0x080069f0:    2000        .       MOVS     r0,#0
        0x080069f2:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x080069f6:    4250        PB      RSBS     r0,r2,#0
        0x080069f8:    b2c0        ..      UXTB     r0,r0
        0x080069fa:    4310        .C      ORRS     r0,r0,r2
        0x080069fc:    09c6        ..      LSRS     r6,r0,#7
        0x080069fe:    4628        (F      MOV      r0,r5
        0x08006a00:    6861        ah      LDR      r1,[r4,#4]
        0x08006a02:    f7fffc91    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x08006a06:    0003        ..      MOVS     r3,r0
        0x08006a08:    d12f        /.      BNE      0x8006a6a ; mbedtls_mpi_safe_cond_swap + 134
        0x08006a0a:    4620         F      MOV      r0,r4
        0x08006a0c:    6869        ih      LDR      r1,[r5,#4]
        0x08006a0e:    f7fffc8b    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x08006a12:    0003        ..      MOVS     r3,r0
        0x08006a14:    d129        ).      BNE      0x8006a6a ; mbedtls_mpi_safe_cond_swap + 134
        0x08006a16:    6828        (h      LDR      r0,[r5,#0]
        0x08006a18:    f1c60101    ....    RSB      r1,r6,#1
        0x08006a1c:    6827        'h      LDR      r7,[r4,#0]
        0x08006a1e:    fb00f201    ....    MUL      r2,r0,r1
        0x08006a22:    fb072206    ..."    MLA      r2,r7,r6,r2
        0x08006a26:    602a        *`      STR      r2,[r5,#0]
        0x08006a28:    6822        "h      LDR      r2,[r4,#0]
        0x08006a2a:    434a        JC      MULS     r2,r1,r2
        0x08006a2c:    fb002006    ...     MLA      r0,r0,r6,r2
        0x08006a30:    6020         `      STR      r0,[r4,#0]
        0x08006a32:    2000        .       MOVS     r0,#0
        0x08006a34:    e016        ..      B        0x8006a64 ; mbedtls_mpi_safe_cond_swap + 128
        0x08006a36:    68af        .h      LDR      r7,[r5,#8]
        0x08006a38:    f8d4e008    ....    LDR      lr,[r4,#8]
        0x08006a3c:    f8572020    W.      LDR      r2,[r7,r0,LSL #2]
        0x08006a40:    f85ee020    ^. .    LDR      lr,[lr,r0,LSL #2]
        0x08006a44:    fb02fc01    ....    MUL      r12,r2,r1
        0x08006a48:    fb0ecc06    ....    MLA      r12,lr,r6,r12
        0x08006a4c:    f847c020    G. .    STR      r12,[r7,r0,LSL #2]
        0x08006a50:    68a7        .h      LDR      r7,[r4,#8]
        0x08006a52:    f857c020    W. .    LDR      r12,[r7,r0,LSL #2]
        0x08006a56:    fb0cfc01    ....    MUL      r12,r12,r1
        0x08006a5a:    fb02c206    ....    MLA      r2,r2,r6,r12
        0x08006a5e:    f8472020    G.      STR      r2,[r7,r0,LSL #2]
        0x08006a62:    1c40        @.      ADDS     r0,r0,#1
        0x08006a64:    686a        jh      LDR      r2,[r5,#4]
        0x08006a66:    4282        .B      CMP      r2,r0
        0x08006a68:    d8e5        ..      BHI      0x8006a36 ; mbedtls_mpi_safe_cond_swap + 82
        0x08006a6a:    4618        .F      MOV      r0,r3
        0x08006a6c:    e7c1        ..      B        0x80069f2 ; mbedtls_mpi_safe_cond_swap + 14
    i.mbedtls_mpi_set_bit
    mbedtls_mpi_set_bit
        0x08006a6e:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08006a72:    4606        .F      MOV      r6,r0
        0x08006a74:    0015        ..      MOVS     r5,r2
        0x08006a76:    f04f0000    O...    MOV      r0,#0
        0x08006a7a:    ea4f1451    O.Q.    LSR      r4,r1,#5
        0x08006a7e:    f001071f    ....    AND      r7,r1,#0x1f
        0x08006a82:    d004        ..      BEQ      0x8006a8e ; mbedtls_mpi_set_bit + 32
        0x08006a84:    2d01        .-      CMP      r5,#1
        0x08006a86:    d002        ..      BEQ      0x8006a8e ; mbedtls_mpi_set_bit + 32
        0x08006a88:    1f00        ..      SUBS     r0,r0,#4
        0x08006a8a:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x08006a8e:    6872        rh      LDR      r2,[r6,#4]
        0x08006a90:    ebb11f42    ..B.    CMP      r1,r2,LSL #5
        0x08006a94:    d306        ..      BCC      0x8006aa4 ; mbedtls_mpi_set_bit + 54
        0x08006a96:    b19d        ..      CBZ      r5,0x8006ac0 ; mbedtls_mpi_set_bit + 82
        0x08006a98:    1c61        a.      ADDS     r1,r4,#1
        0x08006a9a:    4630        0F      MOV      r0,r6
        0x08006a9c:    f7fffc44    ..D.    BL       mbedtls_mpi_grow ; 0x8006328
        0x08006aa0:    2800        .(      CMP      r0,#0
        0x08006aa2:    d1f2        ..      BNE      0x8006a8a ; mbedtls_mpi_set_bit + 28
        0x08006aa4:    68b2        .h      LDR      r2,[r6,#8]
        0x08006aa6:    2301        .#      MOVS     r3,#1
        0x08006aa8:    40bb        .@      LSLS     r3,r3,r7
        0x08006aaa:    f8521024    R.$.    LDR      r1,[r2,r4,LSL #2]
        0x08006aae:    40bd        .@      LSLS     r5,r5,r7
        0x08006ab0:    4399        .C      BICS     r1,r1,r3
        0x08006ab2:    f8421024    B.$.    STR      r1,[r2,r4,LSL #2]
        0x08006ab6:    68b2        .h      LDR      r2,[r6,#8]
        0x08006ab8:    4329        )C      ORRS     r1,r1,r5
        0x08006aba:    f8421024    B.$.    STR      r1,[r2,r4,LSL #2]
        0x08006abe:    e7e4        ..      B        0x8006a8a ; mbedtls_mpi_set_bit + 28
        0x08006ac0:    2000        .       MOVS     r0,#0
        0x08006ac2:    e7e2        ..      B        0x8006a8a ; mbedtls_mpi_set_bit + 28
    i.mbedtls_mpi_shift_l
    mbedtls_mpi_shift_l
        0x08006ac4:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08006ac8:    4688        .F      MOV      r8,r1
        0x08006aca:    4606        .F      MOV      r6,r0
        0x08006acc:    2500        .%      MOVS     r5,#0
        0x08006ace:    094c        L.      LSRS     r4,r1,#5
        0x08006ad0:    f001071f    ....    AND      r7,r1,#0x1f
        0x08006ad4:    f7fff8e7    ....    BL       mbedtls_mpi_bitlen ; 0x8005ca6
        0x08006ad8:    6871        qh      LDR      r1,[r6,#4]
        0x08006ada:    4440        @D      ADD      r0,r0,r8
        0x08006adc:    ebb01f41    ..A.    CMP      r0,r1,LSL #5
        0x08006ae0:    d909        ..      BLS      0x8006af6 ; mbedtls_mpi_shift_l + 50
        0x08006ae2:    06c1        ..      LSLS     r1,r0,#27
        0x08006ae4:    d000        ..      BEQ      0x8006ae8 ; mbedtls_mpi_shift_l + 36
        0x08006ae6:    2101        .!      MOVS     r1,#1
        0x08006ae8:    eb011150    ..P.    ADD      r1,r1,r0,LSR #5
        0x08006aec:    4630        0F      MOV      r0,r6
        0x08006aee:    f7fffc1b    ....    BL       mbedtls_mpi_grow ; 0x8006328
        0x08006af2:    0002        ..      MOVS     r2,r0
        0x08006af4:    d132        2.      BNE      0x8006b5c ; mbedtls_mpi_shift_l + 152
        0x08006af6:    2200        ."      MOVS     r2,#0
        0x08006af8:    b1d4        ..      CBZ      r4,0x8006b30 ; mbedtls_mpi_shift_l + 108
        0x08006afa:    1f11        ..      SUBS     r1,r2,#4
        0x08006afc:    6870        ph      LDR      r0,[r6,#4]
        0x08006afe:    e00b        ..      B        0x8006b18 ; mbedtls_mpi_shift_l + 84
        0x08006b00:    eba00c04    ....    SUB      r12,r0,r4
        0x08006b04:    68b3        .h      LDR      r3,[r6,#8]
        0x08006b06:    eb010c8c    ....    ADD      r12,r1,r12,LSL #2
        0x08006b0a:    eb010880    ....    ADD      r8,r1,r0,LSL #2
        0x08006b0e:    f853c00c    S...    LDR      r12,[r3,r12]
        0x08006b12:    f843c008    C...    STR      r12,[r3,r8]
        0x08006b16:    1e40        @.      SUBS     r0,r0,#1
        0x08006b18:    42a0        .B      CMP      r0,r4
        0x08006b1a:    d8f1        ..      BHI      0x8006b00 ; mbedtls_mpi_shift_l + 60
        0x08006b1c:    b140        @.      CBZ      r0,0x8006b30 ; mbedtls_mpi_shift_l + 108
        0x08006b1e:    2300        .#      MOVS     r3,#0
        0x08006b20:    f8d6c008    ....    LDR      r12,[r6,#8]
        0x08006b24:    eb010880    ....    ADD      r8,r1,r0,LSL #2
        0x08006b28:    1e40        @.      SUBS     r0,r0,#1
        0x08006b2a:    f84c3008    L..0    STR      r3,[r12,r8]
        0x08006b2e:    d1f7        ..      BNE      0x8006b20 ; mbedtls_mpi_shift_l + 92
        0x08006b30:    b1a7        ..      CBZ      r7,0x8006b5c ; mbedtls_mpi_shift_l + 152
        0x08006b32:    f1c70c20    .. .    RSB      r12,r7,#0x20
        0x08006b36:    e00e        ..      B        0x8006b56 ; mbedtls_mpi_shift_l + 146
        0x08006b38:    68b3        .h      LDR      r3,[r6,#8]
        0x08006b3a:    f8530024    S.$.    LDR      r0,[r3,r4,LSL #2]
        0x08006b3e:    4601        .F      MOV      r1,r0
        0x08006b40:    fa20f00c     ...    LSR      r0,r0,r12
        0x08006b44:    40b9        .@      LSLS     r1,r1,r7
        0x08006b46:    f8431024    C.$.    STR      r1,[r3,r4,LSL #2]
        0x08006b4a:    68b3        .h      LDR      r3,[r6,#8]
        0x08006b4c:    4329        )C      ORRS     r1,r1,r5
        0x08006b4e:    4605        .F      MOV      r5,r0
        0x08006b50:    f8431024    C.$.    STR      r1,[r3,r4,LSL #2]
        0x08006b54:    1c64        d.      ADDS     r4,r4,#1
        0x08006b56:    6870        ph      LDR      r0,[r6,#4]
        0x08006b58:    42a0        .B      CMP      r0,r4
        0x08006b5a:    d8ed        ..      BHI      0x8006b38 ; mbedtls_mpi_shift_l + 116
        0x08006b5c:    4610        .F      MOV      r0,r2
        0x08006b5e:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x08006b62:    0000        ..      MOVS     r0,r0
    i.mbedtls_mpi_shift_r
    mbedtls_mpi_shift_r
        0x08006b64:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08006b68:    094a        J.      LSRS     r2,r1,#5
        0x08006b6a:    f001051f    ....    AND      r5,r1,#0x1f
        0x08006b6e:    6841        Ah      LDR      r1,[r0,#4]
        0x08006b70:    2300        .#      MOVS     r3,#0
        0x08006b72:    4291        .B      CMP      r1,r2
        0x08006b74:    d301        ..      BCC      0x8006b7a ; mbedtls_mpi_shift_r + 22
        0x08006b76:    d106        ..      BNE      0x8006b86 ; mbedtls_mpi_shift_r + 34
        0x08006b78:    b12d        -.      CBZ      r5,0x8006b86 ; mbedtls_mpi_shift_r + 34
        0x08006b7a:    e8bd41f0    ...A    POP      {r4-r8,lr}
        0x08006b7e:    f04f0100    O...    MOV      r1,#0
        0x08006b82:    f7ffbd4b    ..K.    B.W      mbedtls_mpi_lset ; 0x800661c
        0x08006b86:    b1aa        ..      CBZ      r2,0x8006bb4 ; mbedtls_mpi_shift_r + 80
        0x08006b88:    2100        .!      MOVS     r1,#0
        0x08006b8a:    e006        ..      B        0x8006b9a ; mbedtls_mpi_shift_r + 54
        0x08006b8c:    6884        .h      LDR      r4,[r0,#8]
        0x08006b8e:    188e        ..      ADDS     r6,r1,r2
        0x08006b90:    f8546026    T.&`    LDR      r6,[r4,r6,LSL #2]
        0x08006b94:    f8446021    D.!`    STR      r6,[r4,r1,LSL #2]
        0x08006b98:    1c49        I.      ADDS     r1,r1,#1
        0x08006b9a:    6844        Dh      LDR      r4,[r0,#4]
        0x08006b9c:    1aa4        ..      SUBS     r4,r4,r2
        0x08006b9e:    428c        .B      CMP      r4,r1
        0x08006ba0:    d8f4        ..      BHI      0x8006b8c ; mbedtls_mpi_shift_r + 40
        0x08006ba2:    2200        ."      MOVS     r2,#0
        0x08006ba4:    6844        Dh      LDR      r4,[r0,#4]
        0x08006ba6:    428c        .B      CMP      r4,r1
        0x08006ba8:    d904        ..      BLS      0x8006bb4 ; mbedtls_mpi_shift_r + 80
        0x08006baa:    6884        .h      LDR      r4,[r0,#8]
        0x08006bac:    f8442021    D.!     STR      r2,[r4,r1,LSL #2]
        0x08006bb0:    1c49        I.      ADDS     r1,r1,#1
        0x08006bb2:    e7f7        ..      B        0x8006ba4 ; mbedtls_mpi_shift_r + 64
        0x08006bb4:    b1a5        ..      CBZ      r5,0x8006be0 ; mbedtls_mpi_shift_r + 124
        0x08006bb6:    6844        Dh      LDR      r4,[r0,#4]
        0x08006bb8:    b194        ..      CBZ      r4,0x8006be0 ; mbedtls_mpi_shift_r + 124
        0x08006bba:    f06f0e03    o...    MVN      lr,#3
        0x08006bbe:    f1c50c20    .. .    RSB      r12,r5,#0x20
        0x08006bc2:    bf00        ..      NOP      
        0x08006bc4:    6887        .h      LDR      r7,[r0,#8]
        0x08006bc6:    eb0e0684    ....    ADD      r6,lr,r4,LSL #2
        0x08006bca:    59ba        .Y      LDR      r2,[r7,r6]
        0x08006bcc:    fa02f10c    ....    LSL      r1,r2,r12
        0x08006bd0:    40ea        .@      LSRS     r2,r2,r5
        0x08006bd2:    51ba        .Q      STR      r2,[r7,r6]
        0x08006bd4:    431a        .C      ORRS     r2,r2,r3
        0x08006bd6:    6887        .h      LDR      r7,[r0,#8]
        0x08006bd8:    460b        .F      MOV      r3,r1
        0x08006bda:    1e64        d.      SUBS     r4,r4,#1
        0x08006bdc:    51ba        .Q      STR      r2,[r7,r6]
        0x08006bde:    d1f1        ..      BNE      0x8006bc4 ; mbedtls_mpi_shift_r + 96
        0x08006be0:    2000        .       MOVS     r0,#0
        0x08006be2:    e8bd81f0    ....    POP      {r4-r8,pc}
    i.mbedtls_mpi_shrink
    mbedtls_mpi_shrink
        0x08006be6:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08006bea:    4605        .F      MOV      r5,r0
        0x08006bec:    f2427010    B..p    MOV      r0,#0x2710
        0x08006bf0:    f06f060f    o...    MVN      r6,#0xf
        0x08006bf4:    4281        .B      CMP      r1,r0
        0x08006bf6:    d82a        *.      BHI      0x8006c4e ; mbedtls_mpi_shrink + 104
        0x08006bf8:    686c        lh      LDR      r4,[r5,#4]
        0x08006bfa:    428c        .B      CMP      r4,r1
        0x08006bfc:    d804        ..      BHI      0x8006c08 ; mbedtls_mpi_shrink + 34
        0x08006bfe:    4628        (F      MOV      r0,r5
        0x08006c00:    e8bd41f0    ...A    POP      {r4-r8,lr}
        0x08006c04:    f7ffbb90    ....    B        mbedtls_mpi_grow ; 0x8006328
        0x08006c08:    1e64        d.      SUBS     r4,r4,#1
        0x08006c0a:    d005        ..      BEQ      0x8006c18 ; mbedtls_mpi_shrink + 50
        0x08006c0c:    68a8        .h      LDR      r0,[r5,#8]
        0x08006c0e:    f8502024    P.$     LDR      r2,[r0,r4,LSL #2]
        0x08006c12:    b90a        ..      CBNZ     r2,0x8006c18 ; mbedtls_mpi_shrink + 50
        0x08006c14:    1e64        d.      SUBS     r4,r4,#1
        0x08006c16:    d1fa        ..      BNE      0x8006c0e ; mbedtls_mpi_shrink + 40
        0x08006c18:    1c64        d.      ADDS     r4,r4,#1
        0x08006c1a:    428c        .B      CMP      r4,r1
        0x08006c1c:    d200        ..      BCS      0x8006c20 ; mbedtls_mpi_shrink + 58
        0x08006c1e:    460c        .F      MOV      r4,r1
        0x08006c20:    2104        .!      MOVS     r1,#4
        0x08006c22:    4620         F      MOV      r0,r4
        0x08006c24:    f7f9faf6    ....    BL       calloc ; 0x8000214
        0x08006c28:    0007        ..      MOVS     r7,r0
        0x08006c2a:    d010        ..      BEQ      0x8006c4e ; mbedtls_mpi_shrink + 104
        0x08006c2c:    68a9        .h      LDR      r1,[r5,#8]
        0x08006c2e:    b149        I.      CBZ      r1,0x8006c44 ; mbedtls_mpi_shrink + 94
        0x08006c30:    00a2        ..      LSLS     r2,r4,#2
        0x08006c32:    f7f9fc34    ..4.    BL       __aeabi_memcpy4 ; 0x800049e
        0x08006c36:    e9d51001    ....    LDRD     r1,r0,[r5,#4]
        0x08006c3a:    f7fbf9de    ....    BL       mbedtls_mpi_zeroize ; 0x8001ffa
        0x08006c3e:    68a8        .h      LDR      r0,[r5,#8]
        0x08006c40:    f7f9fb2b    ..+.    BL       free ; 0x800029a
        0x08006c44:    e9c54701    ...G    STRD     r4,r7,[r5,#4]
