openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08006c48:    2000        .       MOVS     r0,#0
        0x08006c4a:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x08006c4e:    4630        0F      MOV      r0,r6
        0x08006c50:    e7fb        ..      B        0x8006c4a ; mbedtls_mpi_shrink + 100
    i.mbedtls_mpi_size
    mbedtls_mpi_size
        0x08006c52:    b500        ..      PUSH     {lr}
        0x08006c54:    f7fff827    ..'.    BL       mbedtls_mpi_bitlen ; 0x8005ca6
        0x08006c58:    1dc0        ..      ADDS     r0,r0,#7
        0x08006c5a:    08c0        ..      LSRS     r0,r0,#3
        0x08006c5c:    bd00        ..      POP      {pc}
    i.mbedtls_mpi_sub_abs
    mbedtls_mpi_sub_abs
        0x08006c5e:    b5fe        ..      PUSH     {r1-r7,lr}
        0x08006c60:    460f        .F      MOV      r7,r1
        0x08006c62:    4605        .F      MOV      r5,r0
        0x08006c64:    4614        .F      MOV      r4,r2
        0x08006c66:    4611        .F      MOV      r1,r2
        0x08006c68:    4638        8F      MOV      r0,r7
        0x08006c6a:    f7fff83b    ..;.    BL       mbedtls_mpi_cmp_abs ; 0x8005ce4
        0x08006c6e:    2800        .(      CMP      r0,#0
        0x08006c70:    da02        ..      BGE      0x8006c78 ; mbedtls_mpi_sub_abs + 26
        0x08006c72:    f06f0009    o...    MVN      r0,#9
        0x08006c76:    bdfe        ..      POP      {r1-r7,pc}
        0x08006c78:    4668        hF      MOV      r0,sp
        0x08006c7a:    f7fffb7d    ..}.    BL       mbedtls_mpi_init ; 0x8006378
        0x08006c7e:    42a5        .B      CMP      r5,r4
        0x08006c80:    d106        ..      BNE      0x8006c90 ; mbedtls_mpi_sub_abs + 50
        0x08006c82:    4621        !F      MOV      r1,r4
        0x08006c84:    4668        hF      MOV      r0,sp
        0x08006c86:    f7fff8bd    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08006c8a:    0006        ..      MOVS     r6,r0
        0x08006c8c:    d119        ..      BNE      0x8006cc2 ; mbedtls_mpi_sub_abs + 100
        0x08006c8e:    466c        lF      MOV      r4,sp
        0x08006c90:    42bd        .B      CMP      r5,r7
        0x08006c92:    d005        ..      BEQ      0x8006ca0 ; mbedtls_mpi_sub_abs + 66
        0x08006c94:    4639        9F      MOV      r1,r7
        0x08006c96:    4628        (F      MOV      r0,r5
        0x08006c98:    f7fff8b4    ....    BL       mbedtls_mpi_copy ; 0x8005e04
        0x08006c9c:    0006        ..      MOVS     r6,r0
        0x08006c9e:    d110        ..      BNE      0x8006cc2 ; mbedtls_mpi_sub_abs + 100
        0x08006ca0:    2001        .       MOVS     r0,#1
        0x08006ca2:    6028        (`      STR      r0,[r5,#0]
        0x08006ca4:    6860        `h      LDR      r0,[r4,#4]
        0x08006ca6:    2600        .&      MOVS     r6,#0
        0x08006ca8:    b138        8.      CBZ      r0,0x8006cba ; mbedtls_mpi_sub_abs + 92
        0x08006caa:    68a1        .h      LDR      r1,[r4,#8]
        0x08006cac:    1f32        2.      SUBS     r2,r6,#4
        0x08006cae:    eb020380    ....    ADD      r3,r2,r0,LSL #2
        0x08006cb2:    58cb        .X      LDR      r3,[r1,r3]
        0x08006cb4:    b90b        ..      CBNZ     r3,0x8006cba ; mbedtls_mpi_sub_abs + 92
        0x08006cb6:    1e40        @.      SUBS     r0,r0,#1
        0x08006cb8:    d1f9        ..      BNE      0x8006cae ; mbedtls_mpi_sub_abs + 80
        0x08006cba:    68aa        .h      LDR      r2,[r5,#8]
        0x08006cbc:    68a1        .h      LDR      r1,[r4,#8]
        0x08006cbe:    f000fb8e    ....    BL       mpi_sub_hlp ; 0x80073de
        0x08006cc2:    4668        hF      MOV      r0,sp
        0x08006cc4:    f7fffa8f    ....    BL       mbedtls_mpi_free ; 0x80061e6
        0x08006cc8:    4630        0F      MOV      r0,r6
        0x08006cca:    bdfe        ..      POP      {r1-r7,pc}
    i.mbedtls_mpi_sub_int
    mbedtls_mpi_sub_int
        0x08006ccc:    b51f        ..      PUSH     {r0-r4,lr}
        0x08006cce:    2a00        .*      CMP      r2,#0
        0x08006cd0:    da02        ..      BGE      0x8006cd8 ; mbedtls_mpi_sub_int + 12
        0x08006cd2:    bf00        ..      NOP      
        0x08006cd4:    f1c20200    ....    RSB      r2,r2,#0
        0x08006cd8:    9203        ..      STR      r2,[sp,#0xc]
        0x08006cda:    da02        ..      BGE      0x8006ce2 ; mbedtls_mpi_sub_int + 22
        0x08006cdc:    f04f32ff    O..2    MOV      r2,#0xffffffff
        0x08006ce0:    e001        ..      B        0x8006ce6 ; mbedtls_mpi_sub_int + 26
        0x08006ce2:    f04f0201    O...    MOV      r2,#1
        0x08006ce6:    9200        ..      STR      r2,[sp,#0]
        0x08006ce8:    f04f0201    O...    MOV      r2,#1
        0x08006cec:    9201        ..      STR      r2,[sp,#4]
        0x08006cee:    aa03        ..      ADD      r2,sp,#0xc
        0x08006cf0:    9202        ..      STR      r2,[sp,#8]
        0x08006cf2:    466a        jF      MOV      r2,sp
        0x08006cf4:    f000f802    ....    BL       mbedtls_mpi_sub_mpi ; 0x8006cfc
        0x08006cf8:    b004        ..      ADD      sp,sp,#0x10
        0x08006cfa:    bd10        ..      POP      {r4,pc}
    i.mbedtls_mpi_sub_mpi
    mbedtls_mpi_sub_mpi
        0x08006cfc:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08006d00:    4605        .F      MOV      r5,r0
        0x08006d02:    680c        .h      LDR      r4,[r1,#0]
        0x08006d04:    6810        .h      LDR      r0,[r2,#0]
        0x08006d06:    4617        .F      MOV      r7,r2
        0x08006d08:    4360        `C      MULS     r0,r4,r0
        0x08006d0a:    460e        .F      MOV      r6,r1
        0x08006d0c:    2800        .(      CMP      r0,#0
        0x08006d0e:    dd19        ..      BLE      0x8006d44 ; mbedtls_mpi_sub_mpi + 72
        0x08006d10:    4611        .F      MOV      r1,r2
        0x08006d12:    4630        0F      MOV      r0,r6
        0x08006d14:    f7feffe6    ....    BL       mbedtls_mpi_cmp_abs ; 0x8005ce4
        0x08006d18:    2800        .(      CMP      r0,#0
        0x08006d1a:    db09        ..      BLT      0x8006d30 ; mbedtls_mpi_sub_mpi + 52
        0x08006d1c:    463a        :F      MOV      r2,r7
        0x08006d1e:    4631        1F      MOV      r1,r6
        0x08006d20:    4628        (F      MOV      r0,r5
        0x08006d22:    f7ffff9c    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08006d26:    2800        .(      CMP      r0,#0
        0x08006d28:    d100        ..      BNE      0x8006d2c ; mbedtls_mpi_sub_mpi + 48
        0x08006d2a:    602c        ,`      STR      r4,[r5,#0]
        0x08006d2c:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x08006d30:    4632        2F      MOV      r2,r6
        0x08006d32:    4639        9F      MOV      r1,r7
        0x08006d34:    4628        (F      MOV      r0,r5
        0x08006d36:    f7ffff92    ....    BL       mbedtls_mpi_sub_abs ; 0x8006c5e
        0x08006d3a:    2800        .(      CMP      r0,#0
        0x08006d3c:    d1f6        ..      BNE      0x8006d2c ; mbedtls_mpi_sub_mpi + 48
        0x08006d3e:    4261        aB      RSBS     r1,r4,#0
        0x08006d40:    6029        )`      STR      r1,[r5,#0]
        0x08006d42:    e7f3        ..      B        0x8006d2c ; mbedtls_mpi_sub_mpi + 48
        0x08006d44:    4628        (F      MOV      r0,r5
        0x08006d46:    f7feff13    ....    BL       mbedtls_mpi_add_abs ; 0x8005b70
        0x08006d4a:    e7ec        ..      B        0x8006d26 ; mbedtls_mpi_sub_mpi + 42
    i.mbedtls_platform_zeroize
    mbedtls_platform_zeroize
        0x08006d4c:    4b02        .K      LDR      r3,[pc,#8] ; [0x8006d58] = 0x2000003c
        0x08006d4e:    460a        .F      MOV      r2,r1
        0x08006d50:    2100        .!      MOVS     r1,#0
        0x08006d52:    681b        .h      LDR      r3,[r3,#0]
        0x08006d54:    4718        .G      BX       r3
    $d
        0x08006d56:    0000        ..      DCW    0
        0x08006d58:    2000003c    <..     DCD    536870972
    $t
    i.mbedtls_sha256_finish_ret
    mbedtls_sha256_finish_ret
        0x08006d5c:    b570        p.      PUSH     {r4-r6,lr}
        0x08006d5e:    4604        .F      MOV      r4,r0
        0x08006d60:    7800        .x      LDRB     r0,[r0,#0]
        0x08006d62:    460d        .F      MOV      r5,r1
        0x08006d64:    f000003f    ..?.    AND      r0,r0,#0x3f
        0x08006d68:    1822        ".      ADDS     r2,r4,r0
        0x08006d6a:    2180        .!      MOVS     r1,#0x80
        0x08006d6c:    1c40        @.      ADDS     r0,r0,#1
        0x08006d6e:    f8821028    ..(.    STRB     r1,[r2,#0x28]
        0x08006d72:    f1040628    ..(.    ADD      r6,r4,#0x28
        0x08006d76:    2838        8(      CMP      r0,#0x38
        0x08006d78:    d806        ..      BHI      0x8006d88 ; mbedtls_sha256_finish_ret + 44
        0x08006d7a:    f1c00138    ..8.    RSB      r1,r0,#0x38
        0x08006d7e:    4420         D      ADD      r0,r0,r4
        0x08006d80:    3028        (0      ADDS     r0,r0,#0x28
        0x08006d82:    f7f9fbc9    ....    BL       __aeabi_memclr ; 0x8000518
        0x08006d86:    e00f        ..      B        0x8006da8 ; mbedtls_sha256_finish_ret + 76
        0x08006d88:    f1c00140    ..@.    RSB      r1,r0,#0x40
        0x08006d8c:    4420         D      ADD      r0,r0,r4
        0x08006d8e:    3028        (0      ADDS     r0,r0,#0x28
        0x08006d90:    f7f9fbc2    ....    BL       __aeabi_memclr ; 0x8000518
        0x08006d94:    4631        1F      MOV      r1,r6
        0x08006d96:    4620         F      MOV      r0,r4
        0x08006d98:    f7fefacc    ....    BL       mbedtls_internal_sha256_process ; 0x8005334
        0x08006d9c:    2800        .(      CMP      r0,#0
        0x08006d9e:    d17f        ..      BNE      0x8006ea0 ; mbedtls_sha256_finish_ret + 324
        0x08006da0:    2138        8!      MOVS     r1,#0x38
        0x08006da2:    4630        0F      MOV      r0,r6
        0x08006da4:    f7f9fbda    ....    BL       __aeabi_memclr4 ; 0x800055c
        0x08006da8:    f8541b48    T.H.    LDR      r1,[r4],#0x48
        0x08006dac:    0f48        H.      LSRS     r0,r1,#29
        0x08006dae:    f8542c44    T.D,    LDR      r2,[r4,#-0x44]
        0x08006db2:    00c9        ..      LSLS     r1,r1,#3
        0x08006db4:    ea4000c2    @...    ORR      r0,r0,r2,LSL #3
        0x08006db8:    0e02        ..      LSRS     r2,r0,#24
        0x08006dba:    7622        "v      STRB     r2,[r4,#0x18]
        0x08006dbc:    0c02        ..      LSRS     r2,r0,#16
        0x08006dbe:    7662        bv      STRB     r2,[r4,#0x19]
        0x08006dc0:    0a02        ..      LSRS     r2,r0,#8
        0x08006dc2:    76a2        .v      STRB     r2,[r4,#0x1a]
        0x08006dc4:    76e0        .v      STRB     r0,[r4,#0x1b]
        0x08006dc6:    0e08        ..      LSRS     r0,r1,#24
        0x08006dc8:    7720         w      STRB     r0,[r4,#0x1c]
        0x08006dca:    0c08        ..      LSRS     r0,r1,#16
        0x08006dcc:    7760        `w      STRB     r0,[r4,#0x1d]
        0x08006dce:    0a08        ..      LSRS     r0,r1,#8
        0x08006dd0:    77a0        .w      STRB     r0,[r4,#0x1e]
        0x08006dd2:    77e1        .w      STRB     r1,[r4,#0x1f]
        0x08006dd4:    3c48        H<      SUBS     r4,r4,#0x48
        0x08006dd6:    4631        1F      MOV      r1,r6
        0x08006dd8:    4620         F      MOV      r0,r4
        0x08006dda:    f7fefaab    ....    BL       mbedtls_internal_sha256_process ; 0x8005334
        0x08006dde:    2800        .(      CMP      r0,#0
        0x08006de0:    d15e        ^.      BNE      0x8006ea0 ; mbedtls_sha256_finish_ret + 324
        0x08006de2:    68a0        .h      LDR      r0,[r4,#8]
        0x08006de4:    0e00        ..      LSRS     r0,r0,#24
        0x08006de6:    7028        (p      STRB     r0,[r5,#0]
        0x08006de8:    68a0        .h      LDR      r0,[r4,#8]
        0x08006dea:    0c00        ..      LSRS     r0,r0,#16
        0x08006dec:    7068        hp      STRB     r0,[r5,#1]
        0x08006dee:    8920         .      LDRH     r0,[r4,#8]
        0x08006df0:    0a00        ..      LSRS     r0,r0,#8
        0x08006df2:    70a8        .p      STRB     r0,[r5,#2]
        0x08006df4:    7a20         z      LDRB     r0,[r4,#8]
        0x08006df6:    70e8        .p      STRB     r0,[r5,#3]
        0x08006df8:    68e0        .h      LDR      r0,[r4,#0xc]
        0x08006dfa:    0e00        ..      LSRS     r0,r0,#24
        0x08006dfc:    7128        (q      STRB     r0,[r5,#4]
        0x08006dfe:    68e0        .h      LDR      r0,[r4,#0xc]
        0x08006e00:    0c00        ..      LSRS     r0,r0,#16
        0x08006e02:    7168        hq      STRB     r0,[r5,#5]
        0x08006e04:    89a0        ..      LDRH     r0,[r4,#0xc]
        0x08006e06:    0a00        ..      LSRS     r0,r0,#8
        0x08006e08:    71a8        .q      STRB     r0,[r5,#6]
        0x08006e0a:    7b20         {      LDRB     r0,[r4,#0xc]
        0x08006e0c:    71e8        .q      STRB     r0,[r5,#7]
        0x08006e0e:    6920         i      LDR      r0,[r4,#0x10]
        0x08006e10:    0e00        ..      LSRS     r0,r0,#24
        0x08006e12:    7228        (r      STRB     r0,[r5,#8]
        0x08006e14:    6920         i      LDR      r0,[r4,#0x10]
        0x08006e16:    0c00        ..      LSRS     r0,r0,#16
        0x08006e18:    7268        hr      STRB     r0,[r5,#9]
        0x08006e1a:    8a20         .      LDRH     r0,[r4,#0x10]
        0x08006e1c:    0a00        ..      LSRS     r0,r0,#8
        0x08006e1e:    72a8        .r      STRB     r0,[r5,#0xa]
        0x08006e20:    7c20         |      LDRB     r0,[r4,#0x10]
        0x08006e22:    72e8        .r      STRB     r0,[r5,#0xb]
        0x08006e24:    6960        `i      LDR      r0,[r4,#0x14]
        0x08006e26:    0e00        ..      LSRS     r0,r0,#24
        0x08006e28:    7328        (s      STRB     r0,[r5,#0xc]
        0x08006e2a:    6960        `i      LDR      r0,[r4,#0x14]
        0x08006e2c:    0c00        ..      LSRS     r0,r0,#16
        0x08006e2e:    7368        hs      STRB     r0,[r5,#0xd]
        0x08006e30:    8aa0        ..      LDRH     r0,[r4,#0x14]
        0x08006e32:    0a00        ..      LSRS     r0,r0,#8
        0x08006e34:    73a8        .s      STRB     r0,[r5,#0xe]
        0x08006e36:    7d20         }      LDRB     r0,[r4,#0x14]
        0x08006e38:    73e8        .s      STRB     r0,[r5,#0xf]
        0x08006e3a:    69a0        .i      LDR      r0,[r4,#0x18]
        0x08006e3c:    0e00        ..      LSRS     r0,r0,#24
        0x08006e3e:    7428        (t      STRB     r0,[r5,#0x10]
        0x08006e40:    69a0        .i      LDR      r0,[r4,#0x18]
        0x08006e42:    0c00        ..      LSRS     r0,r0,#16
        0x08006e44:    7468        ht      STRB     r0,[r5,#0x11]
        0x08006e46:    8b20         .      LDRH     r0,[r4,#0x18]
        0x08006e48:    0a00        ..      LSRS     r0,r0,#8
        0x08006e4a:    74a8        .t      STRB     r0,[r5,#0x12]
        0x08006e4c:    7e20         ~      LDRB     r0,[r4,#0x18]
        0x08006e4e:    74e8        .t      STRB     r0,[r5,#0x13]
        0x08006e50:    69e0        .i      LDR      r0,[r4,#0x1c]
        0x08006e52:    0e00        ..      LSRS     r0,r0,#24
        0x08006e54:    7528        (u      STRB     r0,[r5,#0x14]
        0x08006e56:    69e0        .i      LDR      r0,[r4,#0x1c]
        0x08006e58:    0c00        ..      LSRS     r0,r0,#16
        0x08006e5a:    7568        hu      STRB     r0,[r5,#0x15]
        0x08006e5c:    8ba0        ..      LDRH     r0,[r4,#0x1c]
        0x08006e5e:    0a00        ..      LSRS     r0,r0,#8
        0x08006e60:    75a8        .u      STRB     r0,[r5,#0x16]
        0x08006e62:    7f20         .      LDRB     r0,[r4,#0x1c]
        0x08006e64:    75e8        .u      STRB     r0,[r5,#0x17]
        0x08006e66:    6a20         j      LDR      r0,[r4,#0x20]
        0x08006e68:    0e00        ..      LSRS     r0,r0,#24
        0x08006e6a:    7628        (v      STRB     r0,[r5,#0x18]
        0x08006e6c:    6a20         j      LDR      r0,[r4,#0x20]
        0x08006e6e:    0c00        ..      LSRS     r0,r0,#16
        0x08006e70:    7668        hv      STRB     r0,[r5,#0x19]
        0x08006e72:    8c20         .      LDRH     r0,[r4,#0x20]
        0x08006e74:    0a00        ..      LSRS     r0,r0,#8
        0x08006e76:    76a8        .v      STRB     r0,[r5,#0x1a]
        0x08006e78:    f8940020    .. .    LDRB     r0,[r4,#0x20]
        0x08006e7c:    76e8        .v      STRB     r0,[r5,#0x1b]
        0x08006e7e:    6ea0        .n      LDR      r0,[r4,#0x68]
        0x08006e80:    b958        X.      CBNZ     r0,0x8006e9a ; mbedtls_sha256_finish_ret + 318
        0x08006e82:    6a60        `j      LDR      r0,[r4,#0x24]
        0x08006e84:    0e00        ..      LSRS     r0,r0,#24
        0x08006e86:    7728        (w      STRB     r0,[r5,#0x1c]
        0x08006e88:    6a60        `j      LDR      r0,[r4,#0x24]
        0x08006e8a:    0c00        ..      LSRS     r0,r0,#16
        0x08006e8c:    7768        hw      STRB     r0,[r5,#0x1d]
        0x08006e8e:    8ca0        ..      LDRH     r0,[r4,#0x24]
        0x08006e90:    0a00        ..      LSRS     r0,r0,#8
        0x08006e92:    77a8        .w      STRB     r0,[r5,#0x1e]
        0x08006e94:    f8940024    ..$.    LDRB     r0,[r4,#0x24]
        0x08006e98:    77e8        .w      STRB     r0,[r5,#0x1f]
        0x08006e9a:    e000        ..      B        0x8006e9e ; mbedtls_sha256_finish_ret + 322
        0x08006e9c:    e000        ..      B        0x8006ea0 ; mbedtls_sha256_finish_ret + 324
        0x08006e9e:    2000        .       MOVS     r0,#0
        0x08006ea0:    bd70        p.      POP      {r4-r6,pc}
    i.mbedtls_sha256_free
    mbedtls_sha256_free
        0x08006ea2:    2800        .(      CMP      r0,#0
        0x08006ea4:    d002        ..      BEQ      0x8006eac ; mbedtls_sha256_free + 10
        0x08006ea6:    216c        l!      MOVS     r1,#0x6c
        0x08006ea8:    f7ffbf50    ..P.    B.W      mbedtls_platform_zeroize ; 0x8006d4c
        0x08006eac:    4770        pG      BX       lr
    i.mbedtls_sha256_init
    mbedtls_sha256_init
        0x08006eae:    216c        l!      MOVS     r1,#0x6c
        0x08006eb0:    f7f9bb54    ..T.    B        __aeabi_memclr4 ; 0x800055c
    i.mbedtls_sha256_ret
    mbedtls_sha256_ret
        0x08006eb4:    b5f0        ..      PUSH     {r4-r7,lr}
        0x08006eb6:    b09b        ..      SUB      sp,sp,#0x6c
        0x08006eb8:    4607        .F      MOV      r7,r0
        0x08006eba:    461c        .F      MOV      r4,r3
        0x08006ebc:    4615        .F      MOV      r5,r2
        0x08006ebe:    460e        .F      MOV      r6,r1
        0x08006ec0:    4668        hF      MOV      r0,sp
        0x08006ec2:    f7fffff4    ....    BL       mbedtls_sha256_init ; 0x8006eae
        0x08006ec6:    4621        !F      MOV      r1,r4
        0x08006ec8:    4668        hF      MOV      r0,sp
        0x08006eca:    f000f815    ....    BL       mbedtls_sha256_starts_ret ; 0x8006ef8
        0x08006ece:    0004        ..      MOVS     r4,r0
        0x08006ed0:    d10b        ..      BNE      0x8006eea ; mbedtls_sha256_ret + 54
        0x08006ed2:    4632        2F      MOV      r2,r6
        0x08006ed4:    4639        9F      MOV      r1,r7
        0x08006ed6:    4668        hF      MOV      r0,sp
        0x08006ed8:    f000f856    ..V.    BL       mbedtls_sha256_update_ret ; 0x8006f88
        0x08006edc:    0004        ..      MOVS     r4,r0
        0x08006ede:    d104        ..      BNE      0x8006eea ; mbedtls_sha256_ret + 54
        0x08006ee0:    4629        )F      MOV      r1,r5
        0x08006ee2:    4668        hF      MOV      r0,sp
        0x08006ee4:    f7ffff3a    ..:.    BL       mbedtls_sha256_finish_ret ; 0x8006d5c
        0x08006ee8:    4604        .F      MOV      r4,r0
        0x08006eea:    4668        hF      MOV      r0,sp
        0x08006eec:    f7ffffd9    ....    BL       mbedtls_sha256_free ; 0x8006ea2
        0x08006ef0:    b01b        ..      ADD      sp,sp,#0x6c
        0x08006ef2:    4620         F      MOV      r0,r4
        0x08006ef4:    bdf0        ..      POP      {r4-r7,pc}
        0x08006ef6:    0000        ..      MOVS     r0,r0
    i.mbedtls_sha256_starts_ret
    mbedtls_sha256_starts_ret
        0x08006ef8:    2200        ."      MOVS     r2,#0
        0x08006efa:    6002        .`      STR      r2,[r0,#0]
        0x08006efc:    6042        B`      STR      r2,[r0,#4]
        0x08006efe:    b191        ..      CBZ      r1,0x8006f26 ; mbedtls_sha256_starts_ret + 46
        0x08006f00:    4a11        .J      LDR      r2,[pc,#68] ; [0x8006f48] = 0xc1059ed8
        0x08006f02:    6082        .`      STR      r2,[r0,#8]
        0x08006f04:    4a11        .J      LDR      r2,[pc,#68] ; [0x8006f4c] = 0x367cd507
        0x08006f06:    60c2        .`      STR      r2,[r0,#0xc]
        0x08006f08:    4a11        .J      LDR      r2,[pc,#68] ; [0x8006f50] = 0x3070dd17
        0x08006f0a:    6102        .a      STR      r2,[r0,#0x10]
        0x08006f0c:    4a11        .J      LDR      r2,[pc,#68] ; [0x8006f54] = 0xf70e5939
        0x08006f0e:    6142        Ba      STR      r2,[r0,#0x14]
        0x08006f10:    4a11        .J      LDR      r2,[pc,#68] ; [0x8006f58] = 0xffc00b31
        0x08006f12:    6182        .a      STR      r2,[r0,#0x18]
        0x08006f14:    4a11        .J      LDR      r2,[pc,#68] ; [0x8006f5c] = 0x68581511
        0x08006f16:    61c2        .a      STR      r2,[r0,#0x1c]
        0x08006f18:    4a11        .J      LDR      r2,[pc,#68] ; [0x8006f60] = 0x64f98fa7
        0x08006f1a:    6202        .b      STR      r2,[r0,#0x20]
        0x08006f1c:    4a11        .J      LDR      r2,[pc,#68] ; [0x8006f64] = 0xbefa4fa4
        0x08006f1e:    6242        Bb      STR      r2,[r0,#0x24]
        0x08006f20:    6681        .f      STR      r1,[r0,#0x68]
        0x08006f22:    2000        .       MOVS     r0,#0
        0x08006f24:    4770        pG      BX       lr
        0x08006f26:    4a10        .J      LDR      r2,[pc,#64] ; [0x8006f68] = 0x6a09e667
        0x08006f28:    6082        .`      STR      r2,[r0,#8]
        0x08006f2a:    4a10        .J      LDR      r2,[pc,#64] ; [0x8006f6c] = 0xbb67ae85
        0x08006f2c:    60c2        .`      STR      r2,[r0,#0xc]
        0x08006f2e:    4a10        .J      LDR      r2,[pc,#64] ; [0x8006f70] = 0x3c6ef372
        0x08006f30:    6102        .a      STR      r2,[r0,#0x10]
        0x08006f32:    4a10        .J      LDR      r2,[pc,#64] ; [0x8006f74] = 0xa54ff53a
        0x08006f34:    6142        Ba      STR      r2,[r0,#0x14]
        0x08006f36:    4a10        .J      LDR      r2,[pc,#64] ; [0x8006f78] = 0x510e527f
        0x08006f38:    6182        .a      STR      r2,[r0,#0x18]
        0x08006f3a:    4a10        .J      LDR      r2,[pc,#64] ; [0x8006f7c] = 0x9b05688c
        0x08006f3c:    61c2        .a      STR      r2,[r0,#0x1c]
        0x08006f3e:    4a10        .J      LDR      r2,[pc,#64] ; [0x8006f80] = 0x1f83d9ab
        0x08006f40:    6202        .b      STR      r2,[r0,#0x20]
        0x08006f42:    4a10        .J      LDR      r2,[pc,#64] ; [0x8006f84] = 0x5be0cd19
        0x08006f44:    e7eb        ..      B        0x8006f1e ; mbedtls_sha256_starts_ret + 38
    $d
        0x08006f46:    0000        ..      DCW    0
        0x08006f48:    c1059ed8    ....    DCD    3238371032
