openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08006f4c:    367cd507    ..|6    DCD    914150663
        0x08006f50:    3070dd17    ..p0    DCD    812702999
        0x08006f54:    f70e5939    9Y..    DCD    4144912697
        0x08006f58:    ffc00b31    1...    DCD    4290775857
        0x08006f5c:    68581511    ..Xh    DCD    1750603025
        0x08006f60:    64f98fa7    ...d    DCD    1694076839
        0x08006f64:    befa4fa4    .O..    DCD    3204075428
        0x08006f68:    6a09e667    g..j    DCD    1779033703
        0x08006f6c:    bb67ae85    ..g.    DCD    3144134277
        0x08006f70:    3c6ef372    r.n<    DCD    1013904242
        0x08006f74:    a54ff53a    :.O.    DCD    2773480762
        0x08006f78:    510e527f    .R.Q    DCD    1359893119
        0x08006f7c:    9b05688c    .h..    DCD    2600822924
        0x08006f80:    1f83d9ab    ....    DCD    528734635
        0x08006f84:    5be0cd19    ...[    DCD    1541459225
    $t
    i.mbedtls_sha256_update_ret
    mbedtls_sha256_update_ret
        0x08006f88:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x08006f8c:    0014        ..      MOVS     r4,r2
        0x08006f8e:    4605        .F      MOV      r5,r0
        0x08006f90:    4688        .F      MOV      r8,r1
        0x08006f92:    d030        0.      BEQ      0x8006ff6 ; mbedtls_sha256_update_ret + 110
        0x08006f94:    6828        (h      LDR      r0,[r5,#0]
        0x08006f96:    f000063f    ..?.    AND      r6,r0,#0x3f
        0x08006f9a:    4420         D      ADD      r0,r0,r4
        0x08006f9c:    f1c60740    ..@.    RSB      r7,r6,#0x40
        0x08006fa0:    6028        (`      STR      r0,[r5,#0]
        0x08006fa2:    42a0        .B      CMP      r0,r4
        0x08006fa4:    d202        ..      BCS      0x8006fac ; mbedtls_sha256_update_ret + 36
        0x08006fa6:    6868        hh      LDR      r0,[r5,#4]
        0x08006fa8:    1c40        @.      ADDS     r0,r0,#1
        0x08006faa:    6068        h`      STR      r0,[r5,#4]
        0x08006fac:    b1d6        ..      CBZ      r6,0x8006fe4 ; mbedtls_sha256_update_ret + 92
        0x08006fae:    42bc        .B      CMP      r4,r7
        0x08006fb0:    d318        ..      BCC      0x8006fe4 ; mbedtls_sha256_update_ret + 92
        0x08006fb2:    19a8        ..      ADDS     r0,r5,r6
        0x08006fb4:    463a        :F      MOV      r2,r7
        0x08006fb6:    3028        (0      ADDS     r0,r0,#0x28
        0x08006fb8:    f7f9fa2c    ..,.    BL       __aeabi_memcpy ; 0x8000414
        0x08006fbc:    f1050128    ..(.    ADD      r1,r5,#0x28
        0x08006fc0:    4628        (F      MOV      r0,r5
        0x08006fc2:    f7fef9b7    ....    BL       mbedtls_internal_sha256_process ; 0x8005334
        0x08006fc6:    2800        .(      CMP      r0,#0
        0x08006fc8:    d116        ..      BNE      0x8006ff8 ; mbedtls_sha256_update_ret + 112
        0x08006fca:    1be4        ..      SUBS     r4,r4,r7
        0x08006fcc:    44b8        .D      ADD      r8,r8,r7
        0x08006fce:    2600        .&      MOVS     r6,#0
        0x08006fd0:    e008        ..      B        0x8006fe4 ; mbedtls_sha256_update_ret + 92
        0x08006fd2:    4641        AF      MOV      r1,r8
        0x08006fd4:    4628        (F      MOV      r0,r5
        0x08006fd6:    f7fef9ad    ....    BL       mbedtls_internal_sha256_process ; 0x8005334
        0x08006fda:    2800        .(      CMP      r0,#0
        0x08006fdc:    d10c        ..      BNE      0x8006ff8 ; mbedtls_sha256_update_ret + 112
        0x08006fde:    f1080840    ..@.    ADD      r8,r8,#0x40
        0x08006fe2:    3c40        @<      SUBS     r4,r4,#0x40
        0x08006fe4:    2c40        @,      CMP      r4,#0x40
        0x08006fe6:    d2f4        ..      BCS      0x8006fd2 ; mbedtls_sha256_update_ret + 74
        0x08006fe8:    b12c        ,.      CBZ      r4,0x8006ff6 ; mbedtls_sha256_update_ret + 110
        0x08006fea:    19a8        ..      ADDS     r0,r5,r6
        0x08006fec:    4622        "F      MOV      r2,r4
        0x08006fee:    4641        AF      MOV      r1,r8
        0x08006ff0:    3028        (0      ADDS     r0,r0,#0x28
        0x08006ff2:    f7f9fa0f    ....    BL       __aeabi_memcpy ; 0x8000414
        0x08006ff6:    2000        .       MOVS     r0,#0
        0x08006ff8:    e8bd81f0    ....    POP      {r4-r8,pc}
    i.mpi_bigendian_to_host
    mpi_bigendian_to_host
        0x08006ffc:    b570        p.      PUSH     {r4-r6,lr}
        0x08006ffe:    2900        .)      CMP      r1,#0
        0x08007000:    d010        ..      BEQ      0x8007024 ; mpi_bigendian_to_host + 40
        0x08007002:    eb000581    ....    ADD      r5,r0,r1,LSL #2
        0x08007006:    4604        .F      MOV      r4,r0
        0x08007008:    1f2d        -.      SUBS     r5,r5,#4
        0x0800700a:    e009        ..      B        0x8007020 ; mpi_bigendian_to_host + 36
        0x0800700c:    6820         h      LDR      r0,[r4,#0]
        0x0800700e:    f000fa0c    ....    BL       mpi_uint_bigendian_to_host ; 0x800742a
        0x08007012:    4606        .F      MOV      r6,r0
        0x08007014:    6828        (h      LDR      r0,[r5,#0]
        0x08007016:    f000fa08    ....    BL       mpi_uint_bigendian_to_host ; 0x800742a
        0x0800701a:    c401        ..      STM      r4!,{r0}
        0x0800701c:    f8456904    E..i    STR      r6,[r5],#-4
        0x08007020:    42ac        .B      CMP      r4,r5
        0x08007022:    d9f3        ..      BLS      0x800700c ; mpi_bigendian_to_host + 16
        0x08007024:    bd70        p.      POP      {r4-r6,pc}
    i.mpi_get_digit
    mpi_get_digit
        0x08007026:    23ff        .#      MOVS     r3,#0xff
        0x08007028:    6003        .`      STR      r3,[r0,#0]
        0x0800702a:    f1a20330    ..0.    SUB      r3,r2,#0x30
        0x0800702e:    2b09        .+      CMP      r3,#9
        0x08007030:    d800        ..      BHI      0x8007034 ; mpi_get_digit + 14
        0x08007032:    6003        .`      STR      r3,[r0,#0]
        0x08007034:    f1a20341    ..A.    SUB      r3,r2,#0x41
        0x08007038:    2b05        .+      CMP      r3,#5
        0x0800703a:    d801        ..      BHI      0x8007040 ; mpi_get_digit + 26
        0x0800703c:    330a        .3      ADDS     r3,r3,#0xa
        0x0800703e:    6003        .`      STR      r3,[r0,#0]
        0x08007040:    f1a20361    ..a.    SUB      r3,r2,#0x61
        0x08007044:    2b05        .+      CMP      r3,#5
        0x08007046:    d801        ..      BHI      0x800704c ; mpi_get_digit + 38
        0x08007048:    3a57        W:      SUBS     r2,r2,#0x57
        0x0800704a:    6002        .`      STR      r2,[r0,#0]
        0x0800704c:    6800        .h      LDR      r0,[r0,#0]
        0x0800704e:    4288        .B      CMP      r0,r1
        0x08007050:    d302        ..      BCC      0x8007058 ; mpi_get_digit + 50
        0x08007052:    f06f0005    o...    MVN      r0,#5
        0x08007056:    4770        pG      BX       lr
        0x08007058:    2000        .       MOVS     r0,#0
        0x0800705a:    4770        pG      BX       lr
    i.mpi_mul_hlp
    mpi_mul_hlp
        0x0800705c:    b5f0        ..      PUSH     {r4-r7,lr}
        0x0800705e:    2400        .$      MOVS     r4,#0
        0x08007060:    e110        ..      B        0x8007284 ; mpi_mul_hlp + 552
        0x08007062:    c920         .      LDM      r1!,{r5}
        0x08007064:    fba56503    ...e    UMULL    r6,r5,r5,r3
        0x08007068:    1936        6.      ADDS     r6,r6,r4
        0x0800706a:    d301        ..      BCC      0x8007070 ; mpi_mul_hlp + 20
        0x0800706c:    2401        .$      MOVS     r4,#1
        0x0800706e:    e000        ..      B        0x8007072 ; mpi_mul_hlp + 22
        0x08007070:    2400        .$      MOVS     r4,#0
        0x08007072:    6817        .h      LDR      r7,[r2,#0]
        0x08007074:    4425        %D      ADD      r5,r5,r4
        0x08007076:    19bc        ..      ADDS     r4,r7,r6
        0x08007078:    d301        ..      BCC      0x800707e ; mpi_mul_hlp + 34
        0x0800707a:    2601        .&      MOVS     r6,#1
        0x0800707c:    e000        ..      B        0x8007080 ; mpi_mul_hlp + 36
        0x0800707e:    2600        .&      MOVS     r6,#0
        0x08007080:    c210        ..      STM      r2!,{r4}
        0x08007082:    c910        ..      LDM      r1!,{r4}
        0x08007084:    442e        .D      ADD      r6,r6,r5
        0x08007086:    fba44503    ...E    UMULL    r4,r5,r4,r3
        0x0800708a:    19a4        ..      ADDS     r4,r4,r6
        0x0800708c:    d301        ..      BCC      0x8007092 ; mpi_mul_hlp + 54
        0x0800708e:    2601        .&      MOVS     r6,#1
        0x08007090:    e000        ..      B        0x8007094 ; mpi_mul_hlp + 56
        0x08007092:    2600        .&      MOVS     r6,#0
        0x08007094:    442e        .D      ADD      r6,r6,r5
        0x08007096:    6815        .h      LDR      r5,[r2,#0]
        0x08007098:    192c        ,.      ADDS     r4,r5,r4
        0x0800709a:    d301        ..      BCC      0x80070a0 ; mpi_mul_hlp + 68
        0x0800709c:    2501        .%      MOVS     r5,#1
        0x0800709e:    e000        ..      B        0x80070a2 ; mpi_mul_hlp + 70
        0x080070a0:    2500        .%      MOVS     r5,#0
        0x080070a2:    c210        ..      STM      r2!,{r4}
        0x080070a4:    c910        ..      LDM      r1!,{r4}
        0x080070a6:    442e        .D      ADD      r6,r6,r5
        0x080070a8:    fba44503    ...E    UMULL    r4,r5,r4,r3
        0x080070ac:    19a4        ..      ADDS     r4,r4,r6
        0x080070ae:    d301        ..      BCC      0x80070b4 ; mpi_mul_hlp + 88
        0x080070b0:    2601        .&      MOVS     r6,#1
        0x080070b2:    e000        ..      B        0x80070b6 ; mpi_mul_hlp + 90
        0x080070b4:    2600        .&      MOVS     r6,#0
        0x080070b6:    4435        5D      ADD      r5,r5,r6
        0x080070b8:    6816        .h      LDR      r6,[r2,#0]
        0x080070ba:    1934        4.      ADDS     r4,r6,r4
        0x080070bc:    d301        ..      BCC      0x80070c2 ; mpi_mul_hlp + 102
        0x080070be:    2601        .&      MOVS     r6,#1
        0x080070c0:    e000        ..      B        0x80070c4 ; mpi_mul_hlp + 104
        0x080070c2:    2600        .&      MOVS     r6,#0
        0x080070c4:    c210        ..      STM      r2!,{r4}
        0x080070c6:    c910        ..      LDM      r1!,{r4}
        0x080070c8:    442e        .D      ADD      r6,r6,r5
        0x080070ca:    fba45403    ...T    UMULL    r5,r4,r4,r3
        0x080070ce:    19ad        ..      ADDS     r5,r5,r6
        0x080070d0:    d301        ..      BCC      0x80070d6 ; mpi_mul_hlp + 122
        0x080070d2:    2601        .&      MOVS     r6,#1
        0x080070d4:    e000        ..      B        0x80070d8 ; mpi_mul_hlp + 124
        0x080070d6:    2600        .&      MOVS     r6,#0
        0x080070d8:    6817        .h      LDR      r7,[r2,#0]
        0x080070da:    4426        &D      ADD      r6,r6,r4
        0x080070dc:    197c        |.      ADDS     r4,r7,r5
        0x080070de:    d301        ..      BCC      0x80070e4 ; mpi_mul_hlp + 136
        0x080070e0:    2501        .%      MOVS     r5,#1
        0x080070e2:    e000        ..      B        0x80070e6 ; mpi_mul_hlp + 138
        0x080070e4:    2500        .%      MOVS     r5,#0
        0x080070e6:    c210        ..      STM      r2!,{r4}
        0x080070e8:    c910        ..      LDM      r1!,{r4}
        0x080070ea:    442e        .D      ADD      r6,r6,r5
        0x080070ec:    fba44503    ...E    UMULL    r4,r5,r4,r3
        0x080070f0:    19a4        ..      ADDS     r4,r4,r6
        0x080070f2:    d301        ..      BCC      0x80070f8 ; mpi_mul_hlp + 156
        0x080070f4:    2601        .&      MOVS     r6,#1
        0x080070f6:    e000        ..      B        0x80070fa ; mpi_mul_hlp + 158
        0x080070f8:    2600        .&      MOVS     r6,#0
        0x080070fa:    442e        .D      ADD      r6,r6,r5
        0x080070fc:    6815        .h      LDR      r5,[r2,#0]
        0x080070fe:    192c        ,.      ADDS     r4,r5,r4
        0x08007100:    d301        ..      BCC      0x8007106 ; mpi_mul_hlp + 170
        0x08007102:    2501        .%      MOVS     r5,#1
        0x08007104:    e000        ..      B        0x8007108 ; mpi_mul_hlp + 172
        0x08007106:    2500        .%      MOVS     r5,#0
        0x08007108:    c210        ..      STM      r2!,{r4}
        0x0800710a:    c910        ..      LDM      r1!,{r4}
        0x0800710c:    442e        .D      ADD      r6,r6,r5
        0x0800710e:    fba44503    ...E    UMULL    r4,r5,r4,r3
        0x08007112:    19a4        ..      ADDS     r4,r4,r6
        0x08007114:    d301        ..      BCC      0x800711a ; mpi_mul_hlp + 190
        0x08007116:    2601        .&      MOVS     r6,#1
        0x08007118:    e000        ..      B        0x800711c ; mpi_mul_hlp + 192
        0x0800711a:    2600        .&      MOVS     r6,#0
        0x0800711c:    442e        .D      ADD      r6,r6,r5
        0x0800711e:    6815        .h      LDR      r5,[r2,#0]
        0x08007120:    192c        ,.      ADDS     r4,r5,r4
        0x08007122:    d301        ..      BCC      0x8007128 ; mpi_mul_hlp + 204
        0x08007124:    2501        .%      MOVS     r5,#1
        0x08007126:    e000        ..      B        0x800712a ; mpi_mul_hlp + 206
        0x08007128:    2500        .%      MOVS     r5,#0
        0x0800712a:    c210        ..      STM      r2!,{r4}
        0x0800712c:    c910        ..      LDM      r1!,{r4}
        0x0800712e:    442e        .D      ADD      r6,r6,r5
        0x08007130:    fba44503    ...E    UMULL    r4,r5,r4,r3
        0x08007134:    19a4        ..      ADDS     r4,r4,r6
        0x08007136:    d301        ..      BCC      0x800713c ; mpi_mul_hlp + 224
        0x08007138:    2601        .&      MOVS     r6,#1
        0x0800713a:    e000        ..      B        0x800713e ; mpi_mul_hlp + 226
        0x0800713c:    2600        .&      MOVS     r6,#0
        0x0800713e:    442e        .D      ADD      r6,r6,r5
        0x08007140:    6815        .h      LDR      r5,[r2,#0]
        0x08007142:    192c        ,.      ADDS     r4,r5,r4
        0x08007144:    d301        ..      BCC      0x800714a ; mpi_mul_hlp + 238
        0x08007146:    2501        .%      MOVS     r5,#1
        0x08007148:    e000        ..      B        0x800714c ; mpi_mul_hlp + 240
        0x0800714a:    2500        .%      MOVS     r5,#0
        0x0800714c:    c210        ..      STM      r2!,{r4}
        0x0800714e:    c910        ..      LDM      r1!,{r4}
        0x08007150:    442e        .D      ADD      r6,r6,r5
        0x08007152:    fba44503    ...E    UMULL    r4,r5,r4,r3
        0x08007156:    19a4        ..      ADDS     r4,r4,r6
        0x08007158:    d301        ..      BCC      0x800715e ; mpi_mul_hlp + 258
        0x0800715a:    2601        .&      MOVS     r6,#1
        0x0800715c:    e000        ..      B        0x8007160 ; mpi_mul_hlp + 260
        0x0800715e:    2600        .&      MOVS     r6,#0
        0x08007160:    442e        .D      ADD      r6,r6,r5
        0x08007162:    6815        .h      LDR      r5,[r2,#0]
        0x08007164:    192c        ,.      ADDS     r4,r5,r4
        0x08007166:    d301        ..      BCC      0x800716c ; mpi_mul_hlp + 272
        0x08007168:    2501        .%      MOVS     r5,#1
        0x0800716a:    e000        ..      B        0x800716e ; mpi_mul_hlp + 274
        0x0800716c:    2500        .%      MOVS     r5,#0
        0x0800716e:    c210        ..      STM      r2!,{r4}
        0x08007170:    c910        ..      LDM      r1!,{r4}
        0x08007172:    442e        .D      ADD      r6,r6,r5
        0x08007174:    fba45403    ...T    UMULL    r5,r4,r4,r3
        0x08007178:    19ad        ..      ADDS     r5,r5,r6
        0x0800717a:    d301        ..      BCC      0x8007180 ; mpi_mul_hlp + 292
        0x0800717c:    2601        .&      MOVS     r6,#1
        0x0800717e:    e000        ..      B        0x8007182 ; mpi_mul_hlp + 294
        0x08007180:    2600        .&      MOVS     r6,#0
        0x08007182:    1937        7.      ADDS     r7,r6,r4
        0x08007184:    6816        .h      LDR      r6,[r2,#0]
        0x08007186:    1974        t.      ADDS     r4,r6,r5
        0x08007188:    d301        ..      BCC      0x800718e ; mpi_mul_hlp + 306
        0x0800718a:    2501        .%      MOVS     r5,#1
        0x0800718c:    e000        ..      B        0x8007190 ; mpi_mul_hlp + 308
        0x0800718e:    2500        .%      MOVS     r5,#0
        0x08007190:    c210        ..      STM      r2!,{r4}
        0x08007192:    c910        ..      LDM      r1!,{r4}
        0x08007194:    19ee        ..      ADDS     r6,r5,r7
        0x08007196:    fba45403    ...T    UMULL    r5,r4,r4,r3
        0x0800719a:    19ad        ..      ADDS     r5,r5,r6
        0x0800719c:    d301        ..      BCC      0x80071a2 ; mpi_mul_hlp + 326
        0x0800719e:    2601        .&      MOVS     r6,#1
        0x080071a0:    e000        ..      B        0x80071a4 ; mpi_mul_hlp + 328
        0x080071a2:    2600        .&      MOVS     r6,#0
        0x080071a4:    1937        7.      ADDS     r7,r6,r4
        0x080071a6:    6816        .h      LDR      r6,[r2,#0]
        0x080071a8:    1974        t.      ADDS     r4,r6,r5
        0x080071aa:    d301        ..      BCC      0x80071b0 ; mpi_mul_hlp + 340
        0x080071ac:    2501        .%      MOVS     r5,#1
        0x080071ae:    e000        ..      B        0x80071b2 ; mpi_mul_hlp + 342
        0x080071b0:    2500        .%      MOVS     r5,#0
        0x080071b2:    c210        ..      STM      r2!,{r4}
        0x080071b4:    c910        ..      LDM      r1!,{r4}
        0x080071b6:    19ee        ..      ADDS     r6,r5,r7
        0x080071b8:    fba44503    ...E    UMULL    r4,r5,r4,r3
        0x080071bc:    19a4        ..      ADDS     r4,r4,r6
        0x080071be:    d301        ..      BCC      0x80071c4 ; mpi_mul_hlp + 360
        0x080071c0:    2601        .&      MOVS     r6,#1
        0x080071c2:    e000        ..      B        0x80071c6 ; mpi_mul_hlp + 362
        0x080071c4:    2600        .&      MOVS     r6,#0
        0x080071c6:    442e        .D      ADD      r6,r6,r5
        0x080071c8:    6815        .h      LDR      r5,[r2,#0]
        0x080071ca:    192c        ,.      ADDS     r4,r5,r4
        0x080071cc:    d301        ..      BCC      0x80071d2 ; mpi_mul_hlp + 374
        0x080071ce:    2501        .%      MOVS     r5,#1
        0x080071d0:    e000        ..      B        0x80071d4 ; mpi_mul_hlp + 376
        0x080071d2:    2500        .%      MOVS     r5,#0
        0x080071d4:    c210        ..      STM      r2!,{r4}
        0x080071d6:    c910        ..      LDM      r1!,{r4}
        0x080071d8:    442e        .D      ADD      r6,r6,r5
        0x080071da:    fba44503    ...E    UMULL    r4,r5,r4,r3
        0x080071de:    19a4        ..      ADDS     r4,r4,r6
        0x080071e0:    d301        ..      BCC      0x80071e6 ; mpi_mul_hlp + 394
        0x080071e2:    2601        .&      MOVS     r6,#1
        0x080071e4:    e000        ..      B        0x80071e8 ; mpi_mul_hlp + 396
        0x080071e6:    2600        .&      MOVS     r6,#0
        0x080071e8:    442e        .D      ADD      r6,r6,r5
        0x080071ea:    6815        .h      LDR      r5,[r2,#0]
        0x080071ec:    192c        ,.      ADDS     r4,r5,r4
        0x080071ee:    d301        ..      BCC      0x80071f4 ; mpi_mul_hlp + 408
        0x080071f0:    2501        .%      MOVS     r5,#1
        0x080071f2:    e000        ..      B        0x80071f6 ; mpi_mul_hlp + 410
        0x080071f4:    2500        .%      MOVS     r5,#0
        0x080071f6:    c210        ..      STM      r2!,{r4}
        0x080071f8:    c910        ..      LDM      r1!,{r4}
        0x080071fa:    442e        .D      ADD      r6,r6,r5
        0x080071fc:    fba45403    ...T    UMULL    r5,r4,r4,r3
        0x08007200:    19ad        ..      ADDS     r5,r5,r6
        0x08007202:    d301        ..      BCC      0x8007208 ; mpi_mul_hlp + 428
        0x08007204:    2601        .&      MOVS     r6,#1
        0x08007206:    e000        ..      B        0x800720a ; mpi_mul_hlp + 430
        0x08007208:    2600        .&      MOVS     r6,#0
        0x0800720a:    1937        7.      ADDS     r7,r6,r4
        0x0800720c:    6816        .h      LDR      r6,[r2,#0]
        0x0800720e:    1974        t.      ADDS     r4,r6,r5
        0x08007210:    d301        ..      BCC      0x8007216 ; mpi_mul_hlp + 442
        0x08007212:    2501        .%      MOVS     r5,#1
        0x08007214:    e000        ..      B        0x8007218 ; mpi_mul_hlp + 444
        0x08007216:    2500        .%      MOVS     r5,#0
        0x08007218:    c210        ..      STM      r2!,{r4}
        0x0800721a:    c910        ..      LDM      r1!,{r4}
        0x0800721c:    19ee        ..      ADDS     r6,r5,r7
        0x0800721e:    fba44503    ...E    UMULL    r4,r5,r4,r3
        0x08007222:    19a4        ..      ADDS     r4,r4,r6
        0x08007224:    d301        ..      BCC      0x800722a ; mpi_mul_hlp + 462
        0x08007226:    2601        .&      MOVS     r6,#1
        0x08007228:    e000        ..      B        0x800722c ; mpi_mul_hlp + 464
        0x0800722a:    2600        .&      MOVS     r6,#0
        0x0800722c:    4435        5D      ADD      r5,r5,r6
        0x0800722e:    6816        .h      LDR      r6,[r2,#0]
        0x08007230:    1934        4.      ADDS     r4,r6,r4
        0x08007232:    d301        ..      BCC      0x8007238 ; mpi_mul_hlp + 476
        0x08007234:    2601        .&      MOVS     r6,#1
        0x08007236:    e000        ..      B        0x800723a ; mpi_mul_hlp + 478
        0x08007238:    2600        .&      MOVS     r6,#0
        0x0800723a:    c210        ..      STM      r2!,{r4}
        0x0800723c:    c910        ..      LDM      r1!,{r4}
        0x0800723e:    442e        .D      ADD      r6,r6,r5
        0x08007240:    fba45403    ...T    UMULL    r5,r4,r4,r3
        0x08007244:    19ad        ..      ADDS     r5,r5,r6
        0x08007246:    d301        ..      BCC      0x800724c ; mpi_mul_hlp + 496
        0x08007248:    2601        .&      MOVS     r6,#1
        0x0800724a:    e000        ..      B        0x800724e ; mpi_mul_hlp + 498
        0x0800724c:    2600        .&      MOVS     r6,#0
        0x0800724e:    6817        .h      LDR      r7,[r2,#0]
        0x08007250:    4426        &D      ADD      r6,r6,r4
        0x08007252:    197c        |.      ADDS     r4,r7,r5
        0x08007254:    d301        ..      BCC      0x800725a ; mpi_mul_hlp + 510
        0x08007256:    2501        .%      MOVS     r5,#1
        0x08007258:    e000        ..      B        0x800725c ; mpi_mul_hlp + 512
        0x0800725a:    2500        .%      MOVS     r5,#0
        0x0800725c:    c210        ..      STM      r2!,{r4}
        0x0800725e:    c910        ..      LDM      r1!,{r4}
        0x08007260:    442e        .D      ADD      r6,r6,r5
        0x08007262:    fba44503    ...E    UMULL    r4,r5,r4,r3
        0x08007266:    19a4        ..      ADDS     r4,r4,r6
        0x08007268:    d301        ..      BCC      0x800726e ; mpi_mul_hlp + 530
        0x0800726a:    2601        .&      MOVS     r6,#1
        0x0800726c:    e000        ..      B        0x8007270 ; mpi_mul_hlp + 532
        0x0800726e:    2600        .&      MOVS     r6,#0
