openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08007270:    1977        w.      ADDS     r7,r6,r5
        0x08007272:    6816        .h      LDR      r6,[r2,#0]
        0x08007274:    1935        5.      ADDS     r5,r6,r4
        0x08007276:    d301        ..      BCC      0x800727c ; mpi_mul_hlp + 544
        0x08007278:    2401        .$      MOVS     r4,#1
        0x0800727a:    e000        ..      B        0x800727e ; mpi_mul_hlp + 546
        0x0800727c:    2400        .$      MOVS     r4,#0
        0x0800727e:    c220         .      STM      r2!,{r5}
        0x08007280:    443c        <D      ADD      r4,r4,r7
        0x08007282:    3810        .8      SUBS     r0,r0,#0x10
        0x08007284:    2810        .(      CMP      r0,#0x10
        0x08007286:    f4bfaeec    ....    BCS      0x8007062 ; mpi_mul_hlp + 6
        0x0800728a:    e088        ..      B        0x800739e ; mpi_mul_hlp + 834
        0x0800728c:    c920         .      LDM      r1!,{r5}
        0x0800728e:    fba56503    ...e    UMULL    r6,r5,r5,r3
        0x08007292:    1936        6.      ADDS     r6,r6,r4
        0x08007294:    d301        ..      BCC      0x800729a ; mpi_mul_hlp + 574
        0x08007296:    2401        .$      MOVS     r4,#1
        0x08007298:    e000        ..      B        0x800729c ; mpi_mul_hlp + 576
        0x0800729a:    2400        .$      MOVS     r4,#0
        0x0800729c:    1967        g.      ADDS     r7,r4,r5
        0x0800729e:    6815        .h      LDR      r5,[r2,#0]
        0x080072a0:    19ac        ..      ADDS     r4,r5,r6
        0x080072a2:    d301        ..      BCC      0x80072a8 ; mpi_mul_hlp + 588
        0x080072a4:    2501        .%      MOVS     r5,#1
        0x080072a6:    e000        ..      B        0x80072aa ; mpi_mul_hlp + 590
        0x080072a8:    2500        .%      MOVS     r5,#0
        0x080072aa:    c210        ..      STM      r2!,{r4}
        0x080072ac:    c910        ..      LDM      r1!,{r4}
        0x080072ae:    19ee        ..      ADDS     r6,r5,r7
        0x080072b0:    fba44503    ...E    UMULL    r4,r5,r4,r3
        0x080072b4:    19a4        ..      ADDS     r4,r4,r6
        0x080072b6:    d301        ..      BCC      0x80072bc ; mpi_mul_hlp + 608
        0x080072b8:    2601        .&      MOVS     r6,#1
        0x080072ba:    e000        ..      B        0x80072be ; mpi_mul_hlp + 610
        0x080072bc:    2600        .&      MOVS     r6,#0
        0x080072be:    442e        .D      ADD      r6,r6,r5
        0x080072c0:    6815        .h      LDR      r5,[r2,#0]
        0x080072c2:    192c        ,.      ADDS     r4,r5,r4
        0x080072c4:    d301        ..      BCC      0x80072ca ; mpi_mul_hlp + 622
        0x080072c6:    2501        .%      MOVS     r5,#1
        0x080072c8:    e000        ..      B        0x80072cc ; mpi_mul_hlp + 624
        0x080072ca:    2500        .%      MOVS     r5,#0
        0x080072cc:    c210        ..      STM      r2!,{r4}
        0x080072ce:    c910        ..      LDM      r1!,{r4}
        0x080072d0:    442e        .D      ADD      r6,r6,r5
        0x080072d2:    fba44503    ...E    UMULL    r4,r5,r4,r3
        0x080072d6:    19a4        ..      ADDS     r4,r4,r6
        0x080072d8:    d301        ..      BCC      0x80072de ; mpi_mul_hlp + 642
        0x080072da:    2601        .&      MOVS     r6,#1
        0x080072dc:    e000        ..      B        0x80072e0 ; mpi_mul_hlp + 644
        0x080072de:    2600        .&      MOVS     r6,#0
        0x080072e0:    442e        .D      ADD      r6,r6,r5
        0x080072e2:    6815        .h      LDR      r5,[r2,#0]
        0x080072e4:    192c        ,.      ADDS     r4,r5,r4
        0x080072e6:    d301        ..      BCC      0x80072ec ; mpi_mul_hlp + 656
        0x080072e8:    2501        .%      MOVS     r5,#1
        0x080072ea:    e000        ..      B        0x80072ee ; mpi_mul_hlp + 658
        0x080072ec:    2500        .%      MOVS     r5,#0
        0x080072ee:    c210        ..      STM      r2!,{r4}
        0x080072f0:    c910        ..      LDM      r1!,{r4}
        0x080072f2:    442e        .D      ADD      r6,r6,r5
        0x080072f4:    fba44503    ...E    UMULL    r4,r5,r4,r3
        0x080072f8:    19a4        ..      ADDS     r4,r4,r6
        0x080072fa:    d301        ..      BCC      0x8007300 ; mpi_mul_hlp + 676
        0x080072fc:    2601        .&      MOVS     r6,#1
        0x080072fe:    e000        ..      B        0x8007302 ; mpi_mul_hlp + 678
        0x08007300:    2600        .&      MOVS     r6,#0
        0x08007302:    442e        .D      ADD      r6,r6,r5
        0x08007304:    6815        .h      LDR      r5,[r2,#0]
        0x08007306:    192c        ,.      ADDS     r4,r5,r4
        0x08007308:    d301        ..      BCC      0x800730e ; mpi_mul_hlp + 690
        0x0800730a:    2501        .%      MOVS     r5,#1
        0x0800730c:    e000        ..      B        0x8007310 ; mpi_mul_hlp + 692
        0x0800730e:    2500        .%      MOVS     r5,#0
        0x08007310:    c210        ..      STM      r2!,{r4}
        0x08007312:    c910        ..      LDM      r1!,{r4}
        0x08007314:    442e        .D      ADD      r6,r6,r5
        0x08007316:    fba45403    ...T    UMULL    r5,r4,r4,r3
        0x0800731a:    19ad        ..      ADDS     r5,r5,r6
        0x0800731c:    d301        ..      BCC      0x8007322 ; mpi_mul_hlp + 710
        0x0800731e:    2601        .&      MOVS     r6,#1
        0x08007320:    e000        ..      B        0x8007324 ; mpi_mul_hlp + 712
        0x08007322:    2600        .&      MOVS     r6,#0
        0x08007324:    1937        7.      ADDS     r7,r6,r4
        0x08007326:    6816        .h      LDR      r6,[r2,#0]
        0x08007328:    1974        t.      ADDS     r4,r6,r5
        0x0800732a:    d301        ..      BCC      0x8007330 ; mpi_mul_hlp + 724
        0x0800732c:    2501        .%      MOVS     r5,#1
        0x0800732e:    e000        ..      B        0x8007332 ; mpi_mul_hlp + 726
        0x08007330:    2500        .%      MOVS     r5,#0
        0x08007332:    c210        ..      STM      r2!,{r4}
        0x08007334:    c910        ..      LDM      r1!,{r4}
        0x08007336:    19ee        ..      ADDS     r6,r5,r7
        0x08007338:    fba45403    ...T    UMULL    r5,r4,r4,r3
        0x0800733c:    19ad        ..      ADDS     r5,r5,r6
        0x0800733e:    d301        ..      BCC      0x8007344 ; mpi_mul_hlp + 744
        0x08007340:    2601        .&      MOVS     r6,#1
        0x08007342:    e000        ..      B        0x8007346 ; mpi_mul_hlp + 746
        0x08007344:    2600        .&      MOVS     r6,#0
        0x08007346:    1937        7.      ADDS     r7,r6,r4
        0x08007348:    6816        .h      LDR      r6,[r2,#0]
        0x0800734a:    1974        t.      ADDS     r4,r6,r5
        0x0800734c:    d301        ..      BCC      0x8007352 ; mpi_mul_hlp + 758
        0x0800734e:    2501        .%      MOVS     r5,#1
        0x08007350:    e000        ..      B        0x8007354 ; mpi_mul_hlp + 760
        0x08007352:    2500        .%      MOVS     r5,#0
        0x08007354:    c210        ..      STM      r2!,{r4}
        0x08007356:    c910        ..      LDM      r1!,{r4}
        0x08007358:    19ee        ..      ADDS     r6,r5,r7
        0x0800735a:    fba45403    ...T    UMULL    r5,r4,r4,r3
        0x0800735e:    19ad        ..      ADDS     r5,r5,r6
        0x08007360:    d301        ..      BCC      0x8007366 ; mpi_mul_hlp + 778
        0x08007362:    2601        .&      MOVS     r6,#1
        0x08007364:    e000        ..      B        0x8007368 ; mpi_mul_hlp + 780
        0x08007366:    2600        .&      MOVS     r6,#0
        0x08007368:    1937        7.      ADDS     r7,r6,r4
        0x0800736a:    6816        .h      LDR      r6,[r2,#0]
        0x0800736c:    1974        t.      ADDS     r4,r6,r5
        0x0800736e:    d301        ..      BCC      0x8007374 ; mpi_mul_hlp + 792
        0x08007370:    2501        .%      MOVS     r5,#1
        0x08007372:    e000        ..      B        0x8007376 ; mpi_mul_hlp + 794
        0x08007374:    2500        .%      MOVS     r5,#0
        0x08007376:    c210        ..      STM      r2!,{r4}
        0x08007378:    c910        ..      LDM      r1!,{r4}
        0x0800737a:    19ee        ..      ADDS     r6,r5,r7
        0x0800737c:    fba44503    ...E    UMULL    r4,r5,r4,r3
        0x08007380:    19a4        ..      ADDS     r4,r4,r6
        0x08007382:    d301        ..      BCC      0x8007388 ; mpi_mul_hlp + 812
        0x08007384:    2601        .&      MOVS     r6,#1
        0x08007386:    e000        ..      B        0x800738a ; mpi_mul_hlp + 814
        0x08007388:    2600        .&      MOVS     r6,#0
        0x0800738a:    1977        w.      ADDS     r7,r6,r5
        0x0800738c:    6816        .h      LDR      r6,[r2,#0]
        0x0800738e:    1935        5.      ADDS     r5,r6,r4
        0x08007390:    d301        ..      BCC      0x8007396 ; mpi_mul_hlp + 826
        0x08007392:    2401        .$      MOVS     r4,#1
        0x08007394:    e000        ..      B        0x8007398 ; mpi_mul_hlp + 828
        0x08007396:    2400        .$      MOVS     r4,#0
        0x08007398:    c220         .      STM      r2!,{r5}
        0x0800739a:    443c        <D      ADD      r4,r4,r7
        0x0800739c:    3808        .8      SUBS     r0,r0,#8
        0x0800739e:    2808        .(      CMP      r0,#8
        0x080073a0:    f4bfaf74    ..t.    BCS      0x800728c ; mpi_mul_hlp + 560
        0x080073a4:    b190        ..      CBZ      r0,0x80073cc ; mpi_mul_hlp + 880
        0x080073a6:    c920         .      LDM      r1!,{r5}
        0x080073a8:    fba56503    ...e    UMULL    r6,r5,r5,r3
        0x080073ac:    1936        6.      ADDS     r6,r6,r4
        0x080073ae:    d301        ..      BCC      0x80073b4 ; mpi_mul_hlp + 856
        0x080073b0:    2401        .$      MOVS     r4,#1
        0x080073b2:    e000        ..      B        0x80073b6 ; mpi_mul_hlp + 858
        0x080073b4:    2400        .$      MOVS     r4,#0
        0x080073b6:    1967        g.      ADDS     r7,r4,r5
        0x080073b8:    6814        .h      LDR      r4,[r2,#0]
        0x080073ba:    19a5        ..      ADDS     r5,r4,r6
        0x080073bc:    d301        ..      BCC      0x80073c2 ; mpi_mul_hlp + 870
        0x080073be:    2401        .$      MOVS     r4,#1
        0x080073c0:    e000        ..      B        0x80073c4 ; mpi_mul_hlp + 872
        0x080073c2:    2400        .$      MOVS     r4,#0
        0x080073c4:    c220         .      STM      r2!,{r5}
        0x080073c6:    443c        <D      ADD      r4,r4,r7
        0x080073c8:    1e40        @.      SUBS     r0,r0,#1
        0x080073ca:    e7eb        ..      B        0x80073a4 ; mpi_mul_hlp + 840
        0x080073cc:    6810        .h      LDR      r0,[r2,#0]
        0x080073ce:    4420         D      ADD      r0,r0,r4
        0x080073d0:    6010        .`      STR      r0,[r2,#0]
        0x080073d2:    42a0        .B      CMP      r0,r4
        0x080073d4:    d202        ..      BCS      0x80073dc ; mpi_mul_hlp + 896
        0x080073d6:    2401        .$      MOVS     r4,#1
        0x080073d8:    1d12        ..      ADDS     r2,r2,#4
        0x080073da:    e7f7        ..      B        0x80073cc ; mpi_mul_hlp + 880
        0x080073dc:    bdf0        ..      POP      {r4-r7,pc}
    i.mpi_sub_hlp
    mpi_sub_hlp
        0x080073de:    b5f0        ..      PUSH     {r4-r7,lr}
        0x080073e0:    2300        .#      MOVS     r3,#0
        0x080073e2:    461c        .F      MOV      r4,r3
        0x080073e4:    e012        ..      B        0x800740c ; mpi_sub_hlp + 46
        0x080073e6:    6815        .h      LDR      r5,[r2,#0]
        0x080073e8:    429d        .B      CMP      r5,r3
        0x080073ea:    d201        ..      BCS      0x80073f0 ; mpi_sub_hlp + 18
        0x080073ec:    2601        .&      MOVS     r6,#1
        0x080073ee:    e000        ..      B        0x80073f2 ; mpi_sub_hlp + 20
        0x080073f0:    2600        .&      MOVS     r6,#0
        0x080073f2:    1aed        ..      SUBS     r5,r5,r3
        0x080073f4:    6015        .`      STR      r5,[r2,#0]
        0x080073f6:    680f        .h      LDR      r7,[r1,#0]
        0x080073f8:    42bd        .B      CMP      r5,r7
        0x080073fa:    d201        ..      BCS      0x8007400 ; mpi_sub_hlp + 34
        0x080073fc:    2301        .#      MOVS     r3,#1
        0x080073fe:    e000        ..      B        0x8007402 ; mpi_sub_hlp + 36
        0x08007400:    2300        .#      MOVS     r3,#0
        0x08007402:    1bed        ..      SUBS     r5,r5,r7
        0x08007404:    c220         .      STM      r2!,{r5}
        0x08007406:    1d09        ..      ADDS     r1,r1,#4
        0x08007408:    4433        3D      ADD      r3,r3,r6
        0x0800740a:    1c64        d.      ADDS     r4,r4,#1
        0x0800740c:    4284        .B      CMP      r4,r0
        0x0800740e:    d3ea        ..      BCC      0x80073e6 ; mpi_sub_hlp + 8
        0x08007410:    e008        ..      B        0x8007424 ; mpi_sub_hlp + 70
        0x08007412:    6810        .h      LDR      r0,[r2,#0]
        0x08007414:    4298        .B      CMP      r0,r3
        0x08007416:    d201        ..      BCS      0x800741c ; mpi_sub_hlp + 62
        0x08007418:    2101        .!      MOVS     r1,#1
        0x0800741a:    e000        ..      B        0x800741e ; mpi_sub_hlp + 64
        0x0800741c:    2100        .!      MOVS     r1,#0
        0x0800741e:    1ac0        ..      SUBS     r0,r0,r3
        0x08007420:    c201        ..      STM      r2!,{r0}
        0x08007422:    460b        .F      MOV      r3,r1
        0x08007424:    2b00        .+      CMP      r3,#0
        0x08007426:    d1f4        ..      BNE      0x8007412 ; mpi_sub_hlp + 52
        0x08007428:    bdf0        ..      POP      {r4-r7,pc}
    i.mpi_uint_bigendian_to_host
    mpi_uint_bigendian_to_host
        0x0800742a:    4602        .F      MOV      r2,r0
        0x0800742c:    b510        ..      PUSH     {r4,lr}
        0x0800742e:    2000        .       MOVS     r0,#0
        0x08007430:    4601        .F      MOV      r1,r0
        0x08007432:    f1c10403    ....    RSB      r4,r1,#3
        0x08007436:    b2d3        ..      UXTB     r3,r2
        0x08007438:    00e4        ..      LSLS     r4,r4,#3
        0x0800743a:    40a3        .@      LSLS     r3,r3,r4
        0x0800743c:    1c49        I.      ADDS     r1,r1,#1
        0x0800743e:    4318        .C      ORRS     r0,r0,r3
        0x08007440:    b2c9        ..      UXTB     r1,r1
        0x08007442:    0a12        ..      LSRS     r2,r2,#8
        0x08007444:    2904        .)      CMP      r1,#4
        0x08007446:    d3f4        ..      BCC      0x8007432 ; mpi_uint_bigendian_to_host + 8
        0x08007448:    bd10        ..      POP      {r4,pc}
    i.reflect
    reflect
        0x0800744a:    b570        p.      PUSH     {r4-r6,lr}
        0x0800744c:    4603        .F      MOV      r3,r0
        0x0800744e:    2000        .       MOVS     r0,#0
        0x08007450:    4602        .F      MOV      r2,r0
        0x08007452:    2501        .%      MOVS     r5,#1
        0x08007454:    e009        ..      B        0x800746a ; reflect + 32
        0x08007456:    07dc        ..      LSLS     r4,r3,#31
        0x08007458:    d004        ..      BEQ      0x8007464 ; reflect + 26
        0x0800745a:    1a8e        ..      SUBS     r6,r1,r2
        0x0800745c:    1e76        v.      SUBS     r6,r6,#1
        0x0800745e:    fa05f406    ....    LSL      r4,r5,r6
        0x08007462:    4320         C      ORRS     r0,r0,r4
        0x08007464:    085b        [.      LSRS     r3,r3,#1
        0x08007466:    1c52        R.      ADDS     r2,r2,#1
        0x08007468:    b2d2        ..      UXTB     r2,r2
        0x0800746a:    428a        .B      CMP      r2,r1
        0x0800746c:    d3f3        ..      BCC      0x8007456 ; reflect + 12
        0x0800746e:    bd70        p.      POP      {r4-r6,pc}
    i.sissdk_ecdsa_load_group
    sissdk_ecdsa_load_group
        0x08007470:    b508        ..      PUSH     {r3,lr}
        0x08007472:    4905        .I      LDR      r1,[pc,#20] ; [0x8007488] = 0x2000001c
        0x08007474:    9100        ..      STR      r1,[sp,#0]
        0x08007476:    2203        ."      MOVS     r2,#3
        0x08007478:    4669        iF      MOV      r1,sp
        0x0800747a:    f7fdff27    ..'.    BL       mbedtls_ecp_tls_read_group ; 0x80052cc
        0x0800747e:    b108        ..      CBZ      r0,0x8007484 ; sissdk_ecdsa_load_group + 20
        0x08007480:    2000        .       MOVS     r0,#0
        0x08007482:    bd08        ..      POP      {r3,pc}
        0x08007484:    2001        .       MOVS     r0,#1
        0x08007486:    bd08        ..      POP      {r3,pc}
    $d
        0x08007488:    2000001c    ...     DCD    536870940
    $t
    i.sissdk_ecdsa_load_publickey
    sissdk_ecdsa_load_publickey
        0x0800748c:    b570        p.      PUSH     {r4-r6,lr}
        0x0800748e:    4605        .F      MOV      r5,r0
        0x08007490:    460c        .F      MOV      r4,r1
        0x08007492:    4608        .F      MOV      r0,r1
        0x08007494:    f7ffffec    ....    BL       sissdk_ecdsa_load_group ; 0x8007470
        0x08007498:    2800        .(      CMP      r0,#0
        0x0800749a:    d008        ..      BEQ      0x80074ae ; sissdk_ecdsa_load_publickey + 34
        0x0800749c:    2331        1#      MOVS     r3,#0x31
        0x0800749e:    462a        *F      MOV      r2,r5
        0x080074a0:    f1040188    ....    ADD      r1,r4,#0x88
        0x080074a4:    4620         F      MOV      r0,r4
        0x080074a6:    f7fdfe85    ....    BL       mbedtls_ecp_point_read_binary ; 0x80051b4
        0x080074aa:    b108        ..      CBZ      r0,0x80074b0 ; sissdk_ecdsa_load_publickey + 36
        0x080074ac:    2000        .       MOVS     r0,#0
        0x080074ae:    bd70        p.      POP      {r4-r6,pc}
        0x080074b0:    2001        .       MOVS     r0,#1
        0x080074b2:    bd70        p.      POP      {r4-r6,pc}
    i.sissdk_ecdsa_sha256
    sissdk_ecdsa_sha256
        0x080074b4:    b510        ..      PUSH     {r4,lr}
        0x080074b6:    2800        .(      CMP      r0,#0
        0x080074b8:    d005        ..      BEQ      0x80074c6 ; sissdk_ecdsa_sha256 + 18
        0x080074ba:    2300        .#      MOVS     r3,#0
        0x080074bc:    4a06        .J      LDR      r2,[pc,#24] ; [0x80074d8] = 0x200000d8
        0x080074be:    f7fffcf9    ....    BL       mbedtls_sha256_ret ; 0x8006eb4
        0x080074c2:    b108        ..      CBZ      r0,0x80074c8 ; sissdk_ecdsa_sha256 + 20
        0x080074c4:    2000        .       MOVS     r0,#0
        0x080074c6:    bd10        ..      POP      {r4,pc}
        0x080074c8:    2220         "      MOVS     r2,#0x20
        0x080074ca:    4903        .I      LDR      r1,[pc,#12] ; [0x80074d8] = 0x200000d8
        0x080074cc:    a003        ..      ADR      r0,{pc}+0x10 ; 0x80074dc
        0x080074ce:    f000f843    ..C.    BL       util_dump_buf ; 0x8007558
        0x080074d2:    4801        .H      LDR      r0,[pc,#4] ; [0x80074d8] = 0x200000d8
        0x080074d4:    bd10        ..      POP      {r4,pc}
    $d
        0x080074d6:    0000        ..      DCW    0
        0x080074d8:    200000d8    ...     DCD    536871128
        0x080074dc:    5d6b6f5b    [ok]    DCD    1567321947
        0x080074e0:    6148203a    : Ha    DCD    1632116794
        0x080074e4:    3d206873    sh =    DCD    1025534067
        0x080074e8:    00000020     ...    DCD    32
    $t
    i.sissdk_ecdsa_verify
    sissdk_ecdsa_verify
        0x080074ec:    b570        p.      PUSH     {r4-r6,lr}
        0x080074ee:    461c        .F      MOV      r4,r3
        0x080074f0:    460b        .F      MOV      r3,r1
        0x080074f2:    4606        .F      MOV      r6,r0
        0x080074f4:    b0ac        ..      SUB      sp,sp,#0xb0
        0x080074f6:    4611        .F      MOV      r1,r2
        0x080074f8:    4618        .F      MOV      r0,r3
        0x080074fa:    f7ffffdb    ....    BL       sissdk_ecdsa_sha256 ; 0x80074b4
        0x080074fe:    0005        ..      MOVS     r5,r0
        0x08007500:    d013        ..      BEQ      0x800752a ; sissdk_ecdsa_verify + 62
        0x08007502:    a801        ..      ADD      r0,sp,#4
        0x08007504:    f7fafd77    ..w.    BL       mbedtls_ecdsa_init ; 0x8001ff6
        0x08007508:    a901        ..      ADD      r1,sp,#4
        0x0800750a:    4630        0F      MOV      r0,r6
        0x0800750c:    f7ffffbe    ....    BL       sissdk_ecdsa_load_publickey ; 0x800748c
        0x08007510:    b140        @.      CBZ      r0,0x8007524 ; sissdk_ecdsa_verify + 56
        0x08007512:    8820         .      LDRH     r0,[r4,#0]
        0x08007514:    9000        ..      STR      r0,[sp,#0]
        0x08007516:    1ca3        ..      ADDS     r3,r4,#2
        0x08007518:    2220         "      MOVS     r2,#0x20
        0x0800751a:    4629        )F      MOV      r1,r5
        0x0800751c:    a801        ..      ADD      r0,sp,#4
        0x0800751e:    f7fdfad2    ....    BL       mbedtls_ecdsa_read_signature ; 0x8004ac6
        0x08007522:    b128        (.      CBZ      r0,0x8007530 ; sissdk_ecdsa_verify + 68
        0x08007524:    a801        ..      ADD      r0,sp,#4
        0x08007526:    f7fdfac9    ....    BL       mbedtls_ecdsa_free ; 0x8004abc
        0x0800752a:    2000        .       MOVS     r0,#0
        0x0800752c:    b02c        ,.      ADD      sp,sp,#0xb0
        0x0800752e:    bd70        p.      POP      {r4-r6,pc}
        0x08007530:    a801        ..      ADD      r0,sp,#4
        0x08007532:    f7fdfac3    ....    BL       mbedtls_ecdsa_free ; 0x8004abc
        0x08007536:    2001        .       MOVS     r0,#1
        0x08007538:    e7f8        ..      B        0x800752c ; sissdk_ecdsa_verify + 64
    i.sub32
    sub32
        0x0800753a:    b510        ..      PUSH     {r4,lr}
        0x0800753c:    6804        .h      LDR      r4,[r0,#0]
        0x0800753e:    f9923000    ...0    LDRSB    r3,[r2,#0]
        0x08007542:    428c        .B      CMP      r4,r1
        0x08007544:    d201        ..      BCS      0x800754a ; sub32 + 16
        0x08007546:    2401        .$      MOVS     r4,#1
        0x08007548:    e000        ..      B        0x800754c ; sub32 + 18
        0x0800754a:    2400        .$      MOVS     r4,#0
        0x0800754c:    1b1b        ..      SUBS     r3,r3,r4
        0x0800754e:    7013        .p      STRB     r3,[r2,#0]
        0x08007550:    6802        .h      LDR      r2,[r0,#0]
        0x08007552:    1a51        Q.      SUBS     r1,r2,r1
        0x08007554:    6001        .`      STR      r1,[r0,#0]
        0x08007556:    bd10        ..      POP      {r4,pc}
    i.util_dump_buf
    util_dump_buf
        0x08007558:    2000        .       MOVS     r0,#0
        0x0800755a:    e000        ..      B        0x800755e ; util_dump_buf + 6
        0x0800755c:    1c40        @.      ADDS     r0,r0,#1
        0x0800755e:    4290        .B      CMP      r0,r2
        0x08007560:    d3fc        ..      BCC      0x800755c ; util_dump_buf + 4
        0x08007562:    4770        pG      BX       lr
    $d.realdata
    .constdata
    AHBPrescTable
        0x08007564:    00000000    ....    DCD    0
        0x08007568:    00000000    ....    DCD    0
        0x0800756c:    04030201    ....    DCD    67305985
        0x08007570:    09080706    ....    DCD    151521030
    .constdata
