openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x08007b64:    1f6e5377    wSn.    DCD    527324023
        0x08007b68:    2013481d    .H.     DCD    538134557
        0x08007b6c:    d5262028    ( &.    DCD    3576045608
        0x08007b70:    6e3bf623    #.;n    DCD    1849423395
        0x08007b74:    9d838d72    r...    DCD    2642644338
        0x08007b78:    3e660a90    ..f>    DCD    1046874768
        0x08007b7c:    a1eea9bc    ....    DCD    2716772796
        0x08007b80:    a9fb57db    .W..    DCD    2851821531
    brainpoolP256r1_a
        0x08007b84:    f330b5d9    ..0.    DCD    4080055769
        0x08007b88:    e94a4b44    DKJ.    DCD    3913960260
        0x08007b8c:    26dc5c6c    l\.&    DCD    651975788
        0x08007b90:    fb8055c1    .U..    DCD    4219491777
        0x08007b94:    417affe7    ..zA    DCD    1098579943
        0x08007b98:    eef67530    0u..    DCD    4009129264
        0x08007b9c:    fc2c3057    W0,.    DCD    4230754391
        0x08007ba0:    7d5a0975    u.Z}    DCD    2103052661
    brainpoolP256r1_b
        0x08007ba4:    ff8c07b6    ....    DCD    4287367094
        0x08007ba8:    6bccdc18    ...k    DCD    1808587800
        0x08007bac:    5cf7e1ce    ...\    DCD    1559749070
        0x08007bb0:    95841629    )...    DCD    2508461609
        0x08007bb4:    bbd77cbf    .|..    DCD    3151461567
        0x08007bb8:    f330b5d9    ..0.    DCD    4080055769
        0x08007bbc:    e94a4b44    DKJ.    DCD    3913960260
        0x08007bc0:    26dc5c6c    l\.&    DCD    651975788
    brainpoolP256r1_gx
        0x08007bc4:    9ace3262    b2..    DCD    2597204578
        0x08007bc8:    3a4453bd    .SD:    DCD    977556413
        0x08007bcc:    e3bd23c2    .#..    DCD    3820823490
        0x08007bd0:    b9de27e1    .'..    DCD    3118344161
        0x08007bd4:    fc81b7af    ....    DCD    4236359599
        0x08007bd8:    2c4b482f    /HK,    DCD    743131183
        0x08007bdc:    cb7e57cb    .W~.    DCD    3414054859
        0x08007be0:    8bd2aeb9    ....    DCD    2345840313
    brainpoolP256r1_gy
        0x08007be4:    2f046997    .i./    DCD    788818327
        0x08007be8:    5c1d54c7    .T.\    DCD    1545426119
        0x08007bec:    2ded8e54    T..-    DCD    770543188
        0x08007bf0:    c2774513    .Ew.    DCD    3262596371
        0x08007bf4:    14611dc9    ..a.    DCD    341908937
        0x08007bf8:    97f8461a    .F..    DCD    2549630490
        0x08007bfc:    c3dac4fd    ....    DCD    3285894397
        0x08007c00:    547ef835    5.~T    DCD    1417607221
    brainpoolP256r1_n
        0x08007c04:    974856a7    .VH.    DCD    2538100391
        0x08007c08:    901e0e82    ....    DCD    2417888898
        0x08007c0c:    b561a6f7    ..a.    DCD    3043075831
        0x08007c10:    8c397aa3    .z9.    DCD    2352577187
        0x08007c14:    9d838d71    q...    DCD    2642644337
        0x08007c18:    3e660a90    ..f>    DCD    1046874768
        0x08007c1c:    a1eea9bc    ....    DCD    2716772796
        0x08007c20:    a9fb57db    .W..    DCD    2851821531
    brainpoolP384r1_p
        0x08007c24:    3107ec53    S..1    DCD    822602835
        0x08007c28:    87470013    ..G.    DCD    2269577235
        0x08007c2c:    901d1a71    q...    DCD    2417826417
        0x08007c30:    acd3a729    )...    DCD    2899552041
        0x08007c34:    7fb71123    #...    DCD    2142703907
        0x08007c38:    12b1da19    ....    DCD    313645593
        0x08007c3c:    ed5456b4    .VT.    DCD    3981727412
        0x08007c40:    152f7109    .q/.    DCD    355430665
        0x08007c44:    50e641df    .A.P    DCD    1357267423
        0x08007c48:    0f5d6f7e    ~o].    DCD    257781630
        0x08007c4c:    a3386d28    (m8.    DCD    2738384168
        0x08007c50:    8cb91e82    ....    DCD    2360942210
    brainpoolP384r1_a
        0x08007c54:    22ce2826    &(."    DCD    583936038
        0x08007c58:    04a8c7dd    ....    DCD    78170077
        0x08007c5c:    503ad4eb    ..:P    DCD    1346032875
        0x08007c60:    8aa5814a    J...    DCD    2326102346
        0x08007c64:    ba91f90f    ....    DCD    3130128655
        0x08007c68:    139165ef    .e..    DCD    328295919
        0x08007c6c:    4fb22787    .'.O    DCD    1337075591
        0x08007c70:    c2bea28e    ....    DCD    3267273358
        0x08007c74:    ce05afa0    ....    DCD    3456479136
        0x08007c78:    3c72080a    ..r<    DCD    1014106122
        0x08007c7c:    3d8c150c    ...=    DCD    1032590604
        0x08007c80:    7bc382c6    ...{    DCD    2076410566
    brainpoolP384r1_b
        0x08007c84:    fa504c11    .LP.    DCD    4199566353
        0x08007c88:    3ab78696    ...:    DCD    985106070
        0x08007c8c:    95dbc994    ....    DCD    2514209172
        0x08007c90:    7cb43902    .9.|    DCD    2092185858
        0x08007c94:    3eeb62d5    .b.>    DCD    1055613653
        0x08007c98:    2e880ea5    ....    DCD    780668581
        0x08007c9c:    07dcd2a6    ....    DCD    131912358
        0x08007ca0:    2fb77de1    .}./    DCD    800554465
        0x08007ca4:    16f0447c    |D..    DCD    384844924
        0x08007ca8:    8b39b554    T.9.    DCD    2335814996
        0x08007cac:    22ce2826    &(."    DCD    583936038
        0x08007cb0:    04a8c7dd    ....    DCD    78170077
    brainpoolP384r1_gx
        0x08007cb4:    47d4af1e    ...G    DCD    1205120798
        0x08007cb8:    ef87b2e2    ....    DCD    4018647778
        0x08007cbc:    36d646aa    .F.6    DCD    920012458
        0x08007cc0:    e826e034    4.&.    DCD    3894861876
        0x08007cc4:    0cbd10e8    ....    DCD    213717224
        0x08007cc8:    db7fcafe    ....    DCD    3682585342
        0x08007ccc:    7ef14fe3    .O.~    DCD    2129743843
        0x08007cd0:    8847a3e7    ..G.    DCD    2286396391
        0x08007cd4:    b7c13f6b    k?..    DCD    3082895211
        0x08007cd8:    a2a63a81    .:..    DCD    2728802945
        0x08007cdc:    68cf45ff    .E.h    DCD    1758414335
        0x08007ce0:    1d1c64f0    .d..    DCD    488400112
    brainpoolP384r1_gy
        0x08007ce4:    263c5315    .S<&    DCD    641487637
        0x08007ce8:    42820341    A..B    DCD    1115816769
        0x08007cec:    77918111    ...w    DCD    2006024465
        0x08007cf0:    0e464621    !FF.    DCD    239486497
        0x08007cf4:    f9912928    ()..    DCD    4187040040
        0x08007cf8:    e19c054f    O...    DCD    3785098575
        0x08007cfc:    feec5864    dX..    DCD    4276901988
        0x08007d00:    62b70b29    )..b    DCD    1656163113
        0x08007d04:    95cfd552    R...    DCD    2513425746
        0x08007d08:    5cb1eb8e    ...\    DCD    1555164046
        0x08007d0c:    20f9c2a4    ...     DCD    553239204
        0x08007d10:    8abe1d75    u...    DCD    2327715189
    brainpoolP384r1_n
        0x08007d14:    e9046565    ee..    DCD    3909379429
        0x08007d18:    3b883202    .2.;    DCD    998781442
        0x08007d1c:    6b7fc310    ...k    DCD    1803535120
        0x08007d20:    cf3ab6af    ..:.    DCD    3476731567
        0x08007d24:    ac0425a7    .%..    DCD    2885952935
        0x08007d28:    1f166e6c    ln..    DCD    521563756
        0x08007d2c:    ed5456b3    .VT.    DCD    3981727411
        0x08007d30:    152f7109    .q/.    DCD    355430665
        0x08007d34:    50e641df    .A.P    DCD    1357267423
        0x08007d38:    0f5d6f7e    ~o].    DCD    257781630
        0x08007d3c:    a3386d28    (m8.    DCD    2738384168
        0x08007d40:    8cb91e82    ....    DCD    2360942210
    brainpoolP512r1_p
        0x08007d44:    583a48f3    .H:X    DCD    1480214771
        0x08007d48:    28aa6056    V`.(    DCD    682254422
        0x08007d4c:    2d82c685    ...-    DCD    763545221
        0x08007d50:    2881ff2f    /..(    DCD    679608111
        0x08007d54:    e6a380e6    ....    DCD    3869475046
        0x08007d58:    aecda12a    *...    DCD    2932711722
        0x08007d5c:    9bc66842    Bh..    DCD    2613471298
        0x08007d60:    7d4d9b00    ..M}    DCD    2102237952
        0x08007d64:    70330871    q.3p    DCD    1882392689
        0x08007d68:    d6639cca    ..c.    DCD    3596852426
        0x08007d6c:    b3c9d20e    ....    DCD    3016348174
        0x08007d70:    cb308db3    ..0.    DCD    3408956851
        0x08007d74:    33c9fc07    ...3    DCD    868875271
        0x08007d78:    3fd4e6ae    ...?    DCD    1070917294
        0x08007d7c:    dbe9c48b    ....    DCD    3689530507
        0x08007d80:    aadd9db8    ....    DCD    2866650552
    brainpoolP512r1_a
        0x08007d84:    77fc94ca    ...w    DCD    2013041866
        0x08007d88:    e7c1ac4d    M...    DCD    3888229453
        0x08007d8c:    2bf2c7b9    ...+    DCD    737331129
        0x08007d90:    7f1117a7    ....    DCD    2131826599
        0x08007d94:    8b9ac8b5    ....    DCD    2342176949
        0x08007d98:    0a2ef1c9    ....    DCD    170848713
        0x08007d9c:    a8253aa1    .:%.    DCD    2821012129
        0x08007da0:    2ded5d5a    Z].-    DCD    770530650
        0x08007da4:    ea9863bc    .c..    DCD    3935855548
        0x08007da8:    a83441ca    .A4.    DCD    2821997002
        0x08007dac:    3df91610    ...=    DCD    1039734288
        0x08007db0:    94cbdd8d    ....    DCD    2496388493
        0x08007db4:    ac234cc5    .L#.    DCD    2887994565
        0x08007db8:    e2327145    Eq2.    DCD    3794956613
        0x08007dbc:    8b603b89    .;`.    DCD    2338339721
        0x08007dc0:    7830a331    1.0x    DCD    2016453425
    brainpoolP512r1_b
        0x08007dc4:    8016f723    #...    DCD    2148988707
        0x08007dc8:    2809bd63    c..(    DCD    671726947
        0x08007dcc:    5ebae5dd    ...^    DCD    1589306845
        0x08007dd0:    984050b7    .P@.    DCD    2554351799
        0x08007dd4:    dc083e67    g>..    DCD    3691527783
        0x08007dd8:    77fc94ca    ...w    DCD    2013041866
        0x08007ddc:    e7c1ac4d    M...    DCD    3888229453
        0x08007de0:    2bf2c7b9    ...+    DCD    737331129
        0x08007de4:    7f1117a7    ....    DCD    2131826599
        0x08007de8:    8b9ac8b5    ....    DCD    2342176949
        0x08007dec:    0a2ef1c9    ....    DCD    170848713
        0x08007df0:    a8253aa1    .:%.    DCD    2821012129
        0x08007df4:    2ded5d5a    Z].-    DCD    770530650
        0x08007df8:    ea9863bc    .c..    DCD    3935855548
        0x08007dfc:    a83441ca    .A4.    DCD    2821997002
        0x08007e00:    3df91610    ...=    DCD    1039734288
    brainpoolP512r1_gx
        0x08007e04:    bcb9f822    "...    DCD    3166304290
        0x08007e08:    8b352209    ."5.    DCD    2335515145
        0x08007e0c:    406a5e68    h^j@    DCD    1080712808
        0x08007e10:    7c6d5047    GPm|    DCD    2087538759
        0x08007e14:    93b97d5f    _}..    DCD    2478407007
        0x08007e18:    50d1687b    {h.P    DCD    1355901051
        0x08007e1c:    e2d0d48d    ....    DCD    3805336717
        0x08007e20:    ff3b1f78    x.;.    DCD    4282064760
        0x08007e24:    f4d0098e    ....    DCD    4107274638
        0x08007e28:    b43b62ee    .b;.    DCD    3023790830
        0x08007e2c:    b5d916c1    ....    DCD    3050903233
        0x08007e30:    85ed9f70    p...    DCD    2246942576
        0x08007e34:    9c4c6a93    .jL.    DCD    2622253715
        0x08007e38:    5a21322e    .2!Z    DCD    1512124974
        0x08007e3c:    d82ed964    d...    DCD    3626948964
        0x08007e40:    81aee4bd    ....    DCD    2175722685
    brainpoolP512r1_gy
        0x08007e44:    3ad80892    ...:    DCD    987236498
        0x08007e48:    78cd1e0f    ...x    DCD    2026708495
        0x08007e4c:    a8f05406    .T..    DCD    2834322438
        0x08007e50:    d1ca2b2f    /+..    DCD    3519687471
        0x08007e54:    8a2763ae    .c'.    DCD    2317837230
        0x08007e58:    5bca4bd8    .K.[    DCD    1539984344
        0x08007e5c:    4a5f485e    ^H_J    DCD    1247758430
        0x08007e60:    b2dcde49    I...    DCD    3000819273
        0x08007e64:    881f8111    ....    DCD    2283766033
        0x08007e68:    a000c55b    [...    DCD    2684405083
        0x08007e6c:    24a57b1a    .{.$    DCD    614824730
        0x08007e70:    f209f700    ....    DCD    4060739328
        0x08007e74:    cf7822fd    ."x.    DCD    3480756989
        0x08007e78:    c0eabfa9    ....    DCD    3236609961
        0x08007e7c:    566332ec    .2cV    DCD    1449341676
        0x08007e80:    7dde385d    ]8.}    DCD    2111715421
    brainpoolP512r1_n
        0x08007e84:    9ca90069    i...    DCD    2628321385
        0x08007e88:    b5879682    ....    DCD    3045561986
        0x08007e8c:    085ddadd    ..].    DCD    140368605
        0x08007e90:    1db1d381    ....    DCD    498193281
        0x08007e94:    7fac1047    G...    DCD    2141982791
        0x08007e98:    41866119    .a.A    DCD    1099325721
        0x08007e9c:    4ca92619    .&.L    DCD    1286153753
        0x08007ea0:    553e5c41    A\>U    DCD    1430150209
        0x08007ea4:    70330870    p.3p    DCD    1882392688
        0x08007ea8:    d6639cca    ..c.    DCD    3596852426
        0x08007eac:    b3c9d20e    ....    DCD    3016348174
        0x08007eb0:    cb308db3    ..0.    DCD    3408956851
        0x08007eb4:    33c9fc07    ...3    DCD    868875271
        0x08007eb8:    3fd4e6ae    ...?    DCD    1070917294
        0x08007ebc:    dbe9c48b    ....    DCD    3689530507
        0x08007ec0:    aadd9db8    ....    DCD    2866650552
    .constdata
    K
        0x08007ec4:    428a2f98    ./.B    DCD    1116352408
        0x08007ec8:    71374491    .D7q    DCD    1899447441
        0x08007ecc:    b5c0fbcf    ....    DCD    3049323471
        0x08007ed0:    e9b5dba5    ....    DCD    3921009573
        0x08007ed4:    3956c25b    [.V9    DCD    961987163
        0x08007ed8:    59f111f1    ...Y    DCD    1508970993
        0x08007edc:    923f82a4    ..?.    DCD    2453635748
        0x08007ee0:    ab1c5ed5    .^..    DCD    2870763221
        0x08007ee4:    d807aa98    ....    DCD    3624381080
        0x08007ee8:    12835b01    .[..    DCD    310598401
        0x08007eec:    243185be    ..1$    DCD    607225278
        0x08007ef0:    550c7dc3    .}.U    DCD    1426881987
        0x08007ef4:    72be5d74    t].r    DCD    1925078388
        0x08007ef8:    80deb1fe    ....    DCD    2162078206
        0x08007efc:    9bdc06a7    ....    DCD    2614888103
        0x08007f00:    c19bf174    t...    DCD    3248222580
        0x08007f04:    e49b69c1    .i..    DCD    3835390401
        0x08007f08:    efbe4786    .G..    DCD    4022224774
        0x08007f0c:    0fc19dc6    ....    DCD    264347078
        0x08007f10:    240ca1cc    ...$    DCD    604807628
        0x08007f14:    2de92c6f    o,.-    DCD    770255983
        0x08007f18:    4a7484aa    ..tJ    DCD    1249150122
        0x08007f1c:    5cb0a9dc    ...\    DCD    1555081692
        0x08007f20:    76f988da    ...v    DCD    1996064986
        0x08007f24:    983e5152    RQ>.    DCD    2554220882
        0x08007f28:    a831c66d    m.1.    DCD    2821834349
        0x08007f2c:    b00327c8    .'..    DCD    2952996808
        0x08007f30:    bf597fc7    ..Y.    DCD    3210313671
        0x08007f34:    c6e00bf3    ....    DCD    3336571891
        0x08007f38:    d5a79147    G...    DCD    3584528711
        0x08007f3c:    06ca6351    Qc..    DCD    113926993
        0x08007f40:    14292967    g)).    DCD    338241895
        0x08007f44:    27b70a85    ...'    DCD    666307205
        0x08007f48:    2e1b2138    8!..    DCD    773529912
        0x08007f4c:    4d2c6dfc    .m,M    DCD    1294757372
        0x08007f50:    53380d13    ..8S    DCD    1396182291
        0x08007f54:    650a7354    Ts.e    DCD    1695183700
        0x08007f58:    766a0abb    ..jv    DCD    1986661051
        0x08007f5c:    81c2c92e    ....    DCD    2177026350
        0x08007f60:    92722c85    .,r.    DCD    2456956037
        0x08007f64:    a2bfe8a1    ....    DCD    2730485921
        0x08007f68:    a81a664b    Kf..    DCD    2820302411
        0x08007f6c:    c24b8b70    p.K.    DCD    3259730800
        0x08007f70:    c76c51a3    .Ql.    DCD    3345764771
        0x08007f74:    d192e819    ....    DCD    3516065817
        0x08007f78:    d6990624    $...    DCD    3600352804
        0x08007f7c:    f40e3585    .5..    DCD    4094571909
        0x08007f80:    106aa070    p.j.    DCD    275423344
        0x08007f84:    19a4c116    ....    DCD    430227734
        0x08007f88:    1e376c08    .l7.    DCD    506948616
        0x08007f8c:    2748774c    LwH'    DCD    659060556
        0x08007f90:    34b0bcb5    ...4    DCD    883997877
        0x08007f94:    391c0cb3    ...9    DCD    958139571
        0x08007f98:    4ed8aa4a    J..N    DCD    1322822218
        0x08007f9c:    5b9cca4f    O..[    DCD    1537002063
        0x08007fa0:    682e6ff3    .o.h    DCD    1747873779
        0x08007fa4:    748f82ee    ...t    DCD    1955562222
        0x08007fa8:    78a5636f    oc.x    DCD    2024104815
        0x08007fac:    84c87814    .x..    DCD    2227730452
        0x08007fb0:    8cc70208    ....    DCD    2361852424
        0x08007fb4:    90befffa    ....    DCD    2428436474
        0x08007fb8:    a4506ceb    .lP.    DCD    2756734187
        0x08007fbc:    bef9a3f7    ....    DCD    3204031479
        0x08007fc0:    c67178f2    .xq.    DCD    3329325298
    .constdata
    m_flash_verify_skip_items
        0x08007fc4:    08007fdc    ....    DCD    134250460
        0x08007fc8:    00000024    $...    DCD    36
        0x08007fcc:    08002000    . ..    DCD    134225920
        0x08007fd0:    0000008d    ....    DCD    141
        0x08007fd4:    08001000    ....    DCD    134221824
        0x08007fd8:    00000004    ....    DCD    4
    .constdata
    m_flash_verify
        0x08007fdc:    9bdd2188    .!..    DCD    2614960520
        0x08007fe0:    acd8961b    ....    DCD    2899875355
        0x08007fe4:    00000003    ....    DCD    3
        0x08007fe8:    08007fc4    ....    DCD    134250436
        0x08007fec:    ffffffff    ....    DCD    4294967295
        0x08007ff0:    00000000    ....    DCD    0
        0x08007ff4:    ffffffff    ....    DCD    4294967295
        0x08007ff8:    31447c82    .|D1    DCD    826571906
        0x08007ffc:    39ad0967    g..9    DCD    967641447
    .constdata
    m_ptable
        0x08008000:    c29320a6    . ..    DCD    3264422054
        0x08008004:    0c4cc1b8    ..L.    DCD    206356920
        0x08008008:    be730bf3    ..s.    DCD    3195210739
        0x0800800c:    e19d7744    Dw..    DCD    3785193284
        0x08008010:    c376caee    ..v.    DCD    3279342318
        0x08008014:    cbb7ed24    $...    DCD    3417828644
        0x08008018:    ce4639ff    .9F.    DCD    3460708863
        0x0800801c:    3e5786cd    ..W>    DCD    1045923533
        0x08008020:    c6bb855b    [...    DCD    3334178139
        0x08008024:    4915f2c8    ...I    DCD    1226175176
        0x08008028:    70d4a1bc    ...p    DCD    1892983228
        0x0800802c:    651433db    .3.e    DCD    1695822811
        0x08008030:    7d96561a    .V.}    DCD    2107004442
        0x08008034:    606659c9    .Yf`    DCD    1617320393
        0x08008038:    0faed51d    ....    DCD    263116061
        0x0800803c:    400637f4    .7.@    DCD    1074149364
        0x08008040:    fdf788e7    ....    DCD    4260858087
        0x08008044:    8992e474    t...    DCD    2308105332
        0x08008048:    cca9d311    ....    DCD    3433681681
        0x0800804c:    19944584    .E..    DCD    429147524
        0x08008050:    dc1ca0f5    ....    DCD    3692863733
        0x08008054:    36f6874d    M..6    DCD    922126157
        0x08008058:    62070d64    d..b    DCD    1644629348
        0x0800805c:    bd4ed150    P.N.    DCD    3176059216
        0x08008060:    126c99dd    ..l.    DCD    309107165
        0x08008064:    b6d98b01    ....    DCD    3067710209
        0x08008068:    912138ef    .8!.    DCD    2434873583
        0x0800806c:    7b0afc98    ...{    DCD    2064317592
        0x08008070:    b56eb034    4.n.    DCD    3043930164
        0x08008074:    c02d2ad7    .*-.    DCD    3224185559
        0x08008078:    00a51bb9    ....    DCD    10820537
        0x0800807c:    aaac7f7e    ~...    DCD    2863431550
        0x08008080:    9ec4c75e    ^...    DCD    2663696222
        0x08008084:    482eb3fb    ...H    DCD    1211020283
        0x08008088:    956a2fe0    ./j.    DCD    2506764256
        0x0800808c:    3f3cba30    0.<?    DCD    1060944432
        0x08008090:    619bfee5    ...a    DCD    1637613285
        0x08008094:    6f68f8cf    ..ho    DCD    1869150415
        0x08008098:    3510e31f    ...5    DCD    890299167
        0x0800809c:    821e908c    ....    DCD    2183041164
        0x080080a0:    038febd6    ....    DCD    59763670
        0x080080a4:    a48d4f5a    ZO..    DCD    2760724314
        0x080080a8:    539f5275    uR.S    DCD    1402950261
        0x080080ac:    e6267972    ry&.    DCD    3861281138
        0x080080b0:    298a0508    ...)    DCD    696911112
        0x080080b4:    dab4b1df    ....    DCD    3669275103
        0x080080b8:    09e2973d    =...    DCD    165844797
        0x080080bc:    6bf02523    #%.k    DCD    1810900259
        0x080080c0:    c5804a67    gJ..    DCD    3313519207
        0x080080c4:    0e3a54ad    .T:.    DCD    238703789
        0x080080c8:    5869d28e    ..iX    DCD    1483330190
        0x080080cc:    4b2281f9    .."K    DCD    1260552697
        0x080080d0:    165faf63    c._.    DCD    375369571
        0x080080d4:    475dd002    ..]G    DCD    1197330434
        0x080080d8:    436d7813    .xmC    DCD    1131247635
        0x080080dc:    41ec9c28    (..A    DCD    1106025512
        0x080080e0:    5ca7712b    +q.\    DCD    1554477355
        0x080080e4:    2cf151de    .Q.,    DCD    754012638
        0x080080e8:    7ce89ab2    ...|    DCD    2095618738
        0x080080ec:    3b42a217    ..B;    DCD    994222615
        0x080080f0:    27bf5532    2U.'    DCD    666850610
        0x080080f4:    d8e9eafa    ....    DCD    3639208698
        0x080080f8:    a8310418    ..1.    DCD    2821784600
        0x080080fc:    7a83a3ab    ...z    DCD    2055447467
    .constdata
    m_ramcode
        0x08008100:    0230aead    ..0.    DCD    36744877
        0x08008104:    51e6d415    ...Q    DCD    1374082069
        0x08008108:    20017000    .p.     DCD    536965120
        0x0800810c:    00000000    ....    DCD    0
        0x08008110:    00000000    ....    DCD    0
        0x08008114:    ffffffff    ....    DCD    4294967295
        0x08008118:    dd91892c    ,...    DCD    3717302572
        0x0800811c:    cbeccbe6    ....    DCD    3421293542
    .constdata
    ECDSA_PUBLIC_KEY
        0x08008120:    37083704    .7.7    DCD    923285252
        0x08008124:    0f25df86    ..%.    DCD    254140294
        0x08008128:    d8921f8c    ....    DCD    3633454988
        0x0800812c:    38820e33    3..8    DCD    948047411
        0x08008130:    0927674a    Jg'.    DCD    153577290
        0x08008134:    1f7afeac    ..z.    DCD    528154284
        0x08008138:    a4490224    $.I.    DCD    2756248100
        0x0800813c:    ab67ed03    ..g.    DCD    2875714819
        0x08008140:    3761994a    J.a7    DCD    929143114
        0x08008144:    1eed7afe    .z..    DCD    518879998
        0x08008148:    0b1fe96c    l...    DCD    186640748
        0x0800814c:    1f0bcaec    ....    DCD    520866540
        0x08008150:    00000026    &...    DCD    38
