openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
    .conststring
        0x08008154:    70636573    secp    DCD    1885562227
        0x08008158:    6b323931    192k    DCD    1798453553
        0x0800815c:    00000031    1...    DCD    49
        0x08008160:    70636573    secp    DCD    1885562227
        0x08008164:    6b343232    224k    DCD    1798582834
        0x08008168:    00000031    1...    DCD    49
        0x0800816c:    70636573    secp    DCD    1885562227
        0x08008170:    6b363532    256k    DCD    1798714674
        0x08008174:    00000031    1...    DCD    49
        0x08008178:    70636573    secp    DCD    1885562227
        0x0800817c:    72313235    521r    DCD    1915826741
        0x08008180:    00000031    1...    DCD    49
        0x08008184:    69617262    brai    DCD    1767993954
        0x08008188:    6f6f706e    npoo    DCD    1869574254
        0x0800818c:    3135506c    lP51    DCD    825577580
        0x08008190:    00317232    2r1.    DCD    3240498
        0x08008194:    70636573    secp    DCD    1885562227
        0x08008198:    72323931    192r    DCD    1915894065
        0x0800819c:    00000031    1...    DCD    49
        0x080081a0:    70636573    secp    DCD    1885562227
        0x080081a4:    72343232    224r    DCD    1916023346
        0x080081a8:    00000031    1...    DCD    49
        0x080081ac:    69617262    brai    DCD    1767993954
        0x080081b0:    6f6f706e    npoo    DCD    1869574254
        0x080081b4:    3833506c    lP38    DCD    942887020
        0x080081b8:    00317234    4r1.    DCD    3240500
        0x080081bc:    70636573    secp    DCD    1885562227
        0x080081c0:    72343833    384r    DCD    1916024883
        0x080081c4:    00000031    1...    DCD    49
        0x080081c8:    69617262    brai    DCD    1767993954
        0x080081cc:    6f6f706e    npoo    DCD    1869574254
        0x080081d0:    3532506c    lP25    DCD    892489836
        0x080081d4:    00317236    6r1.    DCD    3240502
        0x080081d8:    70636573    secp    DCD    1885562227
        0x080081dc:    72363532    256r    DCD    1916155186
        0x080081e0:    00000031    1...    DCD    49
    Region$$Table$$Base
        0x080081e4:    08008204    ....    DCD    134251012
        0x080081e8:    20000000    ...     DCD    536870912
        0x080081ec:    00000070    p...    DCD    112
        0x080081f0:    0800016c    l...    DCD    134218092
        0x080081f4:    08008274    t...    DCD    134251124
        0x080081f8:    20000070    p..     DCD    536871024
        0x080081fc:    000025b0    .%..    DCD    9648
        0x08008200:    08000188    ....    DCD    134218120
    Region$$Table$$Limit

** Section #2 'RW_IRAM1' (SHT_PROGBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 112 bytes (alignment 8)
    Address: 0x20000000


** Section #3 'RW_IRAM1' (SHT_NOBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 9648 bytes (alignment 8)
    Address: 0x20000070


** Section #4 'ER_IROM2' (SHT_PROGBITS) [SHF_ALLOC + SHF_EXECINSTR]
    Size   : 2876 bytes (alignment 4)
    Address: 0x20017000

    $t
    .ARM.__at_0x20017000
    advance_software_protect_flash_verify
        0x20017000:    e92d41f0    -..A    PUSH     {r4-r8,lr}
        0x20017004:    f000f882    ....    BL       $Ven$TT$L$$advance_software_protect_flash_verify_init ; 0x2001710c
        0x20017008:    2800        .(      CMP      r0,#0
        0x2001700a:    d003        ..      BEQ      0x20017014 ; advance_software_protect_flash_verify + 20
        0x2001700c:    f000f883    ....    BL       $Ven$TT$L$$advance_software_protect_flash_verify_check ; 0x20017116
        0x20017010:    b110        ..      CBZ      r0,0x20017018 ; advance_software_protect_flash_verify + 24
        0x20017012:    2001        .       MOVS     r0,#1
        0x20017014:    e8bd81f0    ....    POP      {r4-r8,pc}
        0x20017018:    4c3b        ;L      LDR      r4,[pc,#236] ; [0x20017108] = 0x200000f8
        0x2001701a:    68e5        .h      LDR      r5,[r4,#0xc]
        0x2001701c:    68a0        .h      LDR      r0,[r4,#8]
        0x2001701e:    2801        .(      CMP      r0,#1
        0x20017020:    d930        0.      BLS      0x20017084 ; advance_software_protect_flash_verify + 132
        0x20017022:    2100        .!      MOVS     r1,#0
        0x20017024:    e018        ..      B        0x20017058 ; advance_software_protect_flash_verify + 88
        0x20017026:    2000        .       MOVS     r0,#0
        0x20017028:    e010        ..      B        0x2001704c ; advance_software_protect_flash_verify + 76
        0x2001702a:    bf00        ..      NOP      
        0x2001702c:    eb0502c0    ....    ADD      r2,r5,r0,LSL #3
        0x20017030:    f8553030    U.00    LDR      r3,[r5,r0,LSL #3]
        0x20017034:    6896        .h      LDR      r6,[r2,#8]
        0x20017036:    42b3        .B      CMP      r3,r6
        0x20017038:    d907        ..      BLS      0x2001704a ; advance_software_protect_flash_verify + 74
        0x2001703a:    f8d2c004    ....    LDR      r12,[r2,#4]
        0x2001703e:    68d7        .h      LDR      r7,[r2,#0xc]
        0x20017040:    f8c2c00c    ....    STR      r12,[r2,#0xc]
        0x20017044:    6016        .`      STR      r6,[r2,#0]
        0x20017046:    e9c27301    ...s    STRD     r7,r3,[r2,#4]
        0x2001704a:    1c40        @.      ADDS     r0,r0,#1
        0x2001704c:    68a2        .h      LDR      r2,[r4,#8]
        0x2001704e:    1a52        R.      SUBS     r2,r2,r1
        0x20017050:    1e52        R.      SUBS     r2,r2,#1
        0x20017052:    4282        .B      CMP      r2,r0
        0x20017054:    d8ea        ..      BHI      0x2001702c ; advance_software_protect_flash_verify + 44
        0x20017056:    1c49        I.      ADDS     r1,r1,#1
        0x20017058:    68a0        .h      LDR      r0,[r4,#8]
        0x2001705a:    1e40        @.      SUBS     r0,r0,#1
        0x2001705c:    4288        .B      CMP      r0,r1
        0x2001705e:    d8e2        ..      BHI      0x20017026 ; advance_software_protect_flash_verify + 38
        0x20017060:    68e1        .h      LDR      r1,[r4,#0xc]
        0x20017062:    2000        .       MOVS     r0,#0
        0x20017064:    e00a        ..      B        0x2001707c ; advance_software_protect_flash_verify + 124
        0x20017066:    bf00        ..      NOP      
        0x20017068:    eb0102c0    ....    ADD      r2,r1,r0,LSL #3
        0x2001706c:    f8513030    Q.00    LDR      r3,[r1,r0,LSL #3]
        0x20017070:    6855        Uh      LDR      r5,[r2,#4]
        0x20017072:    6892        .h      LDR      r2,[r2,#8]
        0x20017074:    442b        +D      ADD      r3,r3,r5
        0x20017076:    4293        .B      CMP      r3,r2
        0x20017078:    d819        ..      BHI      0x200170ae ; advance_software_protect_flash_verify + 174
        0x2001707a:    1c40        @.      ADDS     r0,r0,#1
        0x2001707c:    68a2        .h      LDR      r2,[r4,#8]
        0x2001707e:    1e52        R.      SUBS     r2,r2,#1
        0x20017080:    4282        .B      CMP      r2,r0
        0x20017082:    d8f1        ..      BHI      0x20017068 ; advance_software_protect_flash_verify + 104
        0x20017084:    68e0        .h      LDR      r0,[r4,#0xc]
        0x20017086:    68a1        .h      LDR      r1,[r4,#8]
        0x20017088:    b199        ..      CBZ      r1,0x200170b2 ; advance_software_protect_flash_verify + 178
        0x2001708a:    6801        .h      LDR      r1,[r0,#0]
        0x2001708c:    6922        "i      LDR      r2,[r4,#0x10]
        0x2001708e:    4291        .B      CMP      r1,r2
        0x20017090:    d30d        ..      BCC      0x200170ae ; advance_software_protect_flash_verify + 174
        0x20017092:    68a1        .h      LDR      r1,[r4,#8]
        0x20017094:    68a2        .h      LDR      r2,[r4,#8]
        0x20017096:    eb0001c1    ....    ADD      r1,r0,r1,LSL #3
        0x2001709a:    f8511c08    Q...    LDR      r1,[r1,#-8]
        0x2001709e:    eb0000c2    ....    ADD      r0,r0,r2,LSL #3
        0x200170a2:    f8500c04    P...    LDR      r0,[r0,#-4]
        0x200170a6:    4408        .D      ADD      r0,r0,r1
        0x200170a8:    6961        ai      LDR      r1,[r4,#0x14]
        0x200170aa:    4288        .B      CMP      r0,r1
        0x200170ac:    d901        ..      BLS      0x200170b2 ; advance_software_protect_flash_verify + 178
        0x200170ae:    2000        .       MOVS     r0,#0
        0x200170b0:    e7b0        ..      B        0x20017014 ; advance_software_protect_flash_verify + 20
        0x200170b2:    68a0        .h      LDR      r0,[r4,#8]
        0x200170b4:    b1d0        ..      CBZ      r0,0x200170ec ; advance_software_protect_flash_verify + 236
        0x200170b6:    68e5        .h      LDR      r5,[r4,#0xc]
        0x200170b8:    6921        !i      LDR      r1,[r4,#0x10]
        0x200170ba:    6828        (h      LDR      r0,[r5,#0]
        0x200170bc:    1a41        A.      SUBS     r1,r0,r1
        0x200170be:    6920         i      LDR      r0,[r4,#0x10]
        0x200170c0:    f000f82e    ....    BL       $Ven$TT$L$$crc32 ; 0x20017120
        0x200170c4:    2600        .&      MOVS     r6,#0
        0x200170c6:    e005        ..      B        0x200170d4 ; advance_software_protect_flash_verify + 212
        0x200170c8:    68aa        .h      LDR      r2,[r5,#8]
        0x200170ca:    1a52        R.      SUBS     r2,r2,r1
        0x200170cc:    f000f82d    ..-.    BL       $Ven$TT$L$$crc32_continue ; 0x2001712a
        0x200170d0:    3508        .5      ADDS     r5,r5,#8
        0x200170d2:    1c76        v.      ADDS     r6,r6,#1
        0x200170d4:    68a1        .h      LDR      r1,[r4,#8]
        0x200170d6:    1e49        I.      SUBS     r1,r1,#1
        0x200170d8:    42b1        .B      CMP      r1,r6
        0x200170da:    e9d51200    ....    LDRD     r1,r2,[r5,#0]
        0x200170de:    4411        .D      ADD      r1,r1,r2
        0x200170e0:    d8f2        ..      BHI      0x200170c8 ; advance_software_protect_flash_verify + 200
        0x200170e2:    6962        bi      LDR      r2,[r4,#0x14]
        0x200170e4:    1a52        R.      SUBS     r2,r2,r1
        0x200170e6:    f000f820    .. .    BL       $Ven$TT$L$$crc32_continue ; 0x2001712a
        0x200170ea:    e005        ..      B        0x200170f8 ; advance_software_protect_flash_verify + 248
        0x200170ec:    6960        `i      LDR      r0,[r4,#0x14]
        0x200170ee:    6921        !i      LDR      r1,[r4,#0x10]
        0x200170f0:    1a41        A.      SUBS     r1,r0,r1
        0x200170f2:    6920         i      LDR      r0,[r4,#0x10]
        0x200170f4:    f000f814    ....    BL       $Ven$TT$L$$crc32 ; 0x20017120
        0x200170f8:    69a1        .i      LDR      r1,[r4,#0x18]
        0x200170fa:    4281        .B      CMP      r1,r0
        0x200170fc:    d101        ..      BNE      0x20017102 ; advance_software_protect_flash_verify + 258
        0x200170fe:    2003        .       MOVS     r0,#3
        0x20017100:    e788        ..      B        0x20017014 ; advance_software_protect_flash_verify + 20
        0x20017102:    2002        .       MOVS     r0,#2
        0x20017104:    e786        ..      B        0x20017014 ; advance_software_protect_flash_verify + 20
    $d
        0x20017106:    0000        ..      DCW    0
        0x20017108:    200000f8    ...     DCD    536871160
    $t
    $Ven$TT$L$$advance_software_protect_flash_verify_init
        0x2001710c:    f6411c21    A.!.    MOV      r12,#0x1921
        0x20017110:    f6c00c00    ....    MOVT     r12,#0x800
        0x20017114:    4760        `G      BX       r12
    $Ven$TT$L$$advance_software_protect_flash_verify_check
        0x20017116:    f6410cc9    A...    MOV      r12,#0x18c9
        0x2001711a:    f6c00c00    ....    MOVT     r12,#0x800
        0x2001711e:    4760        `G      BX       r12
    $Ven$TT$L$$crc32
        0x20017120:    f6415c41    A.A\    MOV      r12,#0x1d41
        0x20017124:    f6c00c00    ....    MOVT     r12,#0x800
        0x20017128:    4760        `G      BX       r12
    $Ven$TT$L$$crc32_continue
        0x2001712a:    f6415c91    A..\    MOV      r12,#0x1d91
        0x2001712e:    f6c00c00    ....    MOVT     r12,#0x800
        0x20017132:    4760        `G      BX       r12
    $Ven$TT$L$$encrypt_g
        0x20017134:    f6440c35    D.5.    MOV      r12,#0x4835
        0x20017138:    f6c00c00    ....    MOVT     r12,#0x800
        0x2001713c:    4760        `G      BX       r12
    $Ven$TT$L$$encrypt_g_inv
        0x2001713e:    f6440c8b    D...    MOV      r12,#0x488b
        0x20017142:    f6c00c00    ....    MOVT     r12,#0x800
        0x20017146:    4760        `G      BX       r12
    $Ven$TT$L$$HAL_CRC_Calculate
        0x20017148:    f6402cb7    @..,    MOV      r12,#0xab7
        0x2001714c:    f6c00c00    ....    MOVT     r12,#0x800
        0x20017150:    4760        `G      BX       r12
    $Ven$TT$L$$HAL_CRC_Accumulate
        0x20017152:    f6402c91    @..,    MOV      r12,#0xa91
        0x20017156:    f6c00c00    ....    MOVT     r12,#0x800
        0x2001715a:    4760        `G      BX       r12
    $Ven$TT$L$$HAL_FLASHEx_OBGetConfig
        0x2001715c:    f6403c85    @..<    MOV      r12,#0xb85
        0x20017160:    f6c00c00    ....    MOVT     r12,#0x800
        0x20017164:    4760        `G      BX       r12
    $Ven$TT$L$$HAL_FLASH_Unlock
        0x20017166:    f6404cc5    @..L    MOV      r12,#0xcc5
        0x2001716a:    f6c00c00    ....    MOVT     r12,#0x800
        0x2001716e:    4760        `G      BX       r12
    $Ven$TT$L$$HAL_FLASH_OB_Unlock
        0x20017170:    f6404ca1    @..L    MOV      r12,#0xca1
        0x20017174:    f6c00c00    ....    MOVT     r12,#0x800
        0x20017178:    4760        `G      BX       r12
    $Ven$TT$L$$HAL_FLASHEx_OBProgram
        0x2001717a:    f6403ca9    @..<    MOV      r12,#0xba9
        0x2001717e:    f6c00c00    ....    MOVT     r12,#0x800
        0x20017182:    4760        `G      BX       r12
    $Ven$TT$L$$HAL_FLASH_OB_Lock
        0x20017184:    f6404c8d    @..L    MOV      r12,#0xc8d
        0x20017188:    f6c00c00    ....    MOVT     r12,#0x800
        0x2001718c:    4760        `G      BX       r12
    $Ven$TT$L$$HAL_FLASH_Lock
        0x2001718e:    f6404c71    @.qL    MOV      r12,#0xc71
        0x20017192:    f6c00c00    ....    MOVT     r12,#0x800
        0x20017196:    4760        `G      BX       r12
    $Ven$TT$L$$sissdk_ecdsa_verify
        0x20017198:    f2474ced    G..L    MOV      r12,#0x74ed
        0x2001719c:    f6c00c00    ....    MOVT     r12,#0x800
        0x200171a0:    4760        `G      BX       r12
        0x200171a2:    0000        ..      MOVS     r0,r0
        0x200171a4:    0000        ..      MOVS     r0,r0
        0x200171a6:    0000        ..      MOVS     r0,r0
        0x200171a8:    0000        ..      MOVS     r0,r0
        0x200171aa:    0000        ..      MOVS     r0,r0
        0x200171ac:    0000        ..      MOVS     r0,r0
        0x200171ae:    0000        ..      MOVS     r0,r0
        0x200171b0:    0000        ..      MOVS     r0,r0
        0x200171b2:    0000        ..      MOVS     r0,r0
        0x200171b4:    0000        ..      MOVS     r0,r0
        0x200171b6:    0000        ..      MOVS     r0,r0
        0x200171b8:    0000        ..      MOVS     r0,r0
        0x200171ba:    0000        ..      MOVS     r0,r0
        0x200171bc:    0000        ..      MOVS     r0,r0
        0x200171be:    0000        ..      MOVS     r0,r0
        0x200171c0:    0000        ..      MOVS     r0,r0
        0x200171c2:    0000        ..      MOVS     r0,r0
        0x200171c4:    0000        ..      MOVS     r0,r0
        0x200171c6:    0000        ..      MOVS     r0,r0
        0x200171c8:    0000        ..      MOVS     r0,r0
        0x200171ca:    0000        ..      MOVS     r0,r0
        0x200171cc:    0000        ..      MOVS     r0,r0
        0x200171ce:    0000        ..      MOVS     r0,r0
        0x200171d0:    0000        ..      MOVS     r0,r0
        0x200171d2:    0000        ..      MOVS     r0,r0
        0x200171d4:    0000        ..      MOVS     r0,r0
        0x200171d6:    0000        ..      MOVS     r0,r0
        0x200171d8:    0000        ..      MOVS     r0,r0
        0x200171da:    0000        ..      MOVS     r0,r0
        0x200171dc:    0000        ..      MOVS     r0,r0
        0x200171de:    0000        ..      MOVS     r0,r0
        0x200171e0:    0000        ..      MOVS     r0,r0
        0x200171e2:    0000        ..      MOVS     r0,r0
        0x200171e4:    0000        ..      MOVS     r0,r0
        0x200171e6:    0000        ..      MOVS     r0,r0
        0x200171e8:    0000        ..      MOVS     r0,r0
        0x200171ea:    0000        ..      MOVS     r0,r0
        0x200171ec:    0000        ..      MOVS     r0,r0
        0x200171ee:    0000        ..      MOVS     r0,r0
        0x200171f0:    0000        ..      MOVS     r0,r0
        0x200171f2:    0000        ..      MOVS     r0,r0
        0x200171f4:    0000        ..      MOVS     r0,r0
        0x200171f6:    0000        ..      MOVS     r0,r0
        0x200171f8:    0000        ..      MOVS     r0,r0
        0x200171fa:    0000        ..      MOVS     r0,r0
        0x200171fc:    0000        ..      MOVS     r0,r0
        0x200171fe:    0000        ..      MOVS     r0,r0
    .ARM.__at_0x20017200
    advance_software_protect_anti_debugger
        0x20017200:    b570        p.      PUSH     {r4-r6,lr}
        0x20017202:    4b14        .K      LDR      r3,[pc,#80] ; [0x20017254] = 0x20000040
        0x20017204:    4604        .F      MOV      r4,r0
        0x20017206:    691a        .i      LDR      r2,[r3,#0x10]
        0x20017208:    695d        ]i      LDR      r5,[r3,#0x14]
        0x2001720a:    6818        .h      LDR      r0,[r3,#0]
        0x2001720c:    6859        Yh      LDR      r1,[r3,#4]
        0x2001720e:    689e        .h      LDR      r6,[r3,#8]
        0x20017210:    68db        .h      LDR      r3,[r3,#0xc]
        0x20017212:    4070        p@      EORS     r0,r0,r6
        0x20017214:    4059        Y@      EORS     r1,r1,r3
        0x20017216:    4042        B@      EORS     r2,r2,r0
        0x20017218:    404d        M@      EORS     r5,r5,r1
        0x2001721a:    432a        *C      ORRS     r2,r2,r5
        0x2001721c:    d00a        ..      BEQ      0x20017234 ; advance_software_protect_anti_debugger + 52
        0x2001721e:    f000fb6f    ..o.    BL       advance_software_protect_rdp_check ; 0x20017900
        0x20017222:    b160        `.      CBZ      r0,0x2001723e ; advance_software_protect_anti_debugger + 62
        0x20017224:    2002        .       MOVS     r0,#2
        0x20017226:    47a0        .G      BLX      r4
        0x20017228:    2004        .       MOVS     r0,#4
        0x2001722a:    47a0        .G      BLX      r4
        0x2001722c:    e8bd4070    ..p@    POP      {r4-r6,lr}
        0x20017230:    f000bae6    ....    B.W      advance_software_protect_debugger_disable ; 0x20017800
        0x20017234:    46a4        .F      MOV      r12,r4
        0x20017236:    e8bd4070    ..p@    POP      {r4-r6,lr}
        0x2001723a:    2000        .       MOVS     r0,#0
        0x2001723c:    4760        `G      BX       r12
        0x2001723e:    2001        .       MOVS     r0,#1
        0x20017240:    47a0        .G      BLX      r4
        0x20017242:    f000fbdd    ....    BL       advance_software_protect_rdp_enable ; 0x20017a00
        0x20017246:    2002        .       MOVS     r0,#2
        0x20017248:    47a0        .G      BLX      r4
        0x2001724a:    2003        .       MOVS     r0,#3
        0x2001724c:    47a0        .G      BLX      r4
        0x2001724e:    f000fa57    ..W.    BL       advance_software_protect_system_reset ; 0x20017700
        0x20017252:    e7e9        ..      B        0x20017228 ; advance_software_protect_anti_debugger + 40
    $d
        0x20017254:    20000040    @..     DCD    536870976
        0x20017258:    00000000    ....    DCD    0
        0x2001725c:    00000000    ....    DCD    0
        0x20017260:    00000000    ....    DCD    0
        0x20017264:    00000000    ....    DCD    0
        0x20017268:    00000000    ....    DCD    0
        0x2001726c:    00000000    ....    DCD    0
        0x20017270:    00000000    ....    DCD    0
        0x20017274:    00000000    ....    DCD    0
        0x20017278:    00000000    ....    DCD    0
        0x2001727c:    00000000    ....    DCD    0
        0x20017280:    00000000    ....    DCD    0
        0x20017284:    00000000    ....    DCD    0
        0x20017288:    00000000    ....    DCD    0
        0x2001728c:    00000000    ....    DCD    0
        0x20017290:    00000000    ....    DCD    0
        0x20017294:    00000000    ....    DCD    0
        0x20017298:    00000000    ....    DCD    0
        0x2001729c:    00000000    ....    DCD    0
        0x200172a0:    00000000    ....    DCD    0
        0x200172a4:    00000000    ....    DCD    0
        0x200172a8:    00000000    ....    DCD    0
        0x200172ac:    00000000    ....    DCD    0
        0x200172b0:    00000000    ....    DCD    0
        0x200172b4:    00000000    ....    DCD    0
        0x200172b8:    00000000    ....    DCD    0
        0x200172bc:    00000000    ....    DCD    0
        0x200172c0:    00000000    ....    DCD    0
        0x200172c4:    00000000    ....    DCD    0
        0x200172c8:    00000000    ....    DCD    0
        0x200172cc:    00000000    ....    DCD    0
        0x200172d0:    00000000    ....    DCD    0
        0x200172d4:    00000000    ....    DCD    0
        0x200172d8:    00000000    ....    DCD    0
        0x200172dc:    00000000    ....    DCD    0
        0x200172e0:    00000000    ....    DCD    0
        0x200172e4:    00000000    ....    DCD    0
        0x200172e8:    00000000    ....    DCD    0
        0x200172ec:    00000000    ....    DCD    0
        0x200172f0:    00000000    ....    DCD    0
        0x200172f4:    00000000    ....    DCD    0
        0x200172f8:    00000000    ....    DCD    0
        0x200172fc:    00000000    ....    DCD    0
    $t
    .ARM.__at_0x20017300
    advance_software_protect_encrypt_process
        0x20017300:    e92d5fff    -.._    PUSH     {r0-r12,lr}
        0x20017304:    468a        .F      MOV      r10,r1
        0x20017306:    f04f0900    O...    MOV      r9,#0
        0x2001730a:    e03e        >.      B        0x2001738a ; advance_software_protect_encrypt_process + 138
        0x2001730c:    9800        ..      LDR      r0,[sp,#0]
        0x2001730e:    4448        HD      ADD      r0,r0,r9
        0x20017310:    4683        .F      MOV      r11,r0
        0x20017312:    6804        .h      LDR      r4,[r0,#0]
        0x20017314:    6845        Eh      LDR      r5,[r0,#4]
        0x20017316:    980e        ..      LDR      r0,[sp,#0x38]
        0x20017318:    b1b0        ..      CBZ      r0,0x20017348 ; advance_software_protect_encrypt_process + 72
        0x2001731a:    2600        .&      MOVS     r6,#0
        0x2001731c:    4627        'F      MOV      r7,r4
        0x2001731e:    0c20         .      LSRS     r0,r4,#16
        0x20017320:    f360040f    `...    BFI      r4,r0,#0,#16
        0x20017324:    aa02        ..      ADD      r2,sp,#8
        0x20017326:    f365441f    e..D    BFI      r4,r5,#16,#16
        0x2001732a:    0c28        (.      LSRS     r0,r5,#16
        0x2001732c:    4631        1F      MOV      r1,r6
