openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x2001732e:    f7ffff01    ....    BL       $Ven$TT$L$$encrypt_g ; 0x20017134
        0x20017332:    1c76        v.      ADDS     r6,r6,#1
        0x20017334:    4077        w@      EORS     r7,r7,r6
        0x20017336:    f360050f    `...    BFI      r5,r0,#0,#16
        0x2001733a:    4078        x@      EORS     r0,r0,r7
        0x2001733c:    b2f6        ..      UXTB     r6,r6
        0x2001733e:    f360451f    `..E    BFI      r5,r0,#16,#16
        0x20017342:    2e20         .      CMP      r6,#0x20
        0x20017344:    d3ea        ..      BCC      0x2001731c ; advance_software_protect_encrypt_process + 28
        0x20017346:    e018        ..      B        0x2001737a ; advance_software_protect_encrypt_process + 122
        0x20017348:    261f        .&      MOVS     r6,#0x1f
        0x2001734a:    b2f7        ..      UXTB     r7,r6
        0x2001734c:    b2a8        ..      UXTH     r0,r5
        0x2001734e:    aa02        ..      ADD      r2,sp,#8
        0x20017350:    ea804815    ...H    EOR      r8,r0,r5,LSR #16
        0x20017354:    4639        9F      MOV      r1,r7
        0x20017356:    f7fffef2    ....    BL       $Ven$TT$L$$encrypt_g_inv ; 0x2001713e
        0x2001735a:    f360451f    `..E    BFI      r5,r0,#16,#16
        0x2001735e:    0c20         .      LSRS     r0,r4,#16
        0x20017360:    1c7f        ..      ADDS     r7,r7,#1
        0x20017362:    1e76        v.      SUBS     r6,r6,#1
        0x20017364:    f364441f    d..D    BFI      r4,r4,#16,#16
        0x20017368:    ea880107    ....    EOR      r1,r8,r7
        0x2001736c:    b276        v.      SXTB     r6,r6
        0x2001736e:    f360050f    `...    BFI      r5,r0,#0,#16
        0x20017372:    f361040f    a...    BFI      r4,r1,#0,#16
        0x20017376:    2e00        ..      CMP      r6,#0
        0x20017378:    dae7        ..      BGE      0x2001734a ; advance_software_protect_encrypt_process + 74
        0x2001737a:    f8cb4000    ...@    STR      r4,[r11,#0]
        0x2001737e:    f8cb5004    ...P    STR      r5,[r11,#4]
        0x20017382:    f1090908    ....    ADD      r9,r9,#8
        0x20017386:    f1aa0a08    ....    SUB      r10,r10,#8
        0x2001738a:    f1ba0f08    ....    CMP      r10,#8
        0x2001738e:    d2bd        ..      BCS      0x2001730c ; advance_software_protect_encrypt_process + 12
        0x20017390:    e8bd9fff    ....    POP      {r0-r12,pc}
        0x20017394:    0000        ..      MOVS     r0,r0
        0x20017396:    0000        ..      MOVS     r0,r0
        0x20017398:    0000        ..      MOVS     r0,r0
        0x2001739a:    0000        ..      MOVS     r0,r0
        0x2001739c:    0000        ..      MOVS     r0,r0
        0x2001739e:    0000        ..      MOVS     r0,r0
        0x200173a0:    0000        ..      MOVS     r0,r0
        0x200173a2:    0000        ..      MOVS     r0,r0
        0x200173a4:    0000        ..      MOVS     r0,r0
        0x200173a6:    0000        ..      MOVS     r0,r0
        0x200173a8:    0000        ..      MOVS     r0,r0
        0x200173aa:    0000        ..      MOVS     r0,r0
        0x200173ac:    0000        ..      MOVS     r0,r0
        0x200173ae:    0000        ..      MOVS     r0,r0
        0x200173b0:    0000        ..      MOVS     r0,r0
        0x200173b2:    0000        ..      MOVS     r0,r0
        0x200173b4:    0000        ..      MOVS     r0,r0
        0x200173b6:    0000        ..      MOVS     r0,r0
        0x200173b8:    0000        ..      MOVS     r0,r0
        0x200173ba:    0000        ..      MOVS     r0,r0
        0x200173bc:    0000        ..      MOVS     r0,r0
        0x200173be:    0000        ..      MOVS     r0,r0
        0x200173c0:    0000        ..      MOVS     r0,r0
        0x200173c2:    0000        ..      MOVS     r0,r0
        0x200173c4:    0000        ..      MOVS     r0,r0
        0x200173c6:    0000        ..      MOVS     r0,r0
        0x200173c8:    0000        ..      MOVS     r0,r0
        0x200173ca:    0000        ..      MOVS     r0,r0
        0x200173cc:    0000        ..      MOVS     r0,r0
        0x200173ce:    0000        ..      MOVS     r0,r0
        0x200173d0:    0000        ..      MOVS     r0,r0
        0x200173d2:    0000        ..      MOVS     r0,r0
        0x200173d4:    0000        ..      MOVS     r0,r0
        0x200173d6:    0000        ..      MOVS     r0,r0
        0x200173d8:    0000        ..      MOVS     r0,r0
        0x200173da:    0000        ..      MOVS     r0,r0
        0x200173dc:    0000        ..      MOVS     r0,r0
        0x200173de:    0000        ..      MOVS     r0,r0
        0x200173e0:    0000        ..      MOVS     r0,r0
        0x200173e2:    0000        ..      MOVS     r0,r0
        0x200173e4:    0000        ..      MOVS     r0,r0
        0x200173e6:    0000        ..      MOVS     r0,r0
        0x200173e8:    0000        ..      MOVS     r0,r0
        0x200173ea:    0000        ..      MOVS     r0,r0
        0x200173ec:    0000        ..      MOVS     r0,r0
        0x200173ee:    0000        ..      MOVS     r0,r0
        0x200173f0:    0000        ..      MOVS     r0,r0
        0x200173f2:    0000        ..      MOVS     r0,r0
        0x200173f4:    0000        ..      MOVS     r0,r0
        0x200173f6:    0000        ..      MOVS     r0,r0
        0x200173f8:    0000        ..      MOVS     r0,r0
        0x200173fa:    0000        ..      MOVS     r0,r0
        0x200173fc:    0000        ..      MOVS     r0,r0
        0x200173fe:    0000        ..      MOVS     r0,r0
        0x20017400:    0000        ..      MOVS     r0,r0
        0x20017402:    0000        ..      MOVS     r0,r0
        0x20017404:    0000        ..      MOVS     r0,r0
        0x20017406:    0000        ..      MOVS     r0,r0
        0x20017408:    0000        ..      MOVS     r0,r0
        0x2001740a:    0000        ..      MOVS     r0,r0
        0x2001740c:    0000        ..      MOVS     r0,r0
        0x2001740e:    0000        ..      MOVS     r0,r0
        0x20017410:    0000        ..      MOVS     r0,r0
        0x20017412:    0000        ..      MOVS     r0,r0
        0x20017414:    0000        ..      MOVS     r0,r0
        0x20017416:    0000        ..      MOVS     r0,r0
        0x20017418:    0000        ..      MOVS     r0,r0
        0x2001741a:    0000        ..      MOVS     r0,r0
        0x2001741c:    0000        ..      MOVS     r0,r0
        0x2001741e:    0000        ..      MOVS     r0,r0
        0x20017420:    0000        ..      MOVS     r0,r0
        0x20017422:    0000        ..      MOVS     r0,r0
        0x20017424:    0000        ..      MOVS     r0,r0
        0x20017426:    0000        ..      MOVS     r0,r0
        0x20017428:    0000        ..      MOVS     r0,r0
        0x2001742a:    0000        ..      MOVS     r0,r0
        0x2001742c:    0000        ..      MOVS     r0,r0
        0x2001742e:    0000        ..      MOVS     r0,r0
        0x20017430:    0000        ..      MOVS     r0,r0
        0x20017432:    0000        ..      MOVS     r0,r0
        0x20017434:    0000        ..      MOVS     r0,r0
        0x20017436:    0000        ..      MOVS     r0,r0
        0x20017438:    0000        ..      MOVS     r0,r0
        0x2001743a:    0000        ..      MOVS     r0,r0
        0x2001743c:    0000        ..      MOVS     r0,r0
        0x2001743e:    0000        ..      MOVS     r0,r0
        0x20017440:    0000        ..      MOVS     r0,r0
        0x20017442:    0000        ..      MOVS     r0,r0
        0x20017444:    0000        ..      MOVS     r0,r0
        0x20017446:    0000        ..      MOVS     r0,r0
        0x20017448:    0000        ..      MOVS     r0,r0
        0x2001744a:    0000        ..      MOVS     r0,r0
        0x2001744c:    0000        ..      MOVS     r0,r0
        0x2001744e:    0000        ..      MOVS     r0,r0
        0x20017450:    0000        ..      MOVS     r0,r0
        0x20017452:    0000        ..      MOVS     r0,r0
        0x20017454:    0000        ..      MOVS     r0,r0
        0x20017456:    0000        ..      MOVS     r0,r0
        0x20017458:    0000        ..      MOVS     r0,r0
        0x2001745a:    0000        ..      MOVS     r0,r0
        0x2001745c:    0000        ..      MOVS     r0,r0
        0x2001745e:    0000        ..      MOVS     r0,r0
        0x20017460:    0000        ..      MOVS     r0,r0
        0x20017462:    0000        ..      MOVS     r0,r0
        0x20017464:    0000        ..      MOVS     r0,r0
        0x20017466:    0000        ..      MOVS     r0,r0
        0x20017468:    0000        ..      MOVS     r0,r0
        0x2001746a:    0000        ..      MOVS     r0,r0
        0x2001746c:    0000        ..      MOVS     r0,r0
        0x2001746e:    0000        ..      MOVS     r0,r0
        0x20017470:    0000        ..      MOVS     r0,r0
        0x20017472:    0000        ..      MOVS     r0,r0
        0x20017474:    0000        ..      MOVS     r0,r0
        0x20017476:    0000        ..      MOVS     r0,r0
        0x20017478:    0000        ..      MOVS     r0,r0
        0x2001747a:    0000        ..      MOVS     r0,r0
        0x2001747c:    0000        ..      MOVS     r0,r0
        0x2001747e:    0000        ..      MOVS     r0,r0
        0x20017480:    0000        ..      MOVS     r0,r0
        0x20017482:    0000        ..      MOVS     r0,r0
        0x20017484:    0000        ..      MOVS     r0,r0
        0x20017486:    0000        ..      MOVS     r0,r0
        0x20017488:    0000        ..      MOVS     r0,r0
        0x2001748a:    0000        ..      MOVS     r0,r0
        0x2001748c:    0000        ..      MOVS     r0,r0
        0x2001748e:    0000        ..      MOVS     r0,r0
        0x20017490:    0000        ..      MOVS     r0,r0
        0x20017492:    0000        ..      MOVS     r0,r0
        0x20017494:    0000        ..      MOVS     r0,r0
        0x20017496:    0000        ..      MOVS     r0,r0
        0x20017498:    0000        ..      MOVS     r0,r0
        0x2001749a:    0000        ..      MOVS     r0,r0
        0x2001749c:    0000        ..      MOVS     r0,r0
        0x2001749e:    0000        ..      MOVS     r0,r0
        0x200174a0:    0000        ..      MOVS     r0,r0
        0x200174a2:    0000        ..      MOVS     r0,r0
        0x200174a4:    0000        ..      MOVS     r0,r0
        0x200174a6:    0000        ..      MOVS     r0,r0
        0x200174a8:    0000        ..      MOVS     r0,r0
        0x200174aa:    0000        ..      MOVS     r0,r0
        0x200174ac:    0000        ..      MOVS     r0,r0
        0x200174ae:    0000        ..      MOVS     r0,r0
        0x200174b0:    0000        ..      MOVS     r0,r0
        0x200174b2:    0000        ..      MOVS     r0,r0
        0x200174b4:    0000        ..      MOVS     r0,r0
        0x200174b6:    0000        ..      MOVS     r0,r0
        0x200174b8:    0000        ..      MOVS     r0,r0
        0x200174ba:    0000        ..      MOVS     r0,r0
        0x200174bc:    0000        ..      MOVS     r0,r0
        0x200174be:    0000        ..      MOVS     r0,r0
        0x200174c0:    0000        ..      MOVS     r0,r0
        0x200174c2:    0000        ..      MOVS     r0,r0
        0x200174c4:    0000        ..      MOVS     r0,r0
        0x200174c6:    0000        ..      MOVS     r0,r0
        0x200174c8:    0000        ..      MOVS     r0,r0
        0x200174ca:    0000        ..      MOVS     r0,r0
        0x200174cc:    0000        ..      MOVS     r0,r0
        0x200174ce:    0000        ..      MOVS     r0,r0
        0x200174d0:    0000        ..      MOVS     r0,r0
        0x200174d2:    0000        ..      MOVS     r0,r0
        0x200174d4:    0000        ..      MOVS     r0,r0
        0x200174d6:    0000        ..      MOVS     r0,r0
        0x200174d8:    0000        ..      MOVS     r0,r0
        0x200174da:    0000        ..      MOVS     r0,r0
        0x200174dc:    0000        ..      MOVS     r0,r0
        0x200174de:    0000        ..      MOVS     r0,r0
        0x200174e0:    0000        ..      MOVS     r0,r0
        0x200174e2:    0000        ..      MOVS     r0,r0
        0x200174e4:    0000        ..      MOVS     r0,r0
        0x200174e6:    0000        ..      MOVS     r0,r0
        0x200174e8:    0000        ..      MOVS     r0,r0
        0x200174ea:    0000        ..      MOVS     r0,r0
        0x200174ec:    0000        ..      MOVS     r0,r0
        0x200174ee:    0000        ..      MOVS     r0,r0
        0x200174f0:    0000        ..      MOVS     r0,r0
        0x200174f2:    0000        ..      MOVS     r0,r0
        0x200174f4:    0000        ..      MOVS     r0,r0
        0x200174f6:    0000        ..      MOVS     r0,r0
        0x200174f8:    0000        ..      MOVS     r0,r0
        0x200174fa:    0000        ..      MOVS     r0,r0
        0x200174fc:    0000        ..      MOVS     r0,r0
        0x200174fe:    0000        ..      MOVS     r0,r0
    .ARM.__at_0x20017500
    advance_software_protect_crc32
        0x20017500:    b5f8        ..      PUSH     {r3-r7,lr}
        0x20017502:    460d        .F      MOV      r5,r1
        0x20017504:    f0010403    ....    AND      r4,r1,#3
        0x20017508:    088a        ..      LSRS     r2,r1,#2
        0x2001750a:    4606        .F      MOV      r6,r0
        0x2001750c:    4601        .F      MOV      r1,r0
        0x2001750e:    480a        .H      LDR      r0,[pc,#40] ; [0x20017538] = 0x20000004
        0x20017510:    f7fffe1a    ....    BL       $Ven$TT$L$$HAL_CRC_Calculate ; 0x20017148
        0x20017514:    2c00        .,      CMP      r4,#0
        0x20017516:    d00d        ..      BEQ      0x20017534 ; advance_software_protect_crc32 + 52
        0x20017518:    1970        p.      ADDS     r0,r6,r5
        0x2001751a:    1b00        ..      SUBS     r0,r0,r4
        0x2001751c:    00e2        ..      LSLS     r2,r4,#3
        0x2001751e:    f04f31ff    O..1    MOV      r1,#0xffffffff
        0x20017522:    6800        .h      LDR      r0,[r0,#0]
        0x20017524:    4091        .@      LSLS     r1,r1,r2
        0x20017526:    4388        .C      BICS     r0,r0,r1
        0x20017528:    9000        ..      STR      r0,[sp,#0]
        0x2001752a:    2201        ."      MOVS     r2,#1
        0x2001752c:    4669        iF      MOV      r1,sp
        0x2001752e:    4802        .H      LDR      r0,[pc,#8] ; [0x20017538] = 0x20000004
        0x20017530:    f7fffe0f    ....    BL       $Ven$TT$L$$HAL_CRC_Accumulate ; 0x20017152
        0x20017534:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x20017536:    0000        ..      DCW    0
        0x20017538:    20000004    ...     DCD    536870916
        0x2001753c:    00000000    ....    DCD    0
        0x20017540:    00000000    ....    DCD    0
        0x20017544:    00000000    ....    DCD    0
        0x20017548:    00000000    ....    DCD    0
        0x2001754c:    00000000    ....    DCD    0
        0x20017550:    00000000    ....    DCD    0
        0x20017554:    00000000    ....    DCD    0
        0x20017558:    00000000    ....    DCD    0
        0x2001755c:    00000000    ....    DCD    0
        0x20017560:    00000000    ....    DCD    0
        0x20017564:    00000000    ....    DCD    0
        0x20017568:    00000000    ....    DCD    0
        0x2001756c:    00000000    ....    DCD    0
        0x20017570:    00000000    ....    DCD    0
        0x20017574:    00000000    ....    DCD    0
        0x20017578:    00000000    ....    DCD    0
        0x2001757c:    00000000    ....    DCD    0
        0x20017580:    00000000    ....    DCD    0
        0x20017584:    00000000    ....    DCD    0
        0x20017588:    00000000    ....    DCD    0
        0x2001758c:    00000000    ....    DCD    0
        0x20017590:    00000000    ....    DCD    0
        0x20017594:    00000000    ....    DCD    0
        0x20017598:    00000000    ....    DCD    0
        0x2001759c:    00000000    ....    DCD    0
        0x200175a0:    00000000    ....    DCD    0
        0x200175a4:    00000000    ....    DCD    0
        0x200175a8:    00000000    ....    DCD    0
        0x200175ac:    00000000    ....    DCD    0
        0x200175b0:    00000000    ....    DCD    0
        0x200175b4:    00000000    ....    DCD    0
        0x200175b8:    00000000    ....    DCD    0
        0x200175bc:    00000000    ....    DCD    0
        0x200175c0:    00000000    ....    DCD    0
        0x200175c4:    00000000    ....    DCD    0
        0x200175c8:    00000000    ....    DCD    0
        0x200175cc:    00000000    ....    DCD    0
        0x200175d0:    00000000    ....    DCD    0
        0x200175d4:    00000000    ....    DCD    0
        0x200175d8:    00000000    ....    DCD    0
        0x200175dc:    00000000    ....    DCD    0
        0x200175e0:    00000000    ....    DCD    0
        0x200175e4:    00000000    ....    DCD    0
        0x200175e8:    00000000    ....    DCD    0
        0x200175ec:    00000000    ....    DCD    0
        0x200175f0:    00000000    ....    DCD    0
        0x200175f4:    00000000    ....    DCD    0
        0x200175f8:    00000000    ....    DCD    0
        0x200175fc:    00000000    ....    DCD    0
    $t
    .ARM.__at_0x20017600
    advance_software_protect_get_cid
        0x20017600:    b510        ..      PUSH     {r4,lr}
        0x20017602:    2300        .#      MOVS     r3,#0
        0x20017604:    e004        ..      B        0x20017610 ; advance_software_protect_get_cid + 16
        0x20017606:    bf00        ..      NOP      
        0x20017608:    f8104b01    ...K    LDRB     r4,[r0],#1
        0x2001760c:    54d4        .T      STRB     r4,[r2,r3]
        0x2001760e:    1c5b        [.      ADDS     r3,r3,#1
        0x20017610:    428b        .B      CMP      r3,r1
        0x20017612:    dbf9        ..      BLT      0x20017608 ; advance_software_protect_get_cid + 8
        0x20017614:    bd10        ..      POP      {r4,pc}
        0x20017616:    0000        ..      MOVS     r0,r0
        0x20017618:    0000        ..      MOVS     r0,r0
        0x2001761a:    0000        ..      MOVS     r0,r0
        0x2001761c:    0000        ..      MOVS     r0,r0
        0x2001761e:    0000        ..      MOVS     r0,r0
        0x20017620:    0000        ..      MOVS     r0,r0
        0x20017622:    0000        ..      MOVS     r0,r0
        0x20017624:    0000        ..      MOVS     r0,r0
        0x20017626:    0000        ..      MOVS     r0,r0
        0x20017628:    0000        ..      MOVS     r0,r0
        0x2001762a:    0000        ..      MOVS     r0,r0
        0x2001762c:    0000        ..      MOVS     r0,r0
        0x2001762e:    0000        ..      MOVS     r0,r0
        0x20017630:    0000        ..      MOVS     r0,r0
        0x20017632:    0000        ..      MOVS     r0,r0
        0x20017634:    0000        ..      MOVS     r0,r0
        0x20017636:    0000        ..      MOVS     r0,r0
        0x20017638:    0000        ..      MOVS     r0,r0
        0x2001763a:    0000        ..      MOVS     r0,r0
        0x2001763c:    0000        ..      MOVS     r0,r0
        0x2001763e:    0000        ..      MOVS     r0,r0
        0x20017640:    0000        ..      MOVS     r0,r0
        0x20017642:    0000        ..      MOVS     r0,r0
        0x20017644:    0000        ..      MOVS     r0,r0
        0x20017646:    0000        ..      MOVS     r0,r0
        0x20017648:    0000        ..      MOVS     r0,r0
        0x2001764a:    0000        ..      MOVS     r0,r0
        0x2001764c:    0000        ..      MOVS     r0,r0
        0x2001764e:    0000        ..      MOVS     r0,r0
        0x20017650:    0000        ..      MOVS     r0,r0
        0x20017652:    0000        ..      MOVS     r0,r0
        0x20017654:    0000        ..      MOVS     r0,r0
        0x20017656:    0000        ..      MOVS     r0,r0
        0x20017658:    0000        ..      MOVS     r0,r0
        0x2001765a:    0000        ..      MOVS     r0,r0
        0x2001765c:    0000        ..      MOVS     r0,r0
        0x2001765e:    0000        ..      MOVS     r0,r0
        0x20017660:    0000        ..      MOVS     r0,r0
        0x20017662:    0000        ..      MOVS     r0,r0
        0x20017664:    0000        ..      MOVS     r0,r0
        0x20017666:    0000        ..      MOVS     r0,r0
        0x20017668:    0000        ..      MOVS     r0,r0
        0x2001766a:    0000        ..      MOVS     r0,r0
        0x2001766c:    0000        ..      MOVS     r0,r0
        0x2001766e:    0000        ..      MOVS     r0,r0
        0x20017670:    0000        ..      MOVS     r0,r0
        0x20017672:    0000        ..      MOVS     r0,r0
        0x20017674:    0000        ..      MOVS     r0,r0
        0x20017676:    0000        ..      MOVS     r0,r0
        0x20017678:    0000        ..      MOVS     r0,r0
        0x2001767a:    0000        ..      MOVS     r0,r0
        0x2001767c:    0000        ..      MOVS     r0,r0
        0x2001767e:    0000        ..      MOVS     r0,r0
        0x20017680:    0000        ..      MOVS     r0,r0
        0x20017682:    0000        ..      MOVS     r0,r0
        0x20017684:    0000        ..      MOVS     r0,r0
        0x20017686:    0000        ..      MOVS     r0,r0
        0x20017688:    0000        ..      MOVS     r0,r0
        0x2001768a:    0000        ..      MOVS     r0,r0
        0x2001768c:    0000        ..      MOVS     r0,r0
        0x2001768e:    0000        ..      MOVS     r0,r0
        0x20017690:    0000        ..      MOVS     r0,r0
        0x20017692:    0000        ..      MOVS     r0,r0
        0x20017694:    0000        ..      MOVS     r0,r0
        0x20017696:    0000        ..      MOVS     r0,r0
        0x20017698:    0000        ..      MOVS     r0,r0
        0x2001769a:    0000        ..      MOVS     r0,r0
        0x2001769c:    0000        ..      MOVS     r0,r0
        0x2001769e:    0000        ..      MOVS     r0,r0
        0x200176a0:    0000        ..      MOVS     r0,r0
        0x200176a2:    0000        ..      MOVS     r0,r0
        0x200176a4:    0000        ..      MOVS     r0,r0
        0x200176a6:    0000        ..      MOVS     r0,r0
        0x200176a8:    0000        ..      MOVS     r0,r0
        0x200176aa:    0000        ..      MOVS     r0,r0
        0x200176ac:    0000        ..      MOVS     r0,r0
        0x200176ae:    0000        ..      MOVS     r0,r0
        0x200176b0:    0000        ..      MOVS     r0,r0
        0x200176b2:    0000        ..      MOVS     r0,r0
        0x200176b4:    0000        ..      MOVS     r0,r0
        0x200176b6:    0000        ..      MOVS     r0,r0
        0x200176b8:    0000        ..      MOVS     r0,r0
        0x200176ba:    0000        ..      MOVS     r0,r0
        0x200176bc:    0000        ..      MOVS     r0,r0
        0x200176be:    0000        ..      MOVS     r0,r0
        0x200176c0:    0000        ..      MOVS     r0,r0
        0x200176c2:    0000        ..      MOVS     r0,r0
        0x200176c4:    0000        ..      MOVS     r0,r0
        0x200176c6:    0000        ..      MOVS     r0,r0
        0x200176c8:    0000        ..      MOVS     r0,r0
        0x200176ca:    0000        ..      MOVS     r0,r0
        0x200176cc:    0000        ..      MOVS     r0,r0
        0x200176ce:    0000        ..      MOVS     r0,r0
        0x200176d0:    0000        ..      MOVS     r0,r0
        0x200176d2:    0000        ..      MOVS     r0,r0
        0x200176d4:    0000        ..      MOVS     r0,r0
