openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x200176d6:    0000        ..      MOVS     r0,r0
        0x200176d8:    0000        ..      MOVS     r0,r0
        0x200176da:    0000        ..      MOVS     r0,r0
        0x200176dc:    0000        ..      MOVS     r0,r0
        0x200176de:    0000        ..      MOVS     r0,r0
        0x200176e0:    0000        ..      MOVS     r0,r0
        0x200176e2:    0000        ..      MOVS     r0,r0
        0x200176e4:    0000        ..      MOVS     r0,r0
        0x200176e6:    0000        ..      MOVS     r0,r0
        0x200176e8:    0000        ..      MOVS     r0,r0
        0x200176ea:    0000        ..      MOVS     r0,r0
        0x200176ec:    0000        ..      MOVS     r0,r0
        0x200176ee:    0000        ..      MOVS     r0,r0
        0x200176f0:    0000        ..      MOVS     r0,r0
        0x200176f2:    0000        ..      MOVS     r0,r0
        0x200176f4:    0000        ..      MOVS     r0,r0
        0x200176f6:    0000        ..      MOVS     r0,r0
        0x200176f8:    0000        ..      MOVS     r0,r0
        0x200176fa:    0000        ..      MOVS     r0,r0
        0x200176fc:    0000        ..      MOVS     r0,r0
        0x200176fe:    0000        ..      MOVS     r0,r0
    .ARM.__at_0x20017700
    advance_software_protect_system_reset
        0x20017700:    f3bf8f4f    ..O.    DSB      
        0x20017704:    4805        .H      LDR      r0,[pc,#20] ; [0x2001771c] = 0xe000ed0c
        0x20017706:    6801        .h      LDR      r1,[r0,#0]
        0x20017708:    4a05        .J      LDR      r2,[pc,#20] ; [0x20017720] = 0x5fa0004
        0x2001770a:    f40161e0    ...a    AND      r1,r1,#0x700
        0x2001770e:    4311        .C      ORRS     r1,r1,r2
        0x20017710:    6001        .`      STR      r1,[r0,#0]
        0x20017712:    f3bf8f4f    ..O.    DSB      
        0x20017716:    bf00        ..      NOP      
        0x20017718:    e7fd        ..      B        0x20017716 ; advance_software_protect_system_reset + 22
    $d
        0x2001771a:    0000        ..      DCW    0
        0x2001771c:    e000ed0c    ....    DCD    3758157068
        0x20017720:    05fa0004    ....    DCD    100270084
        0x20017724:    00000000    ....    DCD    0
        0x20017728:    00000000    ....    DCD    0
        0x2001772c:    00000000    ....    DCD    0
        0x20017730:    00000000    ....    DCD    0
        0x20017734:    00000000    ....    DCD    0
        0x20017738:    00000000    ....    DCD    0
        0x2001773c:    00000000    ....    DCD    0
        0x20017740:    00000000    ....    DCD    0
        0x20017744:    00000000    ....    DCD    0
        0x20017748:    00000000    ....    DCD    0
        0x2001774c:    00000000    ....    DCD    0
        0x20017750:    00000000    ....    DCD    0
        0x20017754:    00000000    ....    DCD    0
        0x20017758:    00000000    ....    DCD    0
        0x2001775c:    00000000    ....    DCD    0
        0x20017760:    00000000    ....    DCD    0
        0x20017764:    00000000    ....    DCD    0
        0x20017768:    00000000    ....    DCD    0
        0x2001776c:    00000000    ....    DCD    0
        0x20017770:    00000000    ....    DCD    0
        0x20017774:    00000000    ....    DCD    0
        0x20017778:    00000000    ....    DCD    0
        0x2001777c:    00000000    ....    DCD    0
        0x20017780:    00000000    ....    DCD    0
        0x20017784:    00000000    ....    DCD    0
        0x20017788:    00000000    ....    DCD    0
        0x2001778c:    00000000    ....    DCD    0
        0x20017790:    00000000    ....    DCD    0
        0x20017794:    00000000    ....    DCD    0
        0x20017798:    00000000    ....    DCD    0
        0x2001779c:    00000000    ....    DCD    0
        0x200177a0:    00000000    ....    DCD    0
        0x200177a4:    00000000    ....    DCD    0
        0x200177a8:    00000000    ....    DCD    0
        0x200177ac:    00000000    ....    DCD    0
        0x200177b0:    00000000    ....    DCD    0
        0x200177b4:    00000000    ....    DCD    0
        0x200177b8:    00000000    ....    DCD    0
        0x200177bc:    00000000    ....    DCD    0
        0x200177c0:    00000000    ....    DCD    0
        0x200177c4:    00000000    ....    DCD    0
        0x200177c8:    00000000    ....    DCD    0
        0x200177cc:    00000000    ....    DCD    0
        0x200177d0:    00000000    ....    DCD    0
        0x200177d4:    00000000    ....    DCD    0
        0x200177d8:    00000000    ....    DCD    0
        0x200177dc:    00000000    ....    DCD    0
        0x200177e0:    00000000    ....    DCD    0
        0x200177e4:    00000000    ....    DCD    0
        0x200177e8:    00000000    ....    DCD    0
        0x200177ec:    00000000    ....    DCD    0
        0x200177f0:    00000000    ....    DCD    0
        0x200177f4:    00000000    ....    DCD    0
        0x200177f8:    00000000    ....    DCD    0
        0x200177fc:    00000000    ....    DCD    0
    $t
    .ARM.__at_0x20017800
    advance_software_protect_debugger_disable
        0x20017800:    4803        .H      LDR      r0,[pc,#12] ; [0x20017810] = 0x40010000
        0x20017802:    6841        Ah      LDR      r1,[r0,#4]
        0x20017804:    f02161e0    !..a    BIC      r1,r1,#0x7000000
        0x20017808:    f0416180    A..a    ORR      r1,r1,#0x4000000
        0x2001780c:    6041        A`      STR      r1,[r0,#4]
        0x2001780e:    4770        pG      BX       lr
    $d
        0x20017810:    40010000    ...@    DCD    1073807360
        0x20017814:    00000000    ....    DCD    0
        0x20017818:    00000000    ....    DCD    0
        0x2001781c:    00000000    ....    DCD    0
        0x20017820:    00000000    ....    DCD    0
        0x20017824:    00000000    ....    DCD    0
        0x20017828:    00000000    ....    DCD    0
        0x2001782c:    00000000    ....    DCD    0
        0x20017830:    00000000    ....    DCD    0
        0x20017834:    00000000    ....    DCD    0
        0x20017838:    00000000    ....    DCD    0
        0x2001783c:    00000000    ....    DCD    0
        0x20017840:    00000000    ....    DCD    0
        0x20017844:    00000000    ....    DCD    0
        0x20017848:    00000000    ....    DCD    0
        0x2001784c:    00000000    ....    DCD    0
        0x20017850:    00000000    ....    DCD    0
        0x20017854:    00000000    ....    DCD    0
        0x20017858:    00000000    ....    DCD    0
        0x2001785c:    00000000    ....    DCD    0
        0x20017860:    00000000    ....    DCD    0
        0x20017864:    00000000    ....    DCD    0
        0x20017868:    00000000    ....    DCD    0
        0x2001786c:    00000000    ....    DCD    0
        0x20017870:    00000000    ....    DCD    0
        0x20017874:    00000000    ....    DCD    0
        0x20017878:    00000000    ....    DCD    0
        0x2001787c:    00000000    ....    DCD    0
        0x20017880:    00000000    ....    DCD    0
        0x20017884:    00000000    ....    DCD    0
        0x20017888:    00000000    ....    DCD    0
        0x2001788c:    00000000    ....    DCD    0
        0x20017890:    00000000    ....    DCD    0
        0x20017894:    00000000    ....    DCD    0
        0x20017898:    00000000    ....    DCD    0
        0x2001789c:    00000000    ....    DCD    0
        0x200178a0:    00000000    ....    DCD    0
        0x200178a4:    00000000    ....    DCD    0
        0x200178a8:    00000000    ....    DCD    0
        0x200178ac:    00000000    ....    DCD    0
        0x200178b0:    00000000    ....    DCD    0
        0x200178b4:    00000000    ....    DCD    0
        0x200178b8:    00000000    ....    DCD    0
        0x200178bc:    00000000    ....    DCD    0
        0x200178c0:    00000000    ....    DCD    0
        0x200178c4:    00000000    ....    DCD    0
        0x200178c8:    00000000    ....    DCD    0
        0x200178cc:    00000000    ....    DCD    0
        0x200178d0:    00000000    ....    DCD    0
        0x200178d4:    00000000    ....    DCD    0
        0x200178d8:    00000000    ....    DCD    0
        0x200178dc:    00000000    ....    DCD    0
        0x200178e0:    00000000    ....    DCD    0
        0x200178e4:    00000000    ....    DCD    0
        0x200178e8:    00000000    ....    DCD    0
        0x200178ec:    00000000    ....    DCD    0
        0x200178f0:    00000000    ....    DCD    0
        0x200178f4:    00000000    ....    DCD    0
        0x200178f8:    00000000    ....    DCD    0
        0x200178fc:    00000000    ....    DCD    0
    $t
    .ARM.__at_0x20017900
    advance_software_protect_rdp_check
        0x20017900:    b500        ..      PUSH     {lr}
        0x20017902:    b087        ..      SUB      sp,sp,#0x1c
        0x20017904:    4668        hF      MOV      r0,sp
        0x20017906:    f7fffc29    ..).    BL       $Ven$TT$L$$HAL_FLASHEx_OBGetConfig ; 0x2001715c
        0x2001790a:    f89d0010    ....    LDRB     r0,[sp,#0x10]
        0x2001790e:    28a5        .(      CMP      r0,#0xa5
        0x20017910:    d002        ..      BEQ      0x20017918 ; advance_software_protect_rdp_check + 24
        0x20017912:    2001        .       MOVS     r0,#1
        0x20017914:    b007        ..      ADD      sp,sp,#0x1c
        0x20017916:    bd00        ..      POP      {pc}
        0x20017918:    2000        .       MOVS     r0,#0
        0x2001791a:    e7fb        ..      B        0x20017914 ; advance_software_protect_rdp_check + 20
        0x2001791c:    0000        ..      MOVS     r0,r0
        0x2001791e:    0000        ..      MOVS     r0,r0
        0x20017920:    0000        ..      MOVS     r0,r0
        0x20017922:    0000        ..      MOVS     r0,r0
        0x20017924:    0000        ..      MOVS     r0,r0
        0x20017926:    0000        ..      MOVS     r0,r0
        0x20017928:    0000        ..      MOVS     r0,r0
        0x2001792a:    0000        ..      MOVS     r0,r0
        0x2001792c:    0000        ..      MOVS     r0,r0
        0x2001792e:    0000        ..      MOVS     r0,r0
        0x20017930:    0000        ..      MOVS     r0,r0
        0x20017932:    0000        ..      MOVS     r0,r0
        0x20017934:    0000        ..      MOVS     r0,r0
        0x20017936:    0000        ..      MOVS     r0,r0
        0x20017938:    0000        ..      MOVS     r0,r0
        0x2001793a:    0000        ..      MOVS     r0,r0
        0x2001793c:    0000        ..      MOVS     r0,r0
        0x2001793e:    0000        ..      MOVS     r0,r0
        0x20017940:    0000        ..      MOVS     r0,r0
        0x20017942:    0000        ..      MOVS     r0,r0
        0x20017944:    0000        ..      MOVS     r0,r0
        0x20017946:    0000        ..      MOVS     r0,r0
        0x20017948:    0000        ..      MOVS     r0,r0
        0x2001794a:    0000        ..      MOVS     r0,r0
        0x2001794c:    0000        ..      MOVS     r0,r0
        0x2001794e:    0000        ..      MOVS     r0,r0
        0x20017950:    0000        ..      MOVS     r0,r0
        0x20017952:    0000        ..      MOVS     r0,r0
        0x20017954:    0000        ..      MOVS     r0,r0
        0x20017956:    0000        ..      MOVS     r0,r0
        0x20017958:    0000        ..      MOVS     r0,r0
        0x2001795a:    0000        ..      MOVS     r0,r0
        0x2001795c:    0000        ..      MOVS     r0,r0
        0x2001795e:    0000        ..      MOVS     r0,r0
        0x20017960:    0000        ..      MOVS     r0,r0
        0x20017962:    0000        ..      MOVS     r0,r0
        0x20017964:    0000        ..      MOVS     r0,r0
        0x20017966:    0000        ..      MOVS     r0,r0
        0x20017968:    0000        ..      MOVS     r0,r0
        0x2001796a:    0000        ..      MOVS     r0,r0
        0x2001796c:    0000        ..      MOVS     r0,r0
        0x2001796e:    0000        ..      MOVS     r0,r0
        0x20017970:    0000        ..      MOVS     r0,r0
        0x20017972:    0000        ..      MOVS     r0,r0
        0x20017974:    0000        ..      MOVS     r0,r0
        0x20017976:    0000        ..      MOVS     r0,r0
        0x20017978:    0000        ..      MOVS     r0,r0
        0x2001797a:    0000        ..      MOVS     r0,r0
        0x2001797c:    0000        ..      MOVS     r0,r0
        0x2001797e:    0000        ..      MOVS     r0,r0
        0x20017980:    0000        ..      MOVS     r0,r0
        0x20017982:    0000        ..      MOVS     r0,r0
        0x20017984:    0000        ..      MOVS     r0,r0
        0x20017986:    0000        ..      MOVS     r0,r0
        0x20017988:    0000        ..      MOVS     r0,r0
        0x2001798a:    0000        ..      MOVS     r0,r0
        0x2001798c:    0000        ..      MOVS     r0,r0
        0x2001798e:    0000        ..      MOVS     r0,r0
        0x20017990:    0000        ..      MOVS     r0,r0
        0x20017992:    0000        ..      MOVS     r0,r0
        0x20017994:    0000        ..      MOVS     r0,r0
        0x20017996:    0000        ..      MOVS     r0,r0
        0x20017998:    0000        ..      MOVS     r0,r0
        0x2001799a:    0000        ..      MOVS     r0,r0
        0x2001799c:    0000        ..      MOVS     r0,r0
        0x2001799e:    0000        ..      MOVS     r0,r0
        0x200179a0:    0000        ..      MOVS     r0,r0
        0x200179a2:    0000        ..      MOVS     r0,r0
        0x200179a4:    0000        ..      MOVS     r0,r0
        0x200179a6:    0000        ..      MOVS     r0,r0
        0x200179a8:    0000        ..      MOVS     r0,r0
        0x200179aa:    0000        ..      MOVS     r0,r0
        0x200179ac:    0000        ..      MOVS     r0,r0
        0x200179ae:    0000        ..      MOVS     r0,r0
        0x200179b0:    0000        ..      MOVS     r0,r0
        0x200179b2:    0000        ..      MOVS     r0,r0
        0x200179b4:    0000        ..      MOVS     r0,r0
        0x200179b6:    0000        ..      MOVS     r0,r0
        0x200179b8:    0000        ..      MOVS     r0,r0
        0x200179ba:    0000        ..      MOVS     r0,r0
        0x200179bc:    0000        ..      MOVS     r0,r0
        0x200179be:    0000        ..      MOVS     r0,r0
        0x200179c0:    0000        ..      MOVS     r0,r0
        0x200179c2:    0000        ..      MOVS     r0,r0
        0x200179c4:    0000        ..      MOVS     r0,r0
        0x200179c6:    0000        ..      MOVS     r0,r0
        0x200179c8:    0000        ..      MOVS     r0,r0
        0x200179ca:    0000        ..      MOVS     r0,r0
        0x200179cc:    0000        ..      MOVS     r0,r0
        0x200179ce:    0000        ..      MOVS     r0,r0
        0x200179d0:    0000        ..      MOVS     r0,r0
        0x200179d2:    0000        ..      MOVS     r0,r0
        0x200179d4:    0000        ..      MOVS     r0,r0
        0x200179d6:    0000        ..      MOVS     r0,r0
        0x200179d8:    0000        ..      MOVS     r0,r0
        0x200179da:    0000        ..      MOVS     r0,r0
        0x200179dc:    0000        ..      MOVS     r0,r0
        0x200179de:    0000        ..      MOVS     r0,r0
        0x200179e0:    0000        ..      MOVS     r0,r0
        0x200179e2:    0000        ..      MOVS     r0,r0
        0x200179e4:    0000        ..      MOVS     r0,r0
        0x200179e6:    0000        ..      MOVS     r0,r0
        0x200179e8:    0000        ..      MOVS     r0,r0
        0x200179ea:    0000        ..      MOVS     r0,r0
        0x200179ec:    0000        ..      MOVS     r0,r0
        0x200179ee:    0000        ..      MOVS     r0,r0
        0x200179f0:    0000        ..      MOVS     r0,r0
        0x200179f2:    0000        ..      MOVS     r0,r0
        0x200179f4:    0000        ..      MOVS     r0,r0
        0x200179f6:    0000        ..      MOVS     r0,r0
        0x200179f8:    0000        ..      MOVS     r0,r0
        0x200179fa:    0000        ..      MOVS     r0,r0
        0x200179fc:    0000        ..      MOVS     r0,r0
        0x200179fe:    0000        ..      MOVS     r0,r0
    .ARM.__at_0x20017A00
    advance_software_protect_rdp_enable
        0x20017a00:    b500        ..      PUSH     {lr}
        0x20017a02:    b087        ..      SUB      sp,sp,#0x1c
        0x20017a04:    4668        hF      MOV      r0,sp
        0x20017a06:    f7fffba9    ....    BL       $Ven$TT$L$$HAL_FLASHEx_OBGetConfig ; 0x2001715c
        0x20017a0a:    f7fffbac    ....    BL       $Ven$TT$L$$HAL_FLASH_Unlock ; 0x20017166
        0x20017a0e:    2800        .(      CMP      r0,#0
        0x20017a10:    d10c        ..      BNE      0x20017a2c ; advance_software_protect_rdp_enable + 44
        0x20017a12:    f7fffbad    ....    BL       $Ven$TT$L$$HAL_FLASH_OB_Unlock ; 0x20017170
        0x20017a16:    2800        .(      CMP      r0,#0
        0x20017a18:    d108        ..      BNE      0x20017a2c ; advance_software_protect_rdp_enable + 44
        0x20017a1a:    f88d0010    ....    STRB     r0,[sp,#0x10]
        0x20017a1e:    4668        hF      MOV      r0,sp
        0x20017a20:    f7fffbab    ....    BL       $Ven$TT$L$$HAL_FLASHEx_OBProgram ; 0x2001717a
        0x20017a24:    f7fffbae    ....    BL       $Ven$TT$L$$HAL_FLASH_OB_Lock ; 0x20017184
        0x20017a28:    f7fffbb1    ....    BL       $Ven$TT$L$$HAL_FLASH_Lock ; 0x2001718e
        0x20017a2c:    b007        ..      ADD      sp,sp,#0x1c
        0x20017a2e:    bd00        ..      POP      {pc}
        0x20017a30:    0000        ..      MOVS     r0,r0
        0x20017a32:    0000        ..      MOVS     r0,r0
        0x20017a34:    0000        ..      MOVS     r0,r0
        0x20017a36:    0000        ..      MOVS     r0,r0
        0x20017a38:    0000        ..      MOVS     r0,r0
        0x20017a3a:    0000        ..      MOVS     r0,r0
        0x20017a3c:    0000        ..      MOVS     r0,r0
        0x20017a3e:    0000        ..      MOVS     r0,r0
        0x20017a40:    0000        ..      MOVS     r0,r0
        0x20017a42:    0000        ..      MOVS     r0,r0
        0x20017a44:    0000        ..      MOVS     r0,r0
        0x20017a46:    0000        ..      MOVS     r0,r0
        0x20017a48:    0000        ..      MOVS     r0,r0
        0x20017a4a:    0000        ..      MOVS     r0,r0
        0x20017a4c:    0000        ..      MOVS     r0,r0
        0x20017a4e:    0000        ..      MOVS     r0,r0
        0x20017a50:    0000        ..      MOVS     r0,r0
        0x20017a52:    0000        ..      MOVS     r0,r0
        0x20017a54:    0000        ..      MOVS     r0,r0
        0x20017a56:    0000        ..      MOVS     r0,r0
        0x20017a58:    0000        ..      MOVS     r0,r0
        0x20017a5a:    0000        ..      MOVS     r0,r0
        0x20017a5c:    0000        ..      MOVS     r0,r0
        0x20017a5e:    0000        ..      MOVS     r0,r0
        0x20017a60:    0000        ..      MOVS     r0,r0
        0x20017a62:    0000        ..      MOVS     r0,r0
        0x20017a64:    0000        ..      MOVS     r0,r0
        0x20017a66:    0000        ..      MOVS     r0,r0
        0x20017a68:    0000        ..      MOVS     r0,r0
        0x20017a6a:    0000        ..      MOVS     r0,r0
        0x20017a6c:    0000        ..      MOVS     r0,r0
        0x20017a6e:    0000        ..      MOVS     r0,r0
        0x20017a70:    0000        ..      MOVS     r0,r0
        0x20017a72:    0000        ..      MOVS     r0,r0
        0x20017a74:    0000        ..      MOVS     r0,r0
        0x20017a76:    0000        ..      MOVS     r0,r0
        0x20017a78:    0000        ..      MOVS     r0,r0
        0x20017a7a:    0000        ..      MOVS     r0,r0
        0x20017a7c:    0000        ..      MOVS     r0,r0
        0x20017a7e:    0000        ..      MOVS     r0,r0
        0x20017a80:    0000        ..      MOVS     r0,r0
        0x20017a82:    0000        ..      MOVS     r0,r0
        0x20017a84:    0000        ..      MOVS     r0,r0
        0x20017a86:    0000        ..      MOVS     r0,r0
        0x20017a88:    0000        ..      MOVS     r0,r0
        0x20017a8a:    0000        ..      MOVS     r0,r0
        0x20017a8c:    0000        ..      MOVS     r0,r0
        0x20017a8e:    0000        ..      MOVS     r0,r0
        0x20017a90:    0000        ..      MOVS     r0,r0
        0x20017a92:    0000        ..      MOVS     r0,r0
        0x20017a94:    0000        ..      MOVS     r0,r0
        0x20017a96:    0000        ..      MOVS     r0,r0
        0x20017a98:    0000        ..      MOVS     r0,r0
        0x20017a9a:    0000        ..      MOVS     r0,r0
        0x20017a9c:    0000        ..      MOVS     r0,r0
        0x20017a9e:    0000        ..      MOVS     r0,r0
        0x20017aa0:    0000        ..      MOVS     r0,r0
        0x20017aa2:    0000        ..      MOVS     r0,r0
        0x20017aa4:    0000        ..      MOVS     r0,r0
        0x20017aa6:    0000        ..      MOVS     r0,r0
        0x20017aa8:    0000        ..      MOVS     r0,r0
        0x20017aaa:    0000        ..      MOVS     r0,r0
        0x20017aac:    0000        ..      MOVS     r0,r0
        0x20017aae:    0000        ..      MOVS     r0,r0
        0x20017ab0:    0000        ..      MOVS     r0,r0
        0x20017ab2:    0000        ..      MOVS     r0,r0
        0x20017ab4:    0000        ..      MOVS     r0,r0
        0x20017ab6:    0000        ..      MOVS     r0,r0
        0x20017ab8:    0000        ..      MOVS     r0,r0
        0x20017aba:    0000        ..      MOVS     r0,r0
        0x20017abc:    0000        ..      MOVS     r0,r0
        0x20017abe:    0000        ..      MOVS     r0,r0
        0x20017ac0:    0000        ..      MOVS     r0,r0
        0x20017ac2:    0000        ..      MOVS     r0,r0
        0x20017ac4:    0000        ..      MOVS     r0,r0
        0x20017ac6:    0000        ..      MOVS     r0,r0
        0x20017ac8:    0000        ..      MOVS     r0,r0
        0x20017aca:    0000        ..      MOVS     r0,r0
        0x20017acc:    0000        ..      MOVS     r0,r0
        0x20017ace:    0000        ..      MOVS     r0,r0
        0x20017ad0:    0000        ..      MOVS     r0,r0
        0x20017ad2:    0000        ..      MOVS     r0,r0
        0x20017ad4:    0000        ..      MOVS     r0,r0
        0x20017ad6:    0000        ..      MOVS     r0,r0
        0x20017ad8:    0000        ..      MOVS     r0,r0
        0x20017ada:    0000        ..      MOVS     r0,r0
        0x20017adc:    0000        ..      MOVS     r0,r0
        0x20017ade:    0000        ..      MOVS     r0,r0
        0x20017ae0:    0000        ..      MOVS     r0,r0
        0x20017ae2:    0000        ..      MOVS     r0,r0
        0x20017ae4:    0000        ..      MOVS     r0,r0
        0x20017ae6:    0000        ..      MOVS     r0,r0
        0x20017ae8:    0000        ..      MOVS     r0,r0
        0x20017aea:    0000        ..      MOVS     r0,r0
        0x20017aec:    0000        ..      MOVS     r0,r0
        0x20017aee:    0000        ..      MOVS     r0,r0
        0x20017af0:    0000        ..      MOVS     r0,r0
        0x20017af2:    0000        ..      MOVS     r0,r0
        0x20017af4:    0000        ..      MOVS     r0,r0
        0x20017af6:    0000        ..      MOVS     r0,r0
        0x20017af8:    0000        ..      MOVS     r0,r0
        0x20017afa:    0000        ..      MOVS     r0,r0
        0x20017afc:    0000        ..      MOVS     r0,r0
