openpowerwriter/PowerWriter_AT_Command/samples/standard_project_mdk/stm32f103rfc6/MDK-ARM/stm32f103rfc6.S
        0x20017afe:    0000        ..      MOVS     r0,r0
    .ARM.__at_0x20017B00
    advance_software_protect_verify_authorization
        0x20017b00:    b570        p.      PUSH     {r4-r6,lr}
        0x20017b02:    4c0a        .L      LDR      r4,[pc,#40] ; [0x20017b2c] = 0x20000064
        0x20017b04:    6860        `h      LDR      r0,[r4,#4]
        0x20017b06:    4d0a        .M      LDR      r5,[pc,#40] ; [0x20017b30] = 0x5bdb656e
        0x20017b08:    4068        h@      EORS     r0,r0,r5
        0x20017b0a:    b2c1        ..      UXTB     r1,r0
        0x20017b0c:    6820         h      LDR      r0,[r4,#0]
        0x20017b0e:    4a09        .J      LDR      r2,[pc,#36] ; [0x20017b34] = 0x200001b0
        0x20017b10:    4068        h@      EORS     r0,r0,r5
        0x20017b12:    f7fffd75    ..u.    BL       advance_software_protect_get_cid ; 0x20017600
        0x20017b16:    68a3        .h      LDR      r3,[r4,#8]
        0x20017b18:    6862        bh      LDR      r2,[r4,#4]
        0x20017b1a:    406b        k@      EORS     r3,r3,r5
        0x20017b1c:    406a        j@      EORS     r2,r2,r5
        0x20017b1e:    e8bd4070    ..p@    POP      {r4-r6,lr}
        0x20017b22:    4904        .I      LDR      r1,[pc,#16] ; [0x20017b34] = 0x200001b0
        0x20017b24:    4804        .H      LDR      r0,[pc,#16] ; [0x20017b38] = 0x8008120
        0x20017b26:    f7ffbb37    ..7.    B        $Ven$TT$L$$sissdk_ecdsa_verify ; 0x20017198
    $d
        0x20017b2a:    0000        ..      DCW    0
        0x20017b2c:    20000064    d..     DCD    536871012
        0x20017b30:    5bdb656e    ne.[    DCD    1541105006
        0x20017b34:    200001b0    ...     DCD    536871344
        0x20017b38:    08008120     ...    DCD    134250784

** Section #5 '.debug_abbrev' (SHT_PROGBITS)
    Size   : 1476 bytes


** Section #6 '.debug_frame' (SHT_PROGBITS)
    Size   : 7636 bytes


** Section #7 '.debug_info' (SHT_PROGBITS)
    Size   : 135496 bytes


** Section #8 '.debug_line' (SHT_PROGBITS)
    Size   : 50632 bytes


** Section #9 '.debug_loc' (SHT_PROGBITS)
    Size   : 28128 bytes


** Section #10 '.debug_macinfo' (SHT_PROGBITS)
    Size   : 522812 bytes


** Section #11 '.debug_pubnames' (SHT_PROGBITS)
    Size   : 8070 bytes


** Section #12 '.symtab' (SHT_SYMTAB)
    Size   : 20688 bytes (alignment 4)
    String table #13 '.strtab'
    Last local symbol no. 933


** Section #13 '.strtab' (SHT_STRTAB)
    Size   : 23952 bytes


** Section #14 '.note' (SHT_NOTE)
    Size   : 32 bytes (alignment 4)


** Section #15 '.comment' (SHT_PROGBITS)
    Size   : 104616 bytes


** Section #16 '.shstrtab' (SHT_STRTAB)
    Size   : 164 bytes


